treeData = {
    "name": "生命起源史",
    "time": "137.98亿年前",
    "description": "自然发生论，或者说生命起源[2][3][4][a]，指的是自然历程中无生命物质如何演变为有机分子乃至生命的学说[5]:vi[3][6][7]:47。目前普遍接受的假设是，地球上从非生物到生物的过渡不是一个单一的事件，而是一个进化的过程（即一个复杂性逐渐增加的过程），其中涉及到宜居星球的形成、有机分子的前生物合成、可自我复制、自组装、自催化的分子，及细胞膜的出现。[8][9][10]对这一过程的不同阶段，存在许多假说。[11]←地球形成←水的起源←最后共同祖先←最早化石形成←后期重轰炸期←氧气起源←朋哥拉冰河时期*←大氧化事件←休伦冰河时期*←有性生殖起源←多细胞生物起源←真菌起源←植物起源←动物起源←成冰纪*←埃迪卡拉生物群←寒武纪大爆发←安地斯冰河时期*←四足类起源←晚古生代大冰期*←猿及人类起源←第四纪冰河时期*（百万年）*冰河时期对生物起源的研究旨在确定前生命化学反应如何在与今日截然不同的环境下产生生命[12]:29。其主要使用生物学和化学理论为工具[13]，最近的研究试图综合更多学科探讨这一问题。生命活动主要依托碳和水的专门化学反应，主要依赖4类主要的化学物质：用于构建细胞膜的脂质、糖类等碳水化合物、用于蛋白质代谢的氨基酸，以及用于遗传机制的核酸，分为DNA和RNA两种。任何成功的生物起源学说，都必须对这些分子类别的起源和相互作用加以解释[14]。许多研究生物起源的方法都在研究自我复制的分子或其组成部分是如何产生的。研究者们普遍认为，目前的生命来自RNA世界[15]，不过在RNA诞生之前，可能已经存在别的可以自我复制的分子。",
    "src": "./static-2/生命起源.jpg",
    "children": [
        {
            "name": "冥古宙",
            "time": "45.4亿年前",
            "description": "冥古宙（英语：Hadean）又称冥古代，是地球地质历史上四个宙之中的第一个，也是最古老的前寒武纪地质时期。冥古宙始于45.4亿年前地球形成之初，结束于38.4亿年前内太阳系后期重轰炸期结束（但依据不同的文献可能有不同的定义），下启太古宙。因为冥古宙时期地壳尚未固化，地表遍布岩浆，除熔点极高的锆石外没有任何岩层能幸存至今，因此无法用传统的地质学标准分化地质时期。现今学术界有人尝试使用月球地质年代进行相应划分，将冥古宙分为隐生代（Cryptic）、盆地群代（Basin Groups）、酒海纪（Nectarian）和雨海代（Imbrian，其实只对应早雨海世）四个非正式的代。除此之外还有一个尚存争议的混沌代（Chaotian），用来对应大碰撞导致月球形成之前的时期。冥古宙的英文名称来源于古希腊神话中的冥界以及冥王哈迪斯，原因是科学家估测的当时地表状况很符合西方文化对地狱的描述。这个名称最初是由美国科学家小普雷斯顿·埃塞勒·克罗德于1972年所提出的，原本是用来指比已知最早岩石还要之前的时期。冥古宙的最后一个代对应早雨海世，以月球的东方海撞击事件为结束时间。",
            "children": [
                {
                    "name": "宇宙诞生",
                    "time": "137.98亿年前",
                    "description": "宇宙是广袤空间和其中存在的各种天体以及弥漫物质的总称。宇宙起源是一个极其复杂的问题。 宇宙是物质世界，它处于不断的运动和发展中。千百年来，科学家们一直在探寻宇宙是什么时候、如何形成的。直到今天，许多科学家认为，宇宙是由大约137亿年前发生的一次大爆炸形成的。宇宙内的所存物质和能量都聚集到了一起，并浓缩成很小的体积，温度极高，密度极大，瞬间产生巨大压力，之后发生了大爆炸，这次大爆炸的反应原理被物理学家们称为量子物理。大爆炸使物质四散出去，宇宙空间不断膨胀，温度也相应下降，后来相继出现在宇宙中的所有星系、恒星、行星乃至生命。",
                    "children": [
                        {
                            "name": "宇宙背景",
                            "time": "137.98亿年前",
                            "description": "宇宙诞生标志着时间、空间和物质的起源。",
                            "src": "./static-2/宇宙背景.jpg"
                        }
                    ],
                    "src": "./static-2/宇宙诞生.jpg"
                },
                {
                    "name": "银河系诞生",
                    "time": "136亿年前",
                    "description": "银河系（英文： The Milky Way Galaxy），是太阳系所在的棒旋星系，其D25等光直径为26.8±1.1 kpc（87400±3600光年），呈现巨大的盘面结构。最近研究表明银河系拥有四条清晰明确且比较对称的旋臂 [1]，旋臂处约为 1,000 光年的厚度（在凸起处更多）。银河系暗物质晕也包含一些可见恒星，直径延伸到613kpc（约200万光年） [2]。银河系自内向外分别由银心、银核、银盘、银晕和银冕组成，年龄大概在100亿岁左右，其中央区域多数为老年恒星，外围区域多数为新生和年轻的恒星。银河系约为1.5万亿倍太阳质量，包含约1000~4000亿颗恒星，且至少有相同数量的行星 [3]。银河系整体作较差自转，在太阳处的自转速度约220km/s，而太阳系位于距离银心约8.3 kpc（27000光年）的猎户臂内缘，这是气体和尘埃形成浓集区之一。银心存在一个被称为人马座A*的强烈射电源，中心存在一个410±3.4万太阳质量的超大质量黑洞 [4]。大、小麦哲伦云以及部分矮星系是银河系的卫星星系，属于本星系群，本星系群属于室女座超星系团，继而属于拉尼亚凯亚超星系团的一部分 [5]，而银河系正在通过缓慢地吞噬周边的矮星系使自身不断壮大。",
                    "children": [
                        {
                            "name": "银河系形成",
                            "time": "130-80亿年前",
                            "description": "银河系在一个巨大的气体和尘埃云中逐渐形成。",
                            "src": "./static-2/银河系形成.jpg"
                        }
                    ],
                    "src": "./static-2/银河系诞生.jpg"
                },
                {
                    "name": "太阳形成",
                    "time": "45.7亿年前",
                    "description": "太阳系的形成和演化始于46亿年前一片巨大分子云中一小块的引力坍缩。大多坍缩的质量集中在中心，形成了太阳，其余部分摊平并形成了一个原行星盘，继而形成了行星、卫星、陨星和其他小型的太阳系天体系统。这被称为星云假说的广泛接受模型，最早是由18世纪的伊曼纽·斯威登堡、伊曼努尔·康德和皮埃尔-西蒙·拉普拉斯提出。其随后的发展与天文学、物理学、地质学和行星学等多种科学领域相互交织。自1950年代太空时代降临，以及1990年代太阳系外行星的发现，此模型在解释新发现的过程中受到挑战又被进一步完善化。从形成开始，太阳系经历了相当大的变化。有很多卫星由环绕其母星气体与尘埃组成的星盘中形成，其他的卫星据信是俘获而来，或者来自于巨大的碰撞（地球的卫星月球属此情况）。天体间的碰撞都持续发生，并为太阳系演化的中心。行星的位置经常迁移，某些行星间已经彼此易位。这种行星迁移被认为对太阳系早期演化起负担起绝大部分的作用。就如同太阳和行星的出生一样，它们最终将灭亡。大约50亿年后，太阳会冷却并向外膨胀超过直径很多倍（成为一个红巨星），抛去它的外层成为行星状星云，并留下被称为白矮星的恒星尸骸。在遥远的未来，太阳的环绕行星会逐渐被经过的恒星的引力卷走。它们中的一些会被毁掉，另一些则会被抛向星际间的太空。最终，数万亿年之后，太阳终将会独自一个，不再有其它天体在太阳系轨道上",
                    "children": [
                        {
                            "name": "太阳系形成",
                            "time": "45.7亿年前",
                            "description": "太阳在一个坍缩的氢分子云内形成，标志着太阳系的诞生。",
                            "src": "./static-2/太阳系形成.jpg"
                        }
                    ],
                    "src": "./static-2/太阳形成.jpg"
                },
                {
                    "name": "地球形成",
                    "time": "45.7亿年前",
                    "description": "地球形成时基本上是各种石质物的混合物，如果积聚过程持续~年，则短寿命放射性元素的衰变和固体颗粒动能的影响都不大。初始地球的平均温度估计不超过1000℃，所以全部处于固态。形成后，由于长寿命放射性物质的衰变和引力位能的释放，内部慢慢增温，以致原始地球所含的铁元素转化成液态，某些铁的氧化物也将还原。液态铁由于密度大而流向地心，形成地核（这个过程何时开始，已否结束，意见颇有分歧）。由于重的物质向地心集中，释放的位能可使地球的温度升高约2000℃。这就促进了化学分异过程，由地幔中分出地壳。地壳岩石受到大气和水的风化和侵蚀，产生了沉积和沉积岩，后者受到地下排出的气体和溶液，以及温、压的作用发生了变质而形成了变质岩。这些岩石继续受到以上各种作用，可能经受过多次轮回的熔化和固结，先形成一个大陆的核心，以后增长成为大陆。原始地球不可能保持大气和海洋，它们都是次生的。海洋是地球内部增温和分异的结果，但大气形成的过程要更复杂。原生的大气可能是还原性的。当绿色植物出现后，它们利用太阳辐射使水气（H2O）和CO2发生光合作用，产生了有机物和自由氧。当氧的产生多于消耗时，自由氧才慢慢积累起来，在漫长的地质年代中，便形成了主要由氮和氧所组成的大气。",
                    "children": [
                        {
                            "name": "地球诞生",
                            "time": "45.7亿年前",
                            "description": "地球从环绕早期太阳旋转的吸积盘中形成。",
                            "src": "./static-2/地球诞生.jpg"
                        }
                    ],
                    "src": "./static-2/地球形成.jpg"
                },
                {
                    "name": "月球形成",
                    "time": "45.33亿年前",
                    "description": "月球的起源莫衷一是。对月球的起源，历史上大致有三大派。而后期则在各种说法的基础上，结合新的研究结果而新形成了“大碰撞说”。-----分裂说 : 这是最早解释月球起源的一种假设。早在1898年，著名生物学家达尔文的儿子乔治·达尔文就在《太阳系中的潮汐和类似效应》一文中指出，月球本来是地球的一部分，后来由于地球转速太快，把地球上一部分物质抛了出去，这些物质脱离地球后形成了月球，而遗留在地球上的大坑，就是太平洋。这一观点很快就受到了一些人的反对。他们认为，以地球的自转速度是无法将那样大的一块东西抛出去的。再说，如果月球是地球抛出去的，那么二者的物质成分就应该是一致的。可是通过对“阿波罗12号”飞船从月球上带回来的岩石样本进行化验分析，发现二者相差非常远。月球表面岩石的年龄极其古老，全月球表面岩石的年龄介于30亿～42亿年之间，地球表面最古老的岩石年龄，只限于个别地区出露的38亿年的古老变质岩，而太平洋洋底岩石的年龄极其年轻，完全与“分裂说”的理论相违背。-----俘获说 : 这一假设认为，月球本来只是太阳系中的一颗月球大小的小行星，有一次，因为运行到地球附近，被地球的引力所俘获，从此再也没有离开过地球。还有一种接近俘获说的观点认为，地球不断把进入自己轨道的物质吸积到一起，久而久之，吸积的东西越来越多，最终形成了月球。但也有人指出，像月球这样大的星球，地球恐怕没有那么大的力量能将它俘获。-----同源说 : 这一假设认为，地球和月球都是太阳系中弥漫的星云物质，几乎在同一个太阳星云的区域经过旋转和吸积，同时形成大小不同的天体。在吸积过程中，地球比月球相应要快一点，成为“哥哥”。这一假设也受到了客观事实的挑战。通过对“阿波罗”飞船从月球上带回来的岩石样本进行化验分析，地球和月球的平均化学成分差别很大，人们发现月球的岩石也要比地球的岩石古老得多。------碰撞说 : 这一假设认为，太阳系演化早期，在太阳系空间曾形成大量的“星子”，先形成了一个相当于地球质量0.14倍的天体星子，星子通过互相碰撞、吸积而长合并形成一个原始地球。这两个天体在各自演化过程中，分别形成了以铁为主的金属核和由硅酸盐构成的幔和壳。由于这两个天体相距不远，因此相遇的机会就很大。 [5]一次偶然的机会，那个小的天体以每秒5千米左右的速度撞向地球。剧烈的碰撞不仅改变了地球的运动状态，使地球的自转轴倾斜，而且还使那个小的天体被撞击破裂，硅酸盐壳和幔受热蒸发，膨胀的气体以极大的速度携带大量粉碎了的尘埃飞离地球。这些飞离地球的物质，主要由碰撞体的幔组成。受到巨大撞击的地球，绝大部分也是地幔和地壳物质受热蒸发，膨胀的气体以极大的速度携带大量粉碎了的尘埃飞离地球。在撞击体破裂时与幔分离的金属核，因受膨胀飞离的气体所阻而减速，大约在4小时内被吸积到地球上。飞离地球的气体和尘埃，并没有完全脱离地球的引力控制，通过相互吸积而结合起来，形成几乎熔融的月球，或者是先形成一个环，在逐渐吸积形成一个部分熔融的大月球。这个版本被普遍认可。这个模型清晰地解释了，月球的平均成分与地球的平均成分相比较，月球相对贫铁、贫挥发分，月球的密度比地球低。具有地球和月球“基因”对比特征的某些元素的同位素组成，如氧、铬、钛、铁、钨、硅等的同位素组成，月球与地球的测定值在误差范围内相一致，表明月球是地球的“女儿”。45亿年来，地球一直携带着自己的女儿在身边，而月球也一直伴随着自己的母亲，共同经历了45亿年漫长而荒古的年代。",
                    "children": [
                        {
                            "name": "大碰撞假说",
                            "time": "45.33亿年前",
                            "description": "原始地球与忒伊亚相撞，产生月球，同时导致地球自转轴倾斜。",
                            "src": "./static-2/大碰撞假说.jpg"
                        }
                    ],
                    "src": "./static-2/月球形成.jpg"
                },
                {
                    "name": "地壳形成",
                    "time": "44亿年前",
                    "description":"地球地壳是指地球地表至莫氏不连续面之间，主要由火成岩，变质岩和沉积岩构成的薄壳，是岩石圈组成的一部分，平均厚度17公里，地壳下面的是地幔，上地幔大部分由橄榄石（一种比普通岩石密度大很多的岩石）构成。地壳和地幔之间的分界线被称为莫氏不连续面。地壳的质量只占全地球0.2%，按结构分为大陆地壳和海洋地壳两种。大陆地壳有硅酸铝层（花岗岩质）和硅酸镁层（玄武岩质）双层结构，而海洋地壳只有硅酸镁层（玄武岩质）单层结构，大陆地壳平均厚度有33公里，海洋地壳平均厚度只有10公里。地壳的温度随着其不断加深而逐渐升高，从200°C（392°F）到400°C（752°F）不等。",
                    "children": [
                        {
                            "name": "地壳形成过程",
                            "time": "44亿年前",
                            "description": "地球表面温度降低，地壳开始凝固形成。",
                            "src": "./static-2/地壳形成过程.jpg"
                        }
                    ],
                    "src": "./static-2/地壳形成.jpg"
                },
                {
                    "name": "大气与海洋形成",
                    "time": "42-40亿年前",
                    "description": "大约 4.6 亿年前，地球由年轻太阳周围的尘埃和气体形成。 在早期，地球经历了剧烈的地质和化学变化，为其大气和海洋的发展奠定了基础。 这一时期发生的过程为生命的出现和我们今天观察到的错综复杂的相互关联的生态系统网络奠定了基础。早期的气氛与我们今天呼吸的气氛截然不同。 它主要由行星形成过程中释放的气体组成，包括水蒸气、二氧化碳、甲烷、氨和微量的其他挥发性化合物。 随着时间的推移，大气层和地球表面之间复杂的相互作用导致其成分发生显着变化，标志着持续塑造地球的动态关系的开始。海洋的形成是地球历史上的一个关键事件。 这些巨大的水体覆盖了地球表面约 70% 的面积，对于调节温度和气候至关重要。 地球海洋的起源与火山放气以及富含水的彗星和小行星的输送等过程密切相关。 地表水的逐渐积累，为生命的发展和生存创造了适宜的环境。研究地球早期的大气和海洋涉及揭示地质、化学和生物过程的复杂相互作用。 科学研究，包括地质证据、地球化学分析和计算机模拟，有助于我们了解这些早期系统如何演化并影响行星历史的进程。在这次探索中，我们深入研究了导致地球早期大气转变、海洋形成的各种因素，以及它们对海洋的出现和形成的集体影响。 生命的进化。 当我们拼凑出地球过去的谜团时，我们对维持地球生命的微妙平衡以及可能在浩瀚宇宙中的其他天体上孕育生命的潜在条件获得了宝贵的见解。",
                    "children": [
                        {
                            "name": "大气圈与海洋",
                            "time": "42亿年前",
                            "description": "地球表面温度进一步降低，大气与海洋形成, 撞击带来的水分形成最初的海洋",
                            "src": "./static-2/大气圈与海洋.jpg"
                        }
                    ],
                    "src": "./static-2/大气与海洋形成.jpg"
                },
                {
                    "name": "最早生命的出现",
                    "time": "40-38亿年前",
                    "description": "创造论 : 创造论否认一切的事物是自然形成的说法。它认为哪怕是正在呼吸的空气，也是需要被创造才得以产生。比如基督教的上帝，PM的阿尔修斯。目前人类正在面临各种自然资源枯竭,生态平衡被破坏而带来的各种灾难的情况下，对大自然的驾驭更是感到无能为力。人类无能为力的时候，还能做什么呢？唯有依靠神。这不是愚昧，而是人的本能就是这样。在《圣经》上说，“起初，神创造天地。”。创造论已经被证明为是一种荒谬的解释。这种解释的根源是类比于人的制造能力，以及对概率论的错误应用。比如某宗教徒用手表自我形成的概率为零必然有造表者来证明人是被创造的。这种推理的根本错误在于他不懂得自然界普遍存在的自组织现象（如雪花、沙丘在一定条件下自动形成某种规则的形状，这显然不是被某高级主体有意制造的，而且也不能用概率论来推断）。生命体的最根本特征是自组织的，不是被制造的（这样就能清楚地看出来神创论的逻辑错误所在）。现代科技使 人类拥有了非凡的制造能力，但却对更多的生命问题无能为力，原因也在于生命是自组织的而不是被制造的，制造能力再大也无能为力。-----自然发生说 : 又称“自生论”或“无生源论”，认为生物可以随时由非生物产生，或者由另一些截然不同的物体产生。如中国古代所谓“肉腐出虫，鱼枯生蠹”、亚里士多德说的“……有些鱼由淤泥及砂砾发育而成”。中世纪有人认为树叶落入水中变成鱼，落在地上则变成鸟等。自然发生说是19世纪前广泛流行的理论，这种学说认为，生命是从无生命物质自然发生的。如，我国古代认为的“腐草化为萤”（即萤火虫是从腐草堆中产生的），腐肉生蛆等。在西方，亚里士多德（公元前384~公元前322年）就是一个自然发生论者。有的人还通过“实验”证明，将谷粒、破旧衬衫塞入瓶中，静置于暗处，21天后就会产生老鼠，并且让他惊讶的是，这种“自然”发生的老鼠竟和常见的老鼠完全相同。19世纪时，法国微生物学家巴斯德（LouisPasteur） (1821-1895.9.25)发现，将肉汤置于烧瓶中加热，沸腾后让其冷却，如果将烧瓶开口放置，肉汤中很快就繁殖生长出许多微生物；但如果在瓶口加上一个棉塞，再进行同样的实验，肉汤中就没有微生物繁殖。巴斯德认为，肉汤中的小生物来自空气，而不是自然发生的。他的实验为科学家进一步否定“自然发生论”奠定了坚实的基础。1860年，法国微生物学家巴斯德设计了一个简单但令人信服的实验，彻底否定了自然发生说。-----化学起源说 : 化学起源说是被广大学者普遍接受的生命起源假说。这一假说认为，地球上的生命是在地球温度逐步下降以后，在极其漫长的时间内，由非生命物质经过极其复杂的化学过程，一步一步地演变而成的。【米勒实验】米勒在他的实验中假设在生命起源之初大气层中只有氢气、氨气和水蒸气等物 [1]，其中并没有氧气等，当他把这些气体放入模拟的大气层中并通电引爆后，发现其中产生了些蛋白质，而蛋白质是生命存在的形式，因此他认为生命是从无到有的理论将可确立了。证明生命是进化而来的。但米勒的实验也有很多的疑点，例如所使用的能量大小，不同气体的配合等 虽然都产生了氨基酸、醣类等物质，但仍不能证明这就是生命的起源。因为他所假设的大气层不能证明是原始的大气层，所得的结果就是不确定的。米勒本身也承认他的实验与自然界生命起源相距仍很遥远。并且现代科学发现在火星上有氧气存在却没有生命，那么米勒假设大气层中没有氧气存在故没有生命之说就不成立，因此无法证明生命起源是由单细胞进化而来的。化学起源说将生命的起源分为四个阶段（米勒实验）。第一个阶段 : 从无机小分子生成有机小分子的阶段，即生命起源的化学进化过程是在原始的地球条件下进行的，这一过程教材中已有叙述，这里不再重复。需要着重指出的是米勒的模拟实验。在这个实验中，一个盛有水溶液的烧瓶代表原始的海洋，其上部球型空间里含有氢气、氨气、甲烷和水蒸汽等“还原性大气”。米勒先给烧瓶加热，使水蒸汽在管中循环，接着他通过两个电极放电产生电火花，模拟原始天空的闪电，以激发密封装置中的不同气体发生化学反应，而球型空间下部连通的冷凝管让反应后的产物和水蒸汽冷却形成液体，又流回底部的烧瓶，即模拟降雨的过程。经过一周持续不断的实验和循环之后。米勒分析其化学成分时发现，其中含有包括5种氨基酸和不同有机酸在内的各种新的有机化合物，同时还形成了氰氢酸，而氰氢酸可以合成腺嘌呤，腺嘌呤是组成核苷酸的基本单位。米勒的实验试图向人们证实，生命起源的第一步，从无机小分子物质形成有机小分子物质，在原始地球的条件下是完全可能实现的。第二个阶段 : 从有机小分子物质生成生物大分子物质。这一过程是在原始海洋中发生的，即氨基酸、核苷酸等有机小分子物质，经过长期积累，相互作用，在适当条件下（如黏土的吸附作用），通过缩合作用或聚合作用形成了原始的蛋白质分子和核酸分子。第三个阶段 : 从生物大分子物质组成多分子体系。这一过程是怎样形成的呢?前苏联学者奥巴林提出了团聚体假说，他通过实验表明，将蛋白质、多肽、核酸和多糖等放在合适的溶液中，它们能自动地浓缩聚集为分散的球状小滴，这些小滴就是团聚体。奥巴林等人认为，团聚体可以表现出合成、分解、生长、生殖等生命现象。例如，团聚体具有类似于膜那样的边界，其内部的化学特征显著地区别于外部的溶液环境。团聚体能从外部溶液中吸入某些分子作为反应物，还能在酶的催化作用下发生特定的生化反应，反应的产物也能从团聚体中释放出去。另外，有的学者还提出了微球体和脂球体等其他的一些假说，以解释有机高分子物质形成多分子体系的过程。图7团聚体简单代谢示意图第四个阶段，有机多分子体系演变为原始生命。这一阶段是在原始的海洋中形成的，是生命起源过程中最复杂和最有决定意义的阶段。人们还不能在实验室里验证这一过程。第四个阶段 : 有机多分子体系演变为原始生命。这一阶段是在原始的海洋中形成的，是生命起源过程中最复杂和最有决定意义的阶段。目前，人们还不能在实验室里验证这一过程。-----宇宙生命论 : 这一假说提倡“一切生命来自生命”的观点，认为地球上最初的生命来自宇宙间的其他星球，即“地上生命，天外飞来”。这一假说认为，宇宙太空中的“生命胚种”可以随着陨石或其他途径跌落在地球表面，即成为最初的生命起点。现代科学研究表明，在已发现的星球上，自然状况下是没有保存生命的条件的，因为没有氧气，温度接近绝对零度，又充满具有强大杀伤力的紫外线、X射线和宇宙射线等，因此任何“生命胚体”是不可能保存的。这个假说实际上把生命起源的问题推到了无边无际的宇宙中去了，同时这个假说对于“宇宙中的生命又是怎样起源”的问题，仍是无法解释的。-----宇生说 : 这一假说认为，地球上最早的生命或构成生命的有机物，来自于其他宇宙星球或星际尘埃。持这种假说的学者认为，某些微生物孢子可以附着在星际尘埃颗粒上而落入地球，从而使地球有了初始的生命。但我们知道，宇宙空间的物理条件，如紫外线等各种高能射线以及温度等条件对生命都是致命的，而且，即使有这些生命，在它们随着陨石穿越大气层到达地球的过程中，也会因温度太高而被杀死。因此，像微生物孢子这一水平的生命形态看来是不大可能从天外飞来的。但是，一些学者认为，一些构成生命的有机物完全有可能来自宇宙空间。1969年9月28日，科学家发现，坠落在澳大利亚麦启逊镇的一颗炭质陨石中就含有18种氨基酸，其中6种是构成生物的蛋白质分子所必须的。科学研究表明，一些有机分子如氨基酸、嘌呤、嘧啶等分子可以在星际尘埃的表面产生，这些有机分子可能由彗星或其陨石带到地球上，并在地球上演变为原始的生命。-----热泉生态系统 : 生命的起源可能与热泉生态系统有关，这是20世纪70年代以来，部分学者提出的观点。20世纪70年代末，科学家在东太平洋的加拉帕戈斯群岛附近发现了几处深海热泉，在这些热泉里生活着众多的生物，包括管栖蠕虫、蛤类和细菌等兴旺发达的生物群落。这些生物群落生活在一个高温（热泉喷口附近的温度达到300 ℃以上）、高压、缺氧、偏酸和无光的环境中。首先是这些化能自养型细菌利用热泉喷出的硫化物（如H2S）所得到的能量去还原CO2而制造有机物，然后其他动物以这些细菌为食物而维持生活。迄今科学家已发现数十个这样的深海热泉生态系统，它们一般位于地球两个板块结合处形成的水下洋嵴附近。热泉生态系统之所以与生命的起源相联系，主要基于以下的事实：（1）现今所发现的古细菌，大多都生活在高温、缺氧、含硫和偏酸的环境中，这种环境与热泉喷口附近的环境极其相似；（2）热泉喷口附近不仅温度非常高，而且又有大量的硫化物、CH4、H2和CO2等，与地球形成时的早期环境相似。由此，部分学者认为，热泉喷口附近的环境不仅可以为生命的出现以及其后的生命延续提供所需的能量和物质，而且还可以避免地外物体撞击地球时所造成的有害影响，因此热泉生态系统是孕育生命的理想场所。但另一些学者认为，生命可能是从地球表面产生，随后就蔓延到深海热泉喷口周围。以后的撞击毁灭了地球表面所有的生命，只有隐藏在深海喷口附近的生物得以保存下来并繁衍后代。因此，这些喷口附近的生物虽然不是地球上最早出现的，但却是现存所有生物的共同祖先。",
                    "src": "./static-2/最早生命的出现.jpg"
                },
                {
                    "name": "后期重轰炸期",
                    "time": "39亿年前",
                    "description": "晚期重轰炸，又名月球灾难，是指约于38亿至41亿年前，在月球上形成大量撞击坑的事件，对地球、水星、金星及火星亦造成影响。这个事件的证据主要是基于月球样板的测年结果，大部份陨击熔岩都是在一段短时间内出现。有很多的假说都在解释进入太阳系内侧的小行星或彗星碎片的成因，但却仍未有共识。其中一个著名的理论是指当时类木行星正进入轨道，将在小行星带或柯伊伯带的物体被引入同心轨迹并撞向类地球行星。虽然如此，有些争议指这些月球样板的数据并不一定来自这种灾难事件，而测年的结果聚集在同一段时间是因在同一的撞击盆地取板所致。",
                    "children": [
                        {
                            "name": "重轰炸事件",
                            "time": "39亿年前",
                            "description": "地球、月球、火星及金星受到小行星及彗星（微行星）撞击的高峰期。",
                            "src": "./static-2/重轰炸事件.jpg"
                        }
                    ],
                    "src": "./static-2/后期重轰炸期.jpg"
                }
            ],
            "src": "./static-2/冥古宙.jpg"
        },
        {
            "name": "太古宙",
            "time": "40亿年前",
            "description": "太古宙（英语：Archean）又称太古代、始生代，是地球地质历史中的第二个宙，上承冥古宙，下启元古宙。太古宙可细分为始太古代、古太古代、中太古代和新太古代四个代[1]，始于约40亿年前（由对月岩的同位素年龄确定）内太阳系后期重轰炸期结束[2]，结束于25亿年前的休伦冰河时期开始。地球的岩石圈在太古宙时期开始逐渐稳定并可以保留至今，以超级海洋为主的水圈也彻底成形。由原核微生物菌落组成的早期生物圈也形成于太古宙。-----定义 : 太古宙以最古老的岩石为定义，大约距今40亿年。更早的时期则定义为冥古宙。因此，若更早的岩石被发现，太古宙的定义即可往更古时代推，冥古宙则会被缩短。-----地质 : 太古宙开始时，地球的热流是目前的三倍。太古宙结束时，地球的热流是目前的两倍。这些热量来自于行星吸积形成地核释放出的引力势能与当时丰度更高的放射性元素衰变热。现存的太古宙岩石大部分是变质岩或火成岩。当时的火山活动极其猛烈、普遍，甚至喷出罕见的科马提岩，因此残留至今的太古宙地壳以花岗岩结晶为主，例如大面积熔岩或深成岩如花岗岩、二长岩、闪长岩、斜长岩、讃岐岩等。太古宙早期的地球可能有不同于现今形态的板块活动。一些学者认为当时地球的温度过高，板块运动活跃，因此地壳再循环更快，阻碍了克拉通的形成直至地幔降温对流减缓。另外的学者认为大洋岩石圈的浮力大以至于不能俯冲消减，而太古宙岩石的缺少是由于后来地质侵蚀作用。一派地质学家认为在太古宙末期以前大型大陆地壳并不存在，而当时剧烈的地质活动导致小型的原大陆（英语：protocontinent）不能联合在一起。另一部分以理查阿姆斯壮为代表的地质学家认为在地球形成五亿年时就有了现在规模的大陆，此后大陆地壳滑入地幔并维持着新地壳的诞生，使得板块运动保持着平衡。怀疑大陆存在的学者认为，长英质大陆板块形成于地幔热点而不是俯冲带。部分熔融的铁镁质通过底辟作用侵入地壳产生中性或长英质岩石。其他学者认为花岗岩质形成于俯冲带或聚合板块边缘的地质活动，并在太古宙之初就开始了。天体物理学家计算得到年轻太阳黯淡佯谬，太古宙时期太阳的辐射热量输出仅为70–75%，但当时地球表面温度不低于目前水平。造成地球温室效应的原因仍没有公论。由于较少的陆地与云层覆盖，地球的球面反照率可能更低。太古宙存在液态水，可以从沉积原岩深度变质而形成的片麻岩得以确证。太古宙末期，板块构造活动可能已经类似于现今的地球，例如有完好保存的沉积盆地，以及火山弧、陆内裂谷、大陆碰撞、全球范围的造山运动等证据暗示超大陆的形成与解体的循环。大洋盆地存在的证据可以从条带状铁矿、燧石矿床、枕状玄武岩得以证实。目前于地球表面发现的最古老岩石也形成于太古宙早期。在格陵兰、加拿大地盾、怀俄明克拉通、波罗的地盾、苏格兰、印度、巴西、西澳大利亚、南非都有发现。太古宙岩石仅覆盖了现今全世界的克拉通大约7%面积。考虑此后的侵蚀与解体，现在约仅有5-40%的大陆地壳是在太古宙形成的。-----生命 : 主条目：生命起源参见：海底热泉和层叠石太古宙是地球生命史的黎明时期。当时的地球主要是一个有极少陆地凸出水面的海洋行星，最早在深海的海底热泉周围开始形成由依赖化合作用的古菌和细菌组成的原核菌毯，其化石形成的叠层石可定年到35亿年前。之后用视黄醛衍生物（紫膜质）和卟啉衍生物（菌绿素）进行不产氧光合作用的早期光合自营者出现，使得微生物菌落可以扩展到远离海底热泉的浅海带和潮间带。在约34亿年前，可利用红蓝光谱的光能分解水分子进行产氧光合作用的蓝绿菌出现并不断释放氧气做为副产品，在之后十亿年间终于耗光了地表所有的还原剂物质（包括亚铁、硫磺、甲烷和硫化氢）后使得游离态氧气首次出现在海洋和空气中。这场大氧化事件彻底改变了地球大气层的化学成分，并且因为严重削弱了大气温室效应从而引发了历时三亿年的全球性大冰期——休伦冰河期。这次氧气浩劫严重摧残了当时主要以厌氧菌为主的生物圈，但也为能自产抗氧化剂的好氧菌和依赖内共生线粒体进行有氧呼吸的真核生物在日后元古宙的演化奠定了基础。",
            "children": [
                {
                    "name": "共同祖先",
                    "time": "38-35亿年前",
                    "description": "共同祖先是指衍生出一群生物的祖先，它可以指一个特定的类群，也可以指地球上所有的生命。很多人认为，存在一个最后的普遍性的共同祖先，地球上现存的和已经灭绝的所有生物都是自它衍生而来，它被称为LUCA（the Last Universal Common Ancestor）或LUA（the Last Universal Ancestor）。",
                    "children": [
                        {
                            "name": "原核生物出现",
                            "time": "35亿年前",
                            "description": "最后共同祖先（原核生物）在古太古代出现，属于单细胞生物，分化出细菌及古细菌。",
                            "src": "./static-2/原核生物出现.jpg"
                        },
                        {
                            "name": "细胞结构出现",
                            "time": "35-30亿年前",
                            "description": "早期原核生物都是化能生物，以二氧化碳为碳源及氧化无机物来抽取能量。",
                            "src": "./static-2/细胞结构出现.jpg"
                        },
                        {
                            "name": "蓝菌出现",
                            "time": "35亿年前",
                            "children": [
                                {
                                    "name": "光合作用蓝菌",
                                    "time": "34亿年前",
                                    "description": "能进行光合作用的蓝菌出现，以水为还原剂，并排出氧，导致海洋中铁氧化，产生铁矿石。",
                                    "src": "./static-2/光合作用蓝菌.jpg"
                                }
                            ],
                            "src": "./static-2/蓝菌出现.jpg"
                        }
                    ],
                    "src": "./static-2/最后共同祖先.jpg"
                },
                {
                    "name": "细菌演化光合作用",
                    "time": "34-29亿年前",
                    "description": "光合作用的本质是关于电子的，往二氧化碳上加几个电子，再加几个质子平衡电荷，就得到了一个有机分子——糖——生命之链，我们一切食物的根本来源。早期地球的原始细菌使用不那么稳定的溶解的铁、或者硫化氢，而不是水来作为光合作用的原材料。过程中也不会向空气中释放氧气，而是沉淀下硫单质。而碳原子也不是被这一小片耀眼的阳光激活，事实上它对光毫无反应。这些光合作用形态在今天氧气充沛的世界里已经边缘化，但在自由氧崛起之前的早期地球，却到处都是。那么，是什么契机让光合作用演化，将又多又好用的电子源切换成水？并释放出氧气这种对细菌造成严重伤害的废弃产物呢？这也是现代生物学里最引人争议的未解之谜之一，在此介绍一种猜测。通过X射线晶体学和电子自旋共振光谱成像等技术手段，我们已能在接近原子级别的分辨率上测量光合复合体的形态和结构。Bob Blankenship证明两套光系统共享同样的核心结构，而最初只有一个光系统。在历史上的某个时间，基因复制得到了两个一样的光系统，二者在天择作用下逐渐分家。John Allen假想有一种细菌同时拥有两套光系统，它一次只用一种，就好像许多细菌会随着环境的变化而开关基因。早期地球的环境波动，在有硫化氢的时候，它就切到光系统I，用二氧化碳生产有机物，所得物质整合到自己体内，用来生长繁殖；但如果条件变了，这些细菌就会切到光系统II，不再产生新的有机质，停止生长繁殖，用阳光直接产生ATP，直到条件好转为止。远古的海水里，铁和锰的浓度非常高。细菌将锰作为抗氧化剂，保护细胞免于紫外线的毁灭性打击。锰原子吸收光子丢出电子，变成光氧化状态。于是光系统II逐渐塞满电子，光系统I却因为没有电子而无所事事。细菌的基因突变，将阻止两个系统同时激活的开关禁用。“吝啬型”绿叶素吸光，电子被炸到高能级，并被一路传递链送下来，释放的能量产生了一点ATP。接着电子被光系统I捡走，“推销型”叶绿素吸收光后又把这些电子炸上高能级，从这里电子最终传给了二氧化碳，生成了新的有机质。这也是现代光合作用的核心“Z方案”的由来。Vittal Yachandra揭示了放氧复合体的远古晶体结构为四个锰原子被氧原子连接成晶格，附近还有一个钙原子。也许是锰原子在被紫外线氧化的时候，和氧原子以晶格形式相连。四个氧化的锰原子把电子从水中夺走，释放氧气作为废料。这个金属簇被蛋白质包裹起来，被蓝细菌收藏，开启了一个新世界。于是，两套光系统被蓝细菌的Z方案联系在一起，经过绿叶体传给了植物和藻类，并和这一小簇锰原子一起，成为了地球一切生命活力的推动者。",
                    "children": [
                        {
                            "name": "光合作用原始模式",
                            "time": "33亿年前",
                            "description": "细菌发展了光合作用的原始模式，最初不会产生氧，通过电化学梯度产生三磷酸腺苷（ATP）。",
                            "src": "./static-2/光合作用原始模式.jpg"
                        },
                        {
                            "name": "能量转换过程",
                            "time": "33亿年前",
                            "description": "原核生物演化了糖酵解，从如葡萄糖的有机物释出能量，产生了现今所有生物都用到的ATP分子。",
                            "src": "./static-2/能量转换过程.jpg"
                        }
                    ],
                    "src": "./static-2/细菌演化光合作用.jpg"
                },
                {
                    "name": "微生物造岩",
                    "time": "32-30亿年前",
                    "description": "微生物岩是由底栖生物群落的生长和生理活动引起沉积质点粘结和圈捕和/或表面矿物沉淀和/或生物矿化作用而产生的生物沉积岩”。其主要的类型包括叠层石、均一石、树形石、凝块石、核形石、纹理石以及某些碳酸岩颗粒－鲕粒、团粒、球粒和泥晶。其物质成分可由碳酸盐岩、磷块岩、铁岩、锰岩和有机质页岩组成，也可由硫化物岩、硫酸盐岩、粘土岩和各种碎屑岩组成。其形成环境从海洋(滨海至深海)、湖泊、河流、喷泉，到洞穴、风化壳和沙漠。",
                    "children": [
                        {
                            "name": "叠层岩出现",
                            "time": "28-25亿年前",
                            "description": "微生物开始造岩，叠层岩出现，这是由微生物活动形成的特定类型的沉积岩。",
                            "src": "./static-2/叠层岩出现.jpg"
                        }
                    ],
                    "src": "./static-2/微生物造岩.jpg"
                },

                {
                    "name": "大氧化事件",
                    "time": "26-25亿年前",
                    "description": "大氧化事件(Great Oxygenation Event, GOE)，是指约26亿年前，大气中的游离氧含量突然增加的事件。这一事件的具体原因尚不得知，只有若干种假说能加以解释。有说法认为，是由于海藻类植物进行光合作用，使得地球上的氧气迅速增加，而破坏氧气的甲烷细菌所依赖的镍元素的数量急剧减少，使得大气中的含氧量大量增加，所以称为“大气氧化事件”。大氧化事件使得地球上矿物的成分发生了变化，也使得日后动物的出现成为了可能。",
                    "children": [
                        {
                            "name": "大气氧浓度上升",
                            "time": "25-23亿年前",
                            "description": "大氧化事件导致大气中氧气浓度上升，对厌氧细菌有毒，促进了生物演化。-----地质证据 :关键证据来自硫同位素。光化学过程分解二氧化硫的过程能够造成非质量分馏，无氧的大气条件下分解形成的产物不会完全被氧化，因此地层沉积物中的硫带有非质量分馏的同位素特征。前寒武的硫化物和硫酸盐中发现24.5亿年前的大气中二氧化硫分馏就已经产生，而24.5-20.9亿年同位素发生变化，说明后一阶段大气中出现了氧气 [4]。此外还原性大气条件下化学风化中没有氧化过程，还原条件下的碎屑矿物如菱铁矿、黄铁矿等大量存在。而现今氧化的大气背景下，还原性质的碎屑矿物很难保存 [5]。-----直接产物 : 大氧化事件的直接产物（矿产效应）是条带状含铁建造（Banded iron formation, 即BIF）。这种细条带状硅质赤铁矿矿床由铁的氧化物、硫化物、碳酸盐类矿物和燧石构成条带状的互层沉积。二价铁只有被氧化成三价之后才会沉淀，沉淀说明当时的大气中已经含有氧气。同时周期性沉淀说明氧气含量不高，沉淀消耗的氧气需要蓝细菌一段时间进行补充。此外大氧化事件后，红土、富硫酸钙蒸发岩也进一步大量出现 [6]。-----氧气来源 : 大氧化事件的机制并非由于蓝细菌的产氧作用单一因素造成（因为光合作用细菌在27亿年前已经开始），可能是风化作用及火山作用等地球圈层过程共同影响的结果 [7-8]。-----长远影响及意义 : 大氧化事件对表层环境带来了全方位多尺度范围内的巨大变化。在还原及高温室大气成分的条件下很难出现的冰期在地球上开始出现，表生矿物种类急剧增多。同时大气自由氧的升高使得环境温度发生了明显变化，促进了地球复杂生命体的形成和演化 [9]。",
                            "src": "./static-2/大气氧浓度上升.jpg"
                        },
                        {
                            "name": "海洋氧化",
                            "time": "25-23亿年前",
                            "description": "海洋中的铁被氧化，形成大规模的条带状铁建造（BIF）。",
                            "src": "./static-2/海洋氧化.jpg"
                        }
                    ],
                    "src": "./static-2/大氧化事件.jpg"
                }
            ],
            "src": "./static-2/太古宙.jpg"
        },
        {
            "name": "元古宙",
            "time": "25亿年前",
            "description": "元古宙（Proterozoic，符号PR），又称元古代、原生代，是地球地质历史中的第三个宙，也是前寒武纪最晚的一个地质时期。元古宙分为古元古代、中元古代和新元古代三个代，始于同位素年龄25亿年前（2500 Mya）由大氧化事件引起的休伦大冰期，上承太古宙；结束于5.42亿年前（542.0±1.0 Mya）的埃迪卡拉纪末大灭绝，下启显生宙，跨度近20亿年，是四大宙中历时最久的一个。元古宙的英文名称Proterozoic源自希腊语词根protero-（意思是“更早”）与zoic-（意思是“动物”），因为其是生命史上奠定生物演化方向的重要时期——能屏障紫外线照射地表的臭氧层成形于元古宙，地球历史上对生物圈造成重创并迫使生物多样性彻底大洗牌的两次全球性大冰期（休伦大冰期和成冰纪大冰期）也都发生在这个时期。最早的内共生、真核生物、多细胞生物和有性繁殖以及最早的原虫、藻类和动物也都出现于元古宙。-------生物 : 参见：内共生、无聊十亿年和阿瓦隆大爆发元古宙时期已经发现了许多微生物、原虫、真菌和藻类化石，因此也被称为菌藻时代。最早的真核生物在古元古代出现，源自大氧化事件后好氧真细菌寄居在厌氧古菌的内膜系统内最终变成线粒体的内共生事件。在中元古代，真核生物再次和被胞吞掉的蓝绿菌发生内共生使其变成叶绿体，能够光合作用的真核生物——原始质体生物（广义上的藻类）也因此出现，并在之后数亿年间逐渐取代了蓝绿菌成为地球生物圈主要的氧气和有机物生产者，直到在显生宙古生代中期才被志留纪—泥盆纪陆地革命中繁盛的陆地植物所取代。元古宙中期的间冰期因为环境普遍硫化缺氧导致整整十亿年间生物演化速度迟缓，但仍出现了最早的多细胞生物和有性繁殖以及最原始的多孔动物（海绵）。在成冰纪大冰期消退后，元古宙末期的埃迪卡拉纪出现大量软体多细胞生物并发生演化辐射，同时也出现了最早的刺胞动物、扁盘动物和两侧对称动物（包括已灭绝的前分节动物和原始的软体动物、环节动物、泛节肢动物和棘皮动物），但这些动物都不具有能形成化石的矿化骨骼，因此只留下少量模铸化石和遗迹化石。这也使得后世的古生物学界曾一度错误的认为前寒武纪没有复杂生物存在。------大气 : 主条目：氧气地质历史、大氧化事件和新元古代氧化事件元古宙早期的大气因为大氧化事件开始有游离态氧气出现，但在地表还原剂物质（如亚铁、硫等）被氧化耗尽之前，氧气的占比几乎可以忽略不计。在23亿年前条状铁层沉积停止后，大气中氧气含量也仅为0.1%~0.2%（即现今浓度的0.5%~1%）。休伦冰河期结束后，地球进入了一个气候地质稳定但硫化缺氧的十亿年时期，直到8.5亿年前因为可固氮的蓝绿菌和更能适应严酷环境的原始质体生物（绿藻和红藻等）开始繁盛，大气中含氧量才真正开始不断稳固爬升，在元古宙末期达到1%~2%（约现今水平的10%），史称新元古代氧化事件。大气中游离氧气的提升也使其较不稳定的三原子同素异构体——臭氧得以在平流层底部长期存在，最终形成了可以屏蔽高能紫外线电离辐射（UVB和UVC）的臭氧层。因为游离氧气与大气甲烷的自发氧化反应和不间断的光合固碳移除二氧化碳都大大减弱了温室效应，加上太阳辐射和地热活动波动的影响，元古宙在早期和后期都发生了全球性的大冰期，世界各地（包括赤道）都发现了冰川遗迹。元古宙早期古元古代的成铁纪和层侵纪有历时三亿年的休伦冰河期，而元古宙后期的新元古代至少有四次大的冰期，即成冰纪的斯图尔特冰期、马林诺冰期和埃迪卡拉纪的噶斯奇厄斯冰期、拜科努尔冰期，其中至少前两者是全球性的大冰期，且因其间隔很短所以合称为“雪球地球事件”。------地质 : 元古宙也曾发生广泛的地壳运动，在前期是地球主要的造山时期，现代大陆地壳的43%都形成于元古宙，相比之下39%形成于太古宙，仅18%形成于显生宙。对花岗岩放射性定年表明，元古宙有五次大陆增生时期，但规模一次比一次小。元古宙开始了超大陆旋回，前半时间占支配地位的是哥伦比亚超大陆，形成于20亿至18亿年前，在13亿年前解体。在中国北方为吕梁构造期。罗迪尼亚超大陆存在于新元古代（11.5亿到7亿年前），以劳亚大陆（今北美大陆）为核心，格林威尔造山运动形成了阿巴拉契亚山脉。元古宙时期的地层中蕴藏有丰富的铁矿、铜矿和稀土金属矿物，地层比较完整，较少变质，陆间海沉积分布广泛。",
            "children": [
                {
                    "name": "好氧细菌出现",
                    "time": "25-23亿年前",
                    "description": "亦称需氧菌、需氧微生物。在有氧环境中生长繁殖，氧化有机物或无机物的产能代谢过程，以分子氧为最终电子受体，进行有氧呼吸。包括大多数细菌、放线菌和真菌。没有氧就根本不能生长的细菌，称作专性好氧细菌。有很多细菌是好氧细菌，特别是大多数化能自养细菌、醋酸菌、枯草杆菌（枯草芽孢杆菌）、结核菌、固氮菌等均为专性好氧细菌。此外，有一种在分压低于0.2标准大气压下也能够良好生长的细菌，称它为微好氧细菌。",
                    "children": [
                        {
                            "name": "细菌演化",
                            "time": "25-23亿年前",
                            "description": "一些细菌演化到有能力去使用氧来有效地从有机物中抽取能量。",
                            "src": "./static-2/细菌演化.jpg"
                        },
                        {
                            "name": "能量代谢",
                            "time": "25-23亿年前",
                            "description": "几乎所有好氧细菌都用相同的三羧酸循环及氧化磷酸化来使用氧；厌氧细菌大量灭绝。",
                            "src": "./static-2/能量代谢.jpg"
                        }
                    ],
                    "src": "./static-2/好氧细菌出现.jpg"
                },
                {
                    "name": "大氧化事件影响",
                    "time": "25-23亿年前",
                    "description": "大氧化事件（英语：Great Oxygenation Event或Great Oxidation Event），也有氧气灾变（Oxygen Catastrophe）、氧气浩劫（Oxygen Holocaust）、氧气危机（Oxygen Crisis）、氧气革命（Oxygen Revolution）等不同称呼，指地球地质历史上在约26亿年前的太古宙—元古宙交界期海洋和大气层内的氧气含量突然增加的一段时间。在此之前的早期大气并没有游离态的氧气，而是个主要成分由氮气、甲烷、氨气、二氧化碳和硫化氢等物质组成的还原性大气，任何游离氧气都会很快被这些还原剂通过氧化还原反应移除掉。然而在新太古代末期，游离氧气的证据首次出现在地质记录中，说明地球大气从还原性大气开始转为了氧化性大气。这些新出现的氧来自蓝绿菌的产氧光合作用，是叶绿素捕捉日光中的红蓝光分解水分子获取氢正离子进行固碳过程中的副产物。但蓝绿菌至少在中太古代就已出现，到大氧化事件时已经存在近10亿年，却直到新太古代末期才有游离氧气在短时间内突然增加，其完整原因尚不得知，目前只有若干种假说能解释。目前最受欢迎的说法是之前海洋和地表含有的还原性物质（特别是亚铁、硫和大气甲烷）仍然很多，氧气被移除的速度仍然高于其生产速度，直到新太古代因为还原剂逐渐枯竭才跨过临界点使得氧气的生产超过消耗，导致没被消耗移除的游离氧气首次成规模的出现在海洋和大气中。大氧化事件永久性的改变了地球大气的成分，也在岩层中留下了例如条状铁层那样的矿石层。同时，因为曾在原始大气中有相当占比的甲烷与新生的氧气发生化学反应被大量消耗，使得温室效应锐减，在之后的新元古代引发了历时三亿年的休伦大冰期。极端的气候变化加上氧气活性对遗传物质和有机物的氧化破坏力，直接摧残了当时以海生厌氧原核菌毯为主的生物圈，造成了严格意义上可能是生命史上最为严重的一次灭绝事件。但选择压力的改变也促进诞生了各类好氧菌和由好氧细菌与厌氧古菌发生内共生而演变出的真核生物，有氧呼吸所提供的强大潜能也使得日后藻类、原虫、真菌、动物和植物等复杂生命的演化成为可能[2]。",
                    "children": [
                        {
                            "name": "大气变化",
                            "time": "25-23亿年前",
                            "description": "由于大氧化事件，大气中的还原性气体基本耗尽，海洋和地壳中的铁元素与氧气反应，形成大量红色的石英砂岩和赤铁矿。",
                            "src": "./static-2/大气变化.jpg"
                        }
                    ],
                    "src": "./static-2/大氧化事件影响.jpg"
                },
                {
                    "name": "休伦冰河期",
                    "time": "24-21亿年前",
                    "description": "形成由来 : 大氧化事件使空气中的温室气体甲烷以氧化的方式被大量消耗。这是地质史上最严重且持续时间最长的一次冰河时期，与成冰纪出现的相对短暂的雪球地球事件很相似。成冰纪是发生于8亿5000万年前到6亿3500万年前之间的一个地质时期。命名的由来是因为相关的地质学证据是从北美的休伦湖地区搜集而来的，在此地能发现有3处彼此分隔的冰期沉淀物地层被非冰期沉淀物所分隔开来。------造成原因 : 休伦冰河时期可能是由大氧化事件造成的，或是由长达2.5亿年的火山活动的死寂造成的，也有可能是二种因素共同造成的。这些可能的原因都最终导致二氧化碳水平变得更低以及温室效应的减弱。然而，对于此次事件的准确成因还没有一致认可的说法。------世界纪录 : 休伦冰河时期是最长的冰期。（吉尼斯世界纪录）",
                    "children": [
                        {
                            "name": "气候变化",
                            "time": "23-20.5亿年前",
                            "description": "由于大氧化事件，甲烷被氧气消耗殆尽，地表热量以长波辐射形式散逸到太空，造成地表温度骤降，地球表面第一次被冰雪覆盖。",
                            "src": "./static-2/气候变化.jpg"
                        }
                    ],
                    "src": "./static-2/休伦冰河期.jpg"
                },
                {
                    "name": "复杂细胞出现",
                    "time": "18.5亿年前",
                    "description": "多细胞生物已经独立进化了 50 多次，至少在 30 亿年前出现在蓝藻中。其中“复杂的多细胞性”，即所谓具有许多特殊细胞类型、寿命相对较长的大型生物体，只出现了5次大规模独立进化，全部发生在真核生物（动物、植物、真菌、褐藻和红藻）内，没有出现在原核生物中。学界提出了许多假设来解释这种现象，其中大多数假设真核生物进化除了关键特征（例如动态细胞骨架、基因调控的替代机制或亚细胞区室），这是复杂多细胞生物进化的必要先决条件。这些解释强调特定的生物学特征或行为在其所处的环境中具有明确的功能优势（即具备适应性），因此被自然选择所青睐。",
                    "children": [
                        {
                            "name": "真核生物起源",
                            "time": "16.5-12亿年前",
                            "description": "复杂的细胞出现，包括有细胞器的真核生物，最接近的可能源自古细菌。大部分有细胞器的可能从共生细菌衍生而来。",
                            "src": "./static-2/真核生物起源.jpg"
                        }
                    ],
                    "src": "./static-2/复杂细胞出现.jpg"
                },
                {
                    "name": "多细胞生物出现",
                    "time": "15亿年前",
                    "description": "多细胞生物已经独立进化了 50 多次，至少在 30 亿年前出现在蓝藻中。其中“复杂的多细胞性”，即所谓具有许多特殊细胞类型、寿命相对较长的大型生物体，只出现了5次大规模独立进化，全部发生在真核生物（动物、植物、真菌、褐藻和红藻）内，没有出现在原核生物中。学界提出了许多假设来解释这种现象，其中大多数假设真核生物进化除了关键特征（例如动态细胞骨架、基因调控的替代机制或亚细胞区室），这是复杂多细胞生物进化的必要先决条件。这些解释强调特定的生物学特征或行为在其所处的环境中具有明确的功能优势（即具备适应性），因此被自然选择所青睐。",
                    "children": [
                        {
                            "name": "真核藻类",
                            "time": "15-14亿年前",
                            "description": "多细胞生物出现，首先是生活在海洋中的真核藻类。",
                            "src": "./static-2/真核藻类.jpg"
                        }
                    ],
                    "src": "./static-2/多细胞生物出现.jpg"
                },
                {
                    "name": "有性生殖出现",
                    "time": "12亿年前",
                    "description": "由亲本产生的有性生殖细胞(配子)，经过两性生殖细胞(例如精子和卵细胞)的结合，成为受精卵，再由受精卵发育成为新的个体的生殖方式，叫做有性生殖。有性生殖是通过生殖细胞结合的生殖方式。通常生物的生活周期中包括二倍体时期与单倍体时期的交替。二倍体细胞借减数分裂产生单倍体细胞（雌雄配子或卵和精子）；单倍体细胞通过受精（核融合）形成新的二倍体细胞。这种有配子融合过程的有性生殖称为融合生殖。某些生物的配子可不经融合而单独发育为新个体，称单性生殖。",
                    "children": [
                        {
                            "name": "演化加速",
                            "time": "12亿年前",
                            "description": "有性生殖的出现引发更快的演化，大部分生命在海洋及湖中出现，一些蓝菌已经生活在湿润的泥土中。",
                            "src": "./static-2/演化加速.jpg"
                        }
                    ],
                    "src": "./static-2/有性生殖出现.jpg"
                },
                {
                    "name": "叠层岩达到高峰",
                    "time": "12-10亿年前",
                    "description": "叠层石对地球生命演化发展具有十分重要的作用，其中不得不提到叠层石建造的主要贡献者——蓝细菌。蓝细菌是一种自养的原核单细胞生物，能够通过光合作用吸收二氧化碳转换为能量并释放氧气，旧称蓝藻或蓝绿藻，按照三域六界的分类方法归属于蓝细菌门。蓝细菌被认为是最早出现的能够进行光合作用产氧的微生物，对地球氧气含量的上升有十分重要的作用。",
                    "children": [
                        {
                            "name": "沉积作用",
                            "time": "12-10亿年前",
                            "description": "叠层岩达到高峰，这是由微生物活动形成的特定类型的沉积岩。",
                            "src": "./static-2/沉积作用.jpg"
                        }
                    ],
                    "src": "./static-2/叠层岩达到高峰.jpg"
                },
                {
                    "name": "罗迪尼亚大陆形成",
                    "time": "11亿年前",
                    "description": "罗迪尼亚大陆(Rodinia，来自俄语родина，祖国)是古代地球曾经存在的超大陆。根据板块重构，罗迪尼亚大陆存在于新元古代(11.5亿到7亿年前)。相对于三亿年前的盘古大陆，对罗迪尼亚大陆的地球动力状态所知甚少。可以从古地磁所提供的线索得知个别板块在罗迪尼亚大陆时代的纬度，但当时所在的经度则要靠现已散布在世界各地的相似地质特征来推测。大约七亿年前成冰纪的时候，地球进入雪球地球状态，全球温度急速下降。埃迪卡拉纪和寒武纪的生物快速演进一般认为是因为罗迪尼亚大陆的分裂引发。",
                    "src": "./static-2/罗迪尼亚大陆形成.jpg"
                },
                {
                    "name": "大型具刺疑源类出现",
                    "time": "10-7.2亿年前",
                    "description": "距今约6.35亿年前，地球从全球冰封的“雪球地球”事件中解冻，开启了一个新的地质时代——埃迪卡拉纪。在埃迪卡拉纪，由于“雪球”事件而演化停滞的真核生物迅速复苏并辐射。最早出现的主要生物类型是具有机质壁、表面发育复杂装饰的大型带刺疑源类（Doushantuo-Pertatatatka acritarchs, DPAs）。了解大型带刺疑源类的空间和时间分布及其与埃迪卡拉纪其他生物类型和地质事件的关系，对探讨埃迪卡拉纪生物与环境的协同演化有着重要意义。 华南的埃迪卡拉系陡山沱组保存了连续完整的埃迪卡拉纪早–中期地质记录，产出大量的大型带刺疑源类化石，是全球埃迪卡拉纪古生物与地层学研究的热点。过去对陡山沱组大型带刺疑源类的研究主要集中于台内盆地环境下的宜昌三峡地区和台地边缘的贵州瓮安地区，已经发表的资料显示这些大型带刺疑源类在一次全球性碳同位素负漂移事件（EN3）之前消失，这一特征与世界其他地区一致，因而EN3所代表的古环境变化长期被认为是大型带刺疑源类灭绝的可能原因之一。然而，来自世界其他地区的一些最新研究暗示了不同的可能性。 中国科学院南京地质古生物研究所早期生命研究团队长期开展华南陡山沱组微体化石的古生物学和生物地层学研究。近年来，南京古生物所博士研究生欧阳晴及其导师周传明等在湖南张家界地区一条连续的斜坡相陡山沱组剖面中发现了大量的燧石结核。薄片观察显示燧石结核中保存了包括5属8种大型带刺疑源类在内的多种微体化石。这些化石的发现表明，大型带刺疑源类的生存空间可以延伸到局限盆地以外的广海海域。更有意义的是，两个大型带刺疑源类层位出现在该剖面的一次碳同位素负漂移之上。通过对比该剖面与邻近剖面的地层序列以及碳同位素变化特征，结果显示大型带刺疑源类的层位已经延续到EN3之上。如果这一推测成立，未来将有可能在更多剖面的EN3层位之上发现大型带刺疑源类化石，甚至在同一剖面发现大型带刺疑源类化石和埃迪卡拉型宏体化石的共存现象，从而改变人们对埃迪卡拉纪真核生物演化进程的认识。",
                    "children": [
                        {
                            "name": "氧气累积",
                            "time": "10-7.2亿年前",
                            "description": "氧气的累积使臭氧层可以形成，臭氧层可阻挡太阳的有害辐射，使生命可以在陆地上发展。",
                            "src": "./static-2/氧气累积.jpg"
                        }
                    ],
                    "src": "./static-2/大型具刺疑源类出现.jpg"
                },
                {
                    "name": "雪球地球事件",
                    "time": "8-5.5亿年前",
                    "description": "提出假说 :-----冰室效应说 : 最早提出“雪球地球”理论的美国加州理工学院研究小组发现，使早期地球变成雪球的罪魁祸首很可能只是一种细菌，它释放出的氧气破坏了可使地球保持温暖的关键气体——甲烷。科学家推测，在23亿年前，一种叫蓝菌或蓝绿藻的细菌突然发育出分解水及释放氧气的能力，大量的氧气使当时大气中丰富的温室气体甲烷很不稳定。在至少10万年的时间内，温室效应被破坏，地球没有了甲烷，全球温度下降到零下50摄氏度。地球进入冰河期后变得十分寒冷，赤道海洋被大约1.6千米厚的冰层覆盖，大量生物死亡，只有转入地下或在热温泉中的生物才能得以生存下来。-----泥泞地球说 : 对于雪球地球观点的最早争辩始于1989年，之后持反对观点的科学家对此进行了更加猛烈的攻击，其中最具代表性的就是加拿大多伦多大学的三位物理学家。2008年4月，他们设计了一种新原生代末期二氧化碳计算机模拟，新原生代末期是海洋氧气生成的重要时期。这三位物理学家指出，计算机模拟显示，持续的寒冷气温将使大气中的氧气散布到海洋底部，通过光合作用进而转化成为富含溶解有机碳的地质层，最终形成二氧化碳气体。这些二氧化碳气体将从海洋中释放回到大气层中，通过温室气体效应加热大气层空气，在地球冰冻冷却循环周期之前，诱导海洋冰层逐渐融化、冰河逐渐缩小。换句话讲，地球在8.5亿—5.5亿年前的成冰纪并不是一个冰冻的雪球，当时的地球很可能是气候温和、土壤泥泞，热带地区的海水处于非冰冻状态，海水可以与阳光进行充足的光合作用。这个时期并没有大量火山喷发的二氧化碳气体，也没有持续冰冻上亿年。-----阳光阻隔说 : 科学家认为“雪球地球”时期的火山喷发向大气层释放了大量硫颗粒，阻滞阳光照射大地，从而使地球温度下降。地质科学家麦克唐纳指出，这意味着调查这种地球历史的“自然实验”十分重要：“这会告诉我们远比电脑模型更多的东西。”-----反射学说 : J.L. Kirschvink认为，当时在中高纬度的反照率是很高的，形成大量冰川，然后海平面下降，导致了陆地面积增加，陆地增加进一步增加了地球的反照率；同时，热带地区大陆增加有利于硅酸岩风化，有利于大气中的CO2埋藏，加强了“冰室效应”。这两个因素的不断影响，导致了地球不断变冷，从而形成一个“雪球”。在形成“雪球”之后，因为地球的火山作用，不断释放出CO2等温室气体，经过长期积累，这些气体终于足够强大，产生了巨大的“温室效应”，地球温度升高，所以又融化了。",
                    "children": [
                        {
                            "name": "极端冰期",
                            "time": "7.2-6.35亿年前",
                            "description": "根据雪球地球假说，成冰纪的冰河时期非常严重，连海洋亦完全结冰，只有在热带的海水仍保持是液态。",
                            "src": "./static-2/极端冰期.jpg"
                        }
                    ],
                    "src": "./static-2/雪球地球假说.jpg"
                },
                {
                    "name": "多细胞动物出现",
                    "time": "6.65亿年前",
                    "description": "曾经被认为是最早的多细胞生物是12亿年前中元古代延展纪时期的一种红藻Bangiomorpha pubescens的化石。多细胞生物必须解决从一个生殖细胞来产生整个生物的问题，来完成繁殖的任务。发育生物学是研究这个过程的学科。一般认为在延展纪出现的单细胞生物有性生殖是多细胞生物出现的前提条件。多细胞生物中的细胞假如丧失其规则发展的控制其生长的功能会导致癌症。但是2010年的一组新发现的古老生物化石将地球上最早的多细胞生物的出现时间提前。由法国等多国科学家组成的研究小组在2010年7月1日出版的英国《自然》杂志上称，他们对来自加蓬的化石的最新研究发现，多细胞生物起源于21亿年前。研究团队由法国普瓦捷大学的阿伯德拉扎克·阿尔巴尼教授领导。据研究人员介绍，地球上最早的生命迹象出现于35亿年前，是现存生物中最简单的一群。然而，生命的多样化过程实际上发生于距今35亿年到6亿年前的元古代，在此期间出现了真核生物，它们与原核生物的最大不同是拥有细胞核，而且具有更复杂的组织和新陈代谢形式。不过，此前科学家很少发现中元古代(距今16亿年至10亿年前)之前多细胞生物存在的证据。研究团队于2008年在加蓬的弗朗斯维尔意外发现了250多个保存完好的生物化石，并对其中100多个进行了深入细致的研究。科学家对其周围沉积物进行测算，结果表明，这些化石已有21亿年的历史，是地球上已知最早出现的多细胞体。据了解这些最早的多细胞生命体化石呈扁圆盘状，直径约为5英寸(12.7厘米)，有扇贝状外缘和辐射状条纹——并不能归属于任何复杂单细胞生物或早期动物的范畴。 [1]　不过从任何一方面来看，这种古老生命体都标志着其跨越了一个重要的演化门槛，并且显示这一过渡是由于地球大气的显著变化诱发的。法国普瓦提埃大学(University of Poitiers)的古生物学家阿德拉扎克·阿尔巴尼(Abderrazak El Albani)说，“很明显，多细胞体的出现和氧气浓度的增加有关”。单细胞生物大约出现于34亿年前的“原始汤”(primordial soup)，主要以原核生物形式存在，原核生物是一种无细胞核的单细胞生物，包括细菌和蓝细菌。在距今约6亿年前的寒武纪，各种生物以爆炸性的速度涌现，这种现象被古生物学家称作“寒武纪生命大爆发”。单细胞生物出现之后又经过了14亿年才出现了最早的多细胞生命体——卷曲藻(Grypania)。卷曲藻可能是一个菌落，或者一种真核生物——其包裹在细胞膜内的细胞功能已经出现分化的生物体。无论卷曲藻属于何种类型，它是“寒武纪生命大爆发”之前已知仅有的几类复杂生命体的案例。 [1]　此次新发现的化石使卷曲藻不再显得那么孤独，这种新发现的物种还没有命名。它们几乎生活在同一年代。卷曲藻生活在今天美国北部地区，而这一新发现化石的物种生活在加蓬。这一发现增加了这样一种可能性，即多细胞生命体可能是一种趋势，而非是一种偶然，它同时还暗示了演化出复杂生命形式的原因，而不仅仅是何时演化出这样的生命形式。",
                    "children": [
                        {
                            "name": "动物演化",
                            "time": "6.65亿年前",
                            "description": "多细胞动物在海洋出现，有研究显示最早的动物生活在湖泊的环境中。",
                            "src": "./static-2/动物演化.jpg"
                        }
                    ],
                    "src": "./static-2/多细胞动物出现.jpg"
                },
                {
                    "name": "超级大陆形成",
                    "time": "6.35-5.41亿年前",
                    "description": "主要超大陆 : -----推测的 : 阿美西亚大陆：相对于终极盘古的另一派学说，这派认为太平洋将消失终极盘古大陆：二亿五千万到四亿年后，大西洋将消失澳洲-南极-欧亚非大陆：一亿三千万年后。南极大陆与澳洲-欧亚非大陆的南部碰撞澳洲-欧亚非大陆：六千万年后。澳洲大陆与东亚碰撞，将形成相当于喜马拉雅山脉的造山运动-----现存的 : 欧亚非大陆：五百万年前到今日美洲大陆：一千五百万年前到今日欧亚大陆：六千万年到到今日-----史前的 : 冈瓦那大陆：六亿到三千万年前劳亚大陆：三亿到六千万年前盘古大陆：三亿到一亿八千万年前欧美大陆：三亿年前潘诺西亚大陆：六亿到五亿四千万年前罗迪尼亚大陆：十一亿到七亿五千万年前哥伦比亚大陆：十八亿到十五亿年前妮娜大陆：十八亿年前凯诺兰大陆：二十七亿年前乌尔大陆：三十亿年前。科马提地层：三十四亿七千五百万年前瓦巴拉大陆：三十六亿年前伊尔干克拉通：四十四亿到四十三亿年前 [2]",
                    "children": [
                        {
                            "name": "潘诺西亚大陆",
                            "time": "6亿年前",
                            "description": "第二个超级大陆潘诺西亚形成于6亿年前并于5.4亿年前分裂。",
                            "src": "./static-2/潘诺西亚大陆.jpg"
                        }
                    ],
                    "src": "./static-2/超级大陆形成.jpg"
                },
                {
                    "name": "埃迪卡拉纪",
                    "time": "6.35-5.41亿年前",
                    "description": "埃迪卡拉纪(英语:Ediacaran)，又称艾迪卡拉纪、震旦纪，是元古宙最后的一段时期。一般指6.35-5.41亿年前。学者曾用这个名字指称不同阶段，直到2004年5月13日，国际地质科学联合会(英语:International Union of Geological Sciences，IUGS)明确定义其年代，这是这个组织120年来首次对其加时期定义。最古老的动物遗迹可追溯至十亿年前，但最早的动物化石出现于约六亿年前的埃迪卡拉纪。埃迪卡拉动物群因为发现于南澳大利亚的埃迪卡拉山而得名。1946年，一位澳洲地质学家(Reg Sprigg)在古代的沙岩板中留意到一曾在这里发现显生宙以前的化石。研究这些化石的科学家(Martin Glaessner)认为这是珊瑚、水母和蠕虫的先驱。以下几十年，南澳大利亚还找到很多的隐生宙化石，其他各大洲也找到一些。这些化石都叫作埃迪卡拉动物。一开始，人们认为埃迪卡拉动物是寒武纪的动物，但经过仔细的观察，埃迪卡拉化石比寒武纪还久远，应属于埃迪卡拉纪。",
                    "children": [
                        {
                            "name": "阿瓦隆大爆发",
                            "time": "5.75亿年前",
                            "description": "从形态学上，埃迪卡拉纪生物与此前的生命形式以及埃迪卡拉纪生物之间都存在着很大区别，以至于它们必须被划分成新的不同物种类别。其中的许多生物都很像植物的叶片，它们在阿瓦隆纪（Avalon period）的2500万年里突然出现",
                            "src": "./static-2/阿瓦隆大爆发.jpg"
                        },
                        {
                            "name": "狄更逊水母",
                            "time": "5.71-5.41亿年前",
                            "description": "狄更逊水母（Dickinsonia）是一种复杂的动物，形状类似餐盘、浴室垫或者扁平的硬币，生活在约为5.71到5.41亿年前。 该水母呈柔软的椭圆形，身体分为多个部分，有一个肋状的凸面层。它们的正面和背面区别明显，身长可达一米，但厚度只有几毫米 。这种生物的化石最初由澳大利亚地质学家 斯普里格（Reg Sprigg）发现于澳大利亚南部，后来在 乌克兰的波多利亚省、俄罗斯的白海地区和乌拉尔山 以及中国安徽寿县均有发现。狄更逊水母是埃迪卡拉生物群的一部分",
                            "src": "./static-2/狄更逊水母.jpg"
                        },
                        {
                            "name": "斯普里格蠕虫",
                            "time": "5.5亿年前",
                            "description": "头部呈新月形的蠕虫状动物。没有人知道它是直立在海底还是像蠕虫一样爬行。分布区域:澳大利亚、非洲、俄罗斯. 体长3-5厘米. 身体很长，后部不断变小呈锥状，像尾巴。宽的前端呈圆形，由窄小、呈月牙状弧形物构成。身体被一条与身体同长的中线分开，横切面为低矮、宽大的V形体节。化石考古表明这种生物可能是地球上最早的对称性生物。",
                            "src": "./static-2/斯普里格蠕虫.jpg"
                        },
                        {
                            "name": "埃迪卡拉纪末期灭绝",
                            "time": "5.41亿年前",
                            "description": "埃迪卡拉纪末期，发生了广泛的海洋缺氧事件，在此期间缺氧覆盖了超过 21% 的海底，这也是5.5 亿年来最严重的海洋缺氧事件。结合之前西伯利亚的发现，可以这样推测，在埃迪卡拉纪的末期，寒武纪的生命已经出现，并凭借自己的优势，占据了有利地位，夺走了埃迪卡拉生物的生态位。独立于其他环境和生态因素的海洋缺氧和氧化还原异质性的扩大可能进一步打击了本就弱势的埃迪卡拉生物群，同时刺激了动物的运动性。小型贝壳类族群等寒武纪两侧对称动物的“新成员”凭借优势，挺过了这次灾难，扩大了自己的生存空间，并在远古海洋中发展出了生命的第一个高峰-寒武纪大爆发。",
                            "src": "./static-2/埃迪卡拉纪末期灭绝.jpg"
                        },
                        {
                            "name": "生物群落更迭",
                            "time": "5.41亿年前",
                            "description": "5.41亿年前发生埃迪卡拉纪末期灭绝事件，复杂的多细胞动物埃迪卡拉生物群出现，主要是刺胞动物，其次是多孔动物等。",
                            "src": "./static-2/生物群落更迭.jpg"
                        }
                    ],
                    "src": "./static-2/埃迪卡拉纪.jpg"
                },

            ],
            "src": "./static-2/元古宙.jpg"
        },
        {
            "name": "显生宙",
            "time": "5.7亿年前",
            "description": "显生宙（英语：Phanerozoic），或称显生元、显生代，是地球地质历史上最晚的一个宙，上承元古宙。显生宙从5.41亿年前延续至今，下分为古生代、中生代和新生代三个代，共十个纪。显生宙是复杂多细胞生物（特别是有主动移动性的动物和创造了地表土壤圈的植物）大量出现并多样化的地质时期，特别是矿化组织的演化开始在地层中留下实体化石，使得后世人类研究史前生物变得有迹可循，以至于很长一段时间古生物学界曾一致认为生命史仅始于显生宙，因而得名。而早于显生宙的那些没有或者很难见到实体化石的时代统称为隐生宙（与“显生”对应）或“前寒武纪”时期（称呼源自显生宙最先出现演化辐射的第一个纪——寒武纪）。显生宙在英文里的称呼“Phanerozoic”是由源自古希腊语的词根phanerós（φανερός，意为“可看见的”）和zōḗ（ζωή，意为“生命”）进行造词组成，最早由美国地质学家乔治•查德维克（George Halcott Chadwick，1876~1953）在1930年提出[1][2]。当时因为化石记录和考古年代测定技术的限制，学术界普遍认为地球上的生命全部是在寒武纪大爆发中才开始“显现”，因而得名。这种认为生命史始于寒武纪的观念曾如此根深蒂固，以至于一些前寒武纪化石（主要是模铸化石和遗迹化石）也被武断判定为非化石或是寒武纪以后的生物。而随着放射性碳定年法和分子遗传学技术的进步和普及应用，现今大量源自元古宙埃迪卡拉纪阿瓦隆大爆发的前寒武纪生物群的化石已被正式鉴定，学界也达成普遍共识认为以扁盘动物和原始海绵为代表的复杂生命至少在拉伸纪就已经存在，而已知最古老的生命（形成后世层叠石的原核菌毯）则最晚在35亿年前的古太古代就已经在海底热泉附近的海床上形成，最早甚至可追溯到海洋刚形成后不久的始太古代。因此“显生宙”是个历史残留的称呼，仅局限于描述实体化石在地层中的大量出现。",
            "children": [
                {
                    "name": "寒武纪",
                    "time": "5.42-4.85亿年前",
                    "description": "寒武纪（Cambrian）是显生宙的开始，距今约5.42亿年前—4.85亿年。前一个纪是新元古代埃迪卡拉纪，后一个纪是奥陶纪。 [9]在传统理论上它可区分为三个时期：早寒武纪（5.41-5.13亿年前）、中寒武纪（5.13-5.00亿年前）、以及晚寒武纪（5.00-4.90亿年前）。2005年之后，国际地层委员会将下寒武统拆分，使得寒武系（即寒武纪时期形成的地层）由原来的三分变为四分，起始年代也有进一步修正。寒武纪动物以捕食型主导。",
                    "src": "./static-2/寒武纪.jpg"
                },
                {
                    "name": "寒武纪大爆发",
                    "time": "5.4-5.2亿年前",
                    "description": "突然出现大量无脊椎动物",
                    "src": "./static-2/寒武纪大爆发.jpg"
                },
                {
                    "name": "三叶虫",
                    "time": "5.5-2.5亿年前",
                    "classification": "节肢动物",
                    "description": "寒武纪时期种类最多的门，以三叶虫为主的节肢动物。寒武纪最成功的类群",
                    "src": "./static-2/三叶虫.jpg"
                },
                {
                    "name": "恐虾纲",
                    "time": "5.3-4.4亿年前",
                    "description": "恐虾纲（学名：Dinocaridida）是节肢动物门下的一个基干化石类群，旧时也被归为叶足动物门。此类动物均为海生，于寒武纪时最为繁盛，偶有奥陶纪的记录，还有一类名为申德汉斯虾（Schinderhannes）的成员生活在泥盆纪中早期。",
                    "src": "./static-2/恐虾纲.jpg"
                },
                {
                    "name": "海口鱼",
                    "time": "5.3亿年前",
                    "description": "海口鱼是一种原始的似鱼类生物，只有拇指般的大小，但却是生命进化史上的巨人，虽然没有坚实的外壳，但身体非常独特，拥有一根原始脊椎, 是如今所有脊椎动物的祖先。1997年8月，罗慧麟、胡世学、陈良忠在昆明海口地区首次发现首次发现了第一块脊椎动物化石——海口鱼。",
                    "src": "./static-2/海口鱼.jpg"
                },
                {
                    "name": "最早脊椎动物出现",
                    "time": "5.2亿年前",
                    "children": [
                        {
                            "name": "无颌鱼类",
                            "time": "5.2亿年前",
                            "description": "最早的脊椎动物，没有下腭且骨架由软骨构成。",
                            "src": "./static-2/无颌鱼类.jpg"
                        }
                    ],
                    "src": "./static-2/最早脊椎动物出现.jpg"
                },
                {
                    "name": "古杯动物灭绝",
                    "time": "5.0亿年前",
                    "children": [
                        {
                            "name": "古杯动物门",
                            "time": "5.0亿年前",
                            "description": "古杯动物是已知地球上最早的造礁动物，外形和化石形态多呈杯状。",
                            "src": "./static-2/古杯动物门.jpg"
                        }
                    ],
                    "src": "./static-2/古杯动物灭绝.jpg"
                },
                {
                    "name": "寒武纪-奥陶纪灭绝事件",
                    "time": "4.85亿年前",
                    "children": [
                        {
                            "name": "生物集群灭绝",
                            "time": "4.85亿年前",
                            "description": "约49%的属在这次事件中消失。",
                            "src": "./static-2/生物集群灭绝.jpg"
                        }
                    ],
                    "src": "./static-2/寒武纪-奥陶纪灭绝事件.jpg"
                },
                {
                    "name": "奥陶纪生命大辐射",
                    "time": "4.85亿年前",
                    "children": [
                        {
                            "name": "属级分类单元动物",
                            "time": "4.85亿年前",
                            "description": "动物增长了超过3倍，古生代演化动物群开始逐渐替代寒武纪演化动物群。",
                            "src": "./static-2/属级分类单元动物.jpg"
                        },
                        {
                            "name": "钙藻",
                            "time": "4.85亿年前",
                            "description": "导致浮游生物出现了爆发式的增长，浮游生态系统建立。",
                            "src": "./static-2/钙藻.jpg"
                        }
                    ],
                    "src": "./static-2/奥陶纪生命大辐射.jpg"
                },
                {
                    "name": "甲胄鱼类出现",
                    "time": "4.8亿年前",
                    "children": [
                        {
                            "name": "甲胄鱼类",
                            "time": "4.8亿年前",
                            "description": "有颌下门的祖先。",
                            "src": "./static-2/甲胄鱼类.jpg"
                        }
                    ],
                    "src": "./static-2/甲胄鱼类出现.jpg"
                },
                {
                    "name": "低等植物登陆",
                    "time": "4.8亿年前",
                    "description": "低等植物登陆",
                    "src": "./static-2/低等植物登陆.jpg"
                },
                {
                    "name": "角石",
                    "time": "4.7亿年前",
                    "description": "角石，古无脊椎动物， 鹦鹉螺亚纲 除杆石目外动物及 直角石亚纲 动物的总称。 角石具有坚硬的外壳，顾名思义，角石外壳的形状象牛或羊的角，一般是直的，也可以是弯的或盘卷的。 角石从开始发育到最终长成，壳的直径逐渐变大，肉体生长时不断前移并分泌钙质的壳，最后着生在壳体最前部，形成住室。 住室后面向壳的尖端一方则形成一系列的气室，气室对角石的升降和平衡具有重要的作用。",
                    "src": "./static-2/角石.jpg"
                },
                {
                    "name": "第一批原始植物出现",
                    "time": "4.72亿年前",
                    "children": [
                        {
                            "name": "绿藻演化",
                            "time": "4.72亿年前",
                            "description": "第一批原始植物从绿藻演化而来，开始向陆地迁移。",
                            "src": "./static-2/绿藻演化.jpg"
                        },
                        {
                            "name": "真菌",
                            "time": "4亿年前",
                            "description": "可能与植物共生，地衣是共生的例证。",
                            "src": "./static-2/真菌.jpg"
                        }
                    ],
                    "src": "./static-2/第一批原始植物出现.jpg"
                },
                {
                    "name": "螯肢动物崛起",
                    "time": "4.6亿年前",
                    "description": "以板足鲎为代表，螯肢动物崛起。",
                    "src": "./static-2/螯肢动物崛起.jpg"
                },
                {
                    "name": "星甲鱼等早期鱼类出现",
                    "time": "4.6亿年前",
                    "description": "脊椎动物的时代即将开始",
                    "src": "./static-2/星甲鱼等早期鱼类出现.jpg"
                },
                {
                    "name": "有颌下门出现",
                    "time": "4.6-4.5亿年前",
                    "children": [
                        {
                            "name": "有颌鱼类",
                            "time": "4亿年前",
                            "description": "标志着鱼类的进一步演化和发展。",
                            "src": "./static-2/有颌鱼类.jpg"
                        }
                    ],
                    "src": "./static-2/有颌下门出现.jpg"
                },
                {
                    "name": "奥陶纪生物大辐射",
                    "time": "4.4亿年前",
                    "description": "海洋生物变得枝繁叶茂",
                    "src": "./static-2/奥陶纪生物大辐射.jpg"
                },
                {
                    "name": "伽马射线暴",
                    "time": "4.4亿年前",
                    "description": "伽马射线暴是已知宇宙中最强的爆射现象，理论上是巨大恒星在燃料耗尽时塌缩爆炸或者两颗邻近的致密星体（黑洞或中子星）合并而产生的。伽马射线暴短至千分之一秒，长则数小时，会在短时间内释放出巨大能量。如果与太阳相比，它在几分钟内释放的能量相当于万亿年太阳光的总和，其发射的单个光子能量通常是典型太阳光的几十万倍。",
                    "src": "./static-2/伽马射线暴.jpg"
                },
                {
                    "name": "螯肢动物登陆",
                    "time": "4.4亿年前",
                    "description": "动物的首次登陆",
                    "src": "./static-2/螯肢动物登陆.jpg"
                },
                {
                    "name": "奥陶纪-志留纪灭绝事件",
                    "time": "4.45-4.43亿年前",
                    "description": "也称奥陶纪末大灭绝, 第一次物种大灭绝, 约85%的物种从地球上永远消失。",
                    "src": "./static-2/奥陶纪-志留纪灭绝事件.jpg"
                },
                {
                    "name": "志留纪",
                    "time": "4.44-4.19亿年前",
                    "description": "志留纪（Silurian Period）（笔石的时代，陆生植物和有颌类出现）是早古生代的最后一个纪，也是古生代第三个纪。约开始于4.4亿年前，结束于4.1亿年前。日本学者音译（日语志留读作siru，音近Silu），中文借用。由于志留系在波罗的海哥德兰岛上发育较好，因此曾一度被称为哥德兰系。志留纪可分早、中、晚三个世。志留系三分性质比较显著。一般说来，早志留世到处形成海侵，中志留世海侵达到顶峰，晚志留世各地有不同程度的海退和陆地上升，表现了一个巨大的海侵旋回。志留纪晚期，地壳运动强烈，古大西洋闭合，一些板块间发生碰撞，导致一些地槽褶皱升起，古地理面貌巨变，大陆面积显著扩大，生物界也发生了巨大的演变，这一切都标志着地壳历史发展到了转折时期。",
                    "src": "./static-2/志留纪.jpg"
                },

                {
                    "name": "维管植物出现",
                    "time": "4.3-4.28亿年前",
                    "children": [
                        {
                            "name": "裸蕨植物",
                            "time": "4.4-4亿年前",
                            "description": "标志着植物开始在陆地上占据主导地位。",
                            "src": "./static-2/裸蕨植物.jpg"
                        }
                    ],
                    "src": "./static-2/维管植物出现.jpg"
                },
                {
                    "name": "节肢动物外骨骼出现",
                    "time": "4.3-4.2亿年前",
                    "children": [
                        {
                            "name": "多足亚门",
                            "time": "4.3-4.2亿年前",
                            "description": "最早的有多足亚门（马陆及蜈蚣），及后有蝎子。",
                            "src": "./static-2/多足亚门.jpg"
                        }
                    ],
                    "src": "./static-2/节肢动物外骨骼出现.jpg"
                },
                {
                    "name": "肉鳍鱼类",
                    "time": "4.23亿年前",
                    "description": "肉鳍鱼最早出现在距今4.23亿年前的 志留纪 晚期，在 石炭纪 和 二叠纪 时期兴盛并成为 淡水生态系统 的 顶级物种，但在 二叠纪末大灭绝 中受到重创，大部分于距今6500万年前的 晚白垩纪 绝种。",
                    "src": "./static-2/肉鳍鱼类.jpg"
                },
                {
                    "name": "菊石出现",
                    "time": "4.23亿年前",
                    "description": "菊石，是软体动物门 [5]头足纲 [6]菊石目海洋动物， [7]有600多种，从四亿年前的泥盆纪早期的鹦鹉螺目进化而来。 [8]其壳体、壳形变化多样，小至几毫米，大至2米以上；大多沿平面旋卷，少数呈直形、弓形或塔形；壳饰从表面光滑至具有瘤、肋、刺、沟、棱、脊等各种形式； [9]因其表面通常有类似菊花的线纹，故名。 [7]菊石始见于早泥盆世，中生代最为繁盛， [9]广泛分布于世界各地的三叠纪海洋中，白垩纪末全部灭绝。 [10]菊石幼年期大多营漂浮或游泳生活，成年后有的在浅海底栖，有的在深水大陆架区游泳生活； [9]游速不快、运动连贯很差。 [11]菊石以一些浮游生物为食，如小的甲壳类幼虫。 [12]菊石会在水中产出成千上万枚小卵，生长速度慢。 [13]菊石壳体、壳形、壳饰及缝合线类型，是鉴定菊石类的重要依据。 [9]菊石的演化非常快，在浅海繁盛了3亿多年，所以菊石不但深受古生物学家的欢迎，而且被地质学家当作测定岩石年代的“标准”化石。",
                    "src": "./static-2/菊石出现.jpg"
                },
                {
                    "name": "脊椎动物崛起",
                    "time": "4.2亿年前",
                    "description": "以盾皮鱼类为首的鱼类凭借着下颌, 髓鞘还有最简单粗暴的体型等因素打败了螯肢动物, 从此登上王座, 生生不息",
                    "src": "./static-2/脊椎动物崛起.jpg"
                },
                {
                    "name": "邓氏鱼",
                    "time": "4.15-3.6亿年前",
                    "description": "盾皮鱼类中的佼佼者---邓氏鱼是节甲鱼目恐鱼科的一属，又名胴壳鱼。 是已知最大的盾皮鱼类，体长可达11米。 身型是类似于鲨鱼的纺锤形；头部与颈部覆盖着厚重且坚硬的甲壳；背部皮肤颜色深暗；腹部呈银色。 邓氏鱼是生活在约3.6亿至4.15亿年前的泥盆纪古生物，栖息于较浅海域。 能捕食当时海洋中任何一种生物，很可能是地球上第一个百兽之王，比陆地上第一只恐龙的诞生还要早1亿多年。",
                    "src": "./static-2/邓氏鱼.jpg"
                },
                {
                    "name": "野火现象出现",
                    "time": "4.05亿年前",
                    "children": [
                        {
                            "name": "野火",
                            "time": "4.05亿年前",
                            "description": "标志着地球大气中氧气浓度的增加，足以支持野火的发生。",
                            "src": "./static-2/野火.jpg"
                        }
                    ],
                    "src": "./static-2/野火现象出现.jpg"
                },
                {
                    "name": "泥盆纪",
                    "time": "4.05-3.5亿年前",
                    "description": "泥盆纪（Devonian Period），鱼类时代, 是地质时代古生代中的第四个纪，泥盆纪属于显生宙古生代，开始于同位素年龄416±2.8Ma，结束于359.2±2.5Ma。泥盆纪晚期，两栖动物出现。2022年9月，澳大利亚研究人员在4.192亿年前至3.589亿年前的泥盆纪一条古老的有颌鱼化石身上发现了一颗有3.8亿年历史的心脏——这是迄今为止发现的最古老的心脏。 ",
                    "src": "./static-2/泥盆纪.jpg"
                },
                {
                    "name": "首类无翅膀昆虫出现",
                    "time": "4亿年前",
                    "children": [
                        {
                            "name": "无翅膀昆虫",
                            "time": "4亿年前",
                            "description": "包括蠹鱼、跳虫及缨尾虫。",
                            "src": "./static-2/无翅膀昆虫.jpg"
                        }
                    ],
                    "src": "./static-2/首类无翅膀昆虫出现.jpg"
                },
                {
                    "name": "木本植物演化",
                    "time": "3.87亿年前",
                    "children": [
                        {
                            "name": "木质素和根系",
                            "time": "3.87亿年前",
                            "description": "植物演化出木本植物，具有木质素和发达的根系。",
                            "src": "./static-2/木质素和根系.jpg"
                        }
                    ],
                    "src": "./static-2/木本植物演化.jpg"
                },
                {
                    "name": "软骨鱼开始崛起",
                    "time": "3.82亿年前",
                    "description": "西莫利鲨目等软骨鱼类崛起, 王朝拉开序幕",
                    "src": "./static-2/软骨鱼开始崛起.jpg"
                },
                {
                    "name": "种子植物出现",
                    "time": "3.76亿年前",
                    "children": [
                        {
                            "name": "种子蕨门",
                            "time": "3.76亿年前",
                            "description": "最原始的种子植物，叶片类似真蕨类，种子生长在叶片上。",
                            "src": "./static-2/种子蕨门.jpg"
                        }
                    ],
                    "src": "./static-2/种子植物出现.jpg"
                },
                {
                    "name": "泥盆纪后期灭绝事件",
                    "time": "3.76-3.59亿年前",
                    "children": [
                        {
                            "name": "Kellwasser灭绝事件",
                            "time": "3.76-3.59亿年前",
                            "description": "严重影响了海洋生态系统。",
                            "src": "./static-2/Kellwasser灭绝事件.jpg"
                        }
                    ],
                    "src": "./static-2/泥盆纪后期灭绝事件.jpg"
                },
                {
                    "name": "小行星撞击",
                    "time": "3.75亿年前",
                    "description": "地狱序章",
                    "src": "./static-2/小行星撞击.jpg"
                },
                {
                    "name": "喷发",
                    "time": "3.75亿年前",
                    "description": "小行星撞击导致海底火山和地幔柱喷发",
                    "src": "./static-2/喷发.jpg"
                },
                {
                    "name": "提塔利克鱼出现",
                    "time": "3.75亿年前",
                    "description": "第一只会四足爬行的脊椎动物---提塔利克鱼被认为是鱼类及两栖类之间的物种。与过去许多更类似鱼类的化石不同，它的“鳍”拥有原始的腕骨及单纯的趾头，表示它们可以承受重量。仔细观察这些接合处显示提塔利克鱼虽然很可能无法使用它们来行走，但是它们可能可以用来支撑身体，就像伏地挺身一样。前鳍的骨骼显示出它们可能拥有许多肌肉组织，这表示它们拥有发达的肌肉，而且有能力像手腕一样弯曲。这些类似手腕的特征可以帮助提塔利克鱼在快速移动时稳定身体的底部。位于头顶上方的气孔也是值得注意的特征，这显示它们拥有功能跟腮一样好的肺脏。提塔利克鱼可以在浅海地区使用这个构造，因为这里温度较高，导致氧气含量较低。这种比较进化的构造也促进肋骨朝向更强壮的方向来演化，这是一个陆生生物的关键构造。更强壮的肋骨可以让提塔利克鱼的身体在任何时间冒险离开水域。提塔利克鱼也趋乏许多鱼类拥有的特征－位于腮附近的骨盘限制头部的转动，这也让它们成为最早拥有颈部的鱼类。这也让它们在狩猎时拥有更多的自由，不论是在陆地上或是浅水中。",
                    "src": "./static-2/提塔利克鱼出现.jpg"
                },
                {
                    "name": "四足总纲出现",
                    "time": "3.75-3.65亿年前",
                    "children": [
                        {
                            "name": "肉鳍鱼类演化",
                            "time": "3.75-3.65亿年前",
                            "description": "一些淡水的肉鳍鱼类发展了支撑结构并成为四足总纲。",
                            "src": "./static-2/肉鳍鱼类.jpg"
                        }
                    ],
                    "src": "./static-2/四足总纲出现.jpg"
                },
                {
                    "name": "泥盆纪末大灭绝",
                    "time": "3.74-3.5亿年前",
                    "description": "泥盆纪后期灭绝-第二次物种大灭绝（又称晚泥盆纪灭绝事件或泥盆纪晚期灭绝事件、泥盆纪大灭绝），是地球生物史上五次主要的大规模物种灭绝事件之中的第四大物种灭绝事件，发生于古生代泥盆纪晚期。本次灭绝事件又可被细分为许多个别的小事件，而其中发生在3.74亿年前的凯尔瓦塞事件是本次灭绝事件中最严重的，并标志着泥盆纪最后一个时期法门阶动物群阶的开始，即弗拉斯阶-法门阶的边界。 [1]另外第二大的罕根堡事件则终结了泥盆纪时期。总体而言，约19％的科和50％的属在泥盆纪后期灭绝事件中消失。",
                    "src": "./static-2/泥盆纪末大灭绝.jpg"
                },
                {
                    "name": "罕根堡事件",
                    "time": "3.72亿年前",
                    "description": "植物的蓬勃发展导致陆地氧气过剩, 严重破坏了氮磷循环还导致大规模赤潮现象, 造成海洋大缺氧",
                    "src": "./static-2/罕根堡事件.jpg"
                },
                {
                    "name": "脊椎动物登陆",
                    "time": "3.7亿年前",
                    "description": "提塔利克鱼等肉鳍鱼类开始了登陆的壮举",
                    "src": "./static-2/脊椎动物登陆.jpg"
                },
                {
                    "name": "含肺鱼",
                    "time": "3.6亿年前",
                    "description": "肉鳍鱼战力巅峰---含肺鱼为大型鱼类，体长约2.5—3.7米（8.2—12.1英尺）[2][7]。头颅上覆盖着一层厚重的皮骨，口内具有牙齿且位于前上颌骨上的尖牙长度可达 5 cm（2英寸）[2][8]。含肺鱼体表由圆鳞覆盖[8][7]。它们也具有巨大的感觉管来帮助感测周遭猎物的活动，这可能是因为它们所居住的淡水环境水质污浊，无法依赖视力[7]。",
                    "src": "./static-2/含肺鱼.jpg"
                },
                {
                    "name": "鱼石螈出现",
                    "time": "3.6亿年前",
                    "description": "第一只真正意义上的两栖动物----鱼石螈（学名Ichthyostega）是一属早期的四足总纲，生存于3亿6千7百万至3亿6千2百5十万年前的上泥盆纪，是鱼类及两栖类的中间生物，从 尾部 等体型看类似现代的鲶鱼长了脚。 鱼石螈有脚，但却可能不是用作行走，而是用来穿越 沼泽。 有时它被认为是属于两栖类，但却并不正确。 最早的两栖类要到石炭纪才出现。 化石见于格陵兰东部的上泥盆统。 是已知最早的两生类之一，保留许多像鱼的特征徵。",
                    "src": "./static-2/鱼石螈出现.jpg"
                },
                {
                    "name": "Hangenberg灭绝事件",
                    "time": "3.59亿年前",
                    "children": [
                        {
                            "name": "盾皮鱼类灭绝",
                            "time": "3.59亿年前",
                            "description": "严重影响了陆地和淡水生态系统。",
                            "src": "./static-2/盾皮鱼类灭绝.jpg"
                        }
                    ],
                    "src": "./static-2/Hangenberg灭绝事件.jpg"
                },
                {
                    "name": "软骨鱼类黄金时期",
                    "time": "3.59-2.51亿年前",
                    "children": [
                        {
                            "name": "软骨鱼类",
                            "time": "3.59-2.51亿年前",
                            "description": "软骨鱼类在这一时期达到鼎盛。",
                            "src": "./static-2/软骨鱼类.jpg"
                        }
                    ],
                    "src": "./static-2/软骨鱼类黄金时期.jpg"
                },
                {
                    "name": "昆虫崛起",
                    "time": "3.55亿年前",
                    "description": "高浓度的氧气使昆虫体型一再变大。",
                    "src": "./static-2/昆虫崛起.jpg"
                },
                {
                    "name": "石炭纪",
                    "time": "3.55-2.95亿年前",
                    "description": "巨虫时代---石炭纪（Carboniferous period）是古生代的第5个纪，开始于距今3.5亿年，延续了约6500万年。它可以区分为两个时期:始石炭纪（又叫密西西比纪，3亿2000-3亿5000万年前）、和后石炭纪（又叫宾夕法尼亚纪，2亿8600-3亿2000万年前）。由于这一时期形成的地层中含有丰富的煤炭，因而得名“石炭纪”。 [3]石炭纪时陆地面积不断增加，陆生生物空前发展。当时气候温暖、湿润，沼泽遍布。大陆上出现了大规模的森林，给煤的形成创造了有利条件。",
                    "src": "./static-2/石炭纪.jpg"
                },
                {
                    "name": "卡罗冰河时期",
                    "time": "3.5-2.5亿年前",
                    "children": [
                        {
                            "name": "冰川作用",
                            "time": "3.5-2.5亿年前",
                            "description": "大规模的冰川作用，大冰盖分布于古南纬60°以内的今南非、阿根廷等地。",
                            "src": "./static-2/冰川作用.jpg"
                        },
                        {
                            "name": "希伯特鲎",
                            "time": "3.5-2.5亿年前",
                            "description": "板足鲎之末裔",
                            "src": "./static-2/希伯特鲎.jpg"
                        },
                        {
                            "name": "巨脉蜻蜓",
                            "time": "3.5-2.5亿年前",
                            "description": "生命第一次征服了天空, 最大的昆虫，翅膀展开长达75厘米",
                            "src": "./static-2/巨脉蜻蜓.jpg"
                        },
                    ],
                    "src": "./static-2/卡罗冰河时期.jpg"
                },
                {
                    "name": "离片锥目、爬行形类出现",
                    "time": "3.4-3.3亿年前",
                    "children": [
                        {
                            "name": "离片锥目和爬行形类",
                            "time": "3.4-3.3亿年前",
                            "description": "标志着陆地脊椎动物的进一步演化。",
                            "src": "./static-2/离片锥目和爬行形类.jpg"
                        }
                    ],
                    "src": "./static-2/离片锥目、爬行形类出现.jpg"
                },
                {
                    "name": "披铠节胸虫",
                    "time": "3.4-2.8亿年前",
                    "description": "可达2.7米左右的史前蜈蚣",
                    "src": "./static-2/披铠节胸虫.jpg"
                },
                {
                    "name": "昆虫能够飞行",
                    "time": "3.25亿年前",
                    "children": [
                        {
                            "name": "飞行昆虫",
                            "time": "3.25亿年前",
                            "description": "出现了多个目，如古网翅目、疏翅目、透翅目及原直翅目。",
                            "src": "./static-2/飞行昆虫.jpg"
                        }
                    ],
                    "src": "./static-2/昆虫能够飞行.jpg"
                },
                {
                    "name": "羊膜动物",
                    "time": "3.2亿年前",
                    "description": "爬行形类的一支演化出羊膜卵，产生了能在地上繁殖的羊膜动物。",
                    "src": "./static-2/羊膜动物.jpg"
                },
                {
                    "name": "羊膜卵出现",
                    "time": "3.1亿年前",
                    "src": "./static-2/羊膜卵出现.jpg"
                },
                {
                    "name": "石炭纪雨林崩溃事件",
                    "time": "3.06-3.00亿年前",
                    "children": [
                        {
                            "name": "雨林崩溃",
                            "time": "3.06-3.00亿年前",
                            "description": "石炭纪末小灭绝事件 - 地球气候开始动荡，干湿季节变得鲜明，冰川导致雨林迅速萎缩分隔成孤立的小块。",
                            "src": "./static-2/雨林崩溃.jpg"
                        }
                    ],
                    "src": "./static-2/石炭纪雨林崩溃事件.jpg"
                },

                {
                    "name": "盘古大陆形成",
                    "time": "3亿年前",
                    "children": [
                        {
                            "name": "盘古大陆",
                            "time": "3亿年前",
                            "description": "地球上的大洲最近的闭合，维持了1亿年左右。",
                            "src": "./static-2/盘古大陆.jpg"
                        }
                    ],
                    "src": "./static-2/盘古大陆形成.jpg"
                },
                {
                    "name": "合弓纲占据陆地生态系统",
                    "time": "3-2.51亿年前",
                    "children": [
                        {
                            "name": "合弓纲",
                            "time": "3-2.51亿年前",
                            "description": "羊膜动物的一支合弓纲占据了陆地生态系统的主导。",
                            "src": "./static-2/合弓纲.jpg"
                        }
                    ],
                    "src": "./static-2/合弓纲占据陆地生态系统.jpg"
                },
                {
                    "name": "石松类衰落，种子蕨和裸子植物兴起",
                    "time": "2.99亿年前",
                    "children": [
                        {
                            "name": "植物群落更替",
                            "time": "2.99亿年前",
                            "description": "石炭纪雨林崩溃事件导致石松类衰落，种子蕨和裸子植物兴起。",
                            "src": "./static-2/植物群落更替.jpg"
                        }
                    ],
                    "src": "./static-2/石松类衰落，种子蕨和裸子植物兴起.jpg"
                },
                {
                    "name": "笠头螈",
                    "time": "2.99-2.51亿年前",
                    "description": "回旋镖似的脑袋可能是为了增加防御力 - 笠头螈（Diplocaulus）是生活在二叠纪中一种形状古怪的两栖动物。它的身体细扁，长约60厘米。头部象三角箭头向左右枝出，比身体还要宽，因此形状十分奇怪。它双眼在身体上侧，口在下面。它有长尾便于游水。笠头螈比引螈或者双椎螈更善于游泳。它四肢软弱，各有五趾，经常在泥岸上瞌睡。",
                    "src": "./static-2/笠头螈.jpg"
                },
                {
                    "name": "二叠纪",
                    "time": "2.9-2.5亿年前",
                    "description": "最后的古生代 - 使合弓纲脱离了蜥蜴的样貌，标志着哺乳动物的早期演化。",
                    "src": "./static-2/二叠纪.jpg"
                },
                {
                    "name": "旋齿鲨",
                    "time": "2.9-2.5亿年前",
                    "description": "鲨鱼演化史上最著名的妖孽 - 旋齿鲨（Helicoprion），Helico源自希腊语“螺旋状”，Prion则源自“锯”，组合起来意即“螺旋锯”。这用来指它的牙齿，这些牙齿从大到小，内卷成环状螺旋形齿，犹如铣刀般，极富切削感，看上去令人不寒而栗。而问题也就出在这些牙齿上，打自发现那年起，旋齿到底于鲨鱼的哪个位置的争论便持续迄今。因为无论是现生的鲨鱼，还是其它脊椎动物，都没有任何一个种类发现长有这种旋齿。在形形色色的古生物世界里，有一种充满神秘色彩的动物，它的名字叫旋齿鲨。多年来，人们所能见到的只是它奇妙的、螺旋排列的牙齿（古生物学称之为“螺旋齿”），真正完整的骨架当前还没有发现，因此，它的“神秘”引起了很多古生物专家及古生物爱好者的关注",
                    "src": "./static-2/旋齿鲨.jpg"
                },
                {
                    "name": "异齿龙",
                    "time": "2.8-2.65亿年前",
                    "description": "盘龙类的昙花一现 - 异齿龙 [1]又名异齿兽、长棘龙，它是类似哺乳动物的盘龙类肉食动物，生活在二叠纪。异齿龙与哺乳动物关系较近，与恐龙、蜥蜴、鸟类等的关系较远，它的化石在北美与欧洲等。异齿龙是二叠纪时期的肉食性古生物，一般大众将异齿龙联想是恐龙的一份子，但异齿龙其实并不是恐龙。更确切地说，它们被归类为盘龙目。尽管它的外形像蜥蜴，但异齿龙与哺乳类的关系较接近，离真爬行动物（如恐龙、蜥蜴、鸟等）较远。",
                    "src": "./static-2/异齿龙.jpg"
                },
                {
                    "name": "兽孔目出现",
                    "time": "2.75亿年前",
                    "children": [
                        {
                            "name": "兽孔目",
                            "time": "2.75亿年前",
                            "description": "一部分异齿龙类演化出了犬齿等器官, 合弓纲脱离了蜥蜴的样貌，标志着哺乳动物的早期演化。",
                            "src": "./static-2/兽孔目.jpg"
                        }
                    ],
                    "src": "./static-2/兽孔目出现.jpg"
                },
                {
                    "name": "奥尔森灭绝事件",
                    "time": "2.75亿年前",
                    "description": "未知原因的小灭绝事件，盘龙类的统治戛然而止。",
                    "src": "./static-2/奥尔森灭绝事件.jpg"
                },
                {
                    "name": "主龙形下纲动物出现",
                    "time": "2.65亿年前",
                    "children": [
                        {
                            "name": "主龙形下纲",
                            "time": "2.65亿年前",
                            "description": "最初的主龙形下纲动物出现，是恐龙和鸟类的早期祖先。",
                            "src": "./static-2/主龙形下纲.jpg"
                        }
                    ],
                    "src": "./static-2/主龙形下纲动物出现.jpg"
                },
                {
                    "name": "峨嵋山暗色岩事件",
                    "time": "2.6亿年前",
                    "description": "今峨眉山一带的超级火山突然喷发, 整个四川地区变成一片火海",
                    "children": [
                        {
                            "name": "恐头兽亚目灭绝",
                            "time": "2.6亿年前",
                            "description": "导致繁盛一时的恐头兽亚目灭绝，其他兽孔目和副爬行动物占据了陆地生态位。",
                            "src": "./static-2/恐头兽亚目灭绝.jpg"
                        }
                    ],
                    "src": "./static-2/峨嵋山暗色岩事件.jpg"
                },
                {
                    "name": "丽齿兽",
                    "time": "2.55-2.51亿年前",
                    "description": "最早掌握剑齿的用法 - 丽齿兽，又名丽兽。拉丁文名为Gorgonopsid，起源于二叠纪，2.52亿年前。丽齿兽食肉，外形像狼，是首次长有犬齿的动物，这是生物进化史上的一大重要突破。之后许多哺乳动物也长有相似的獠牙，它们能够轻易的撕开皮肉， 就如同一把炙热的金属刀滑过黄油一般，它有一个称号：“二叠纪的野狼”",
                    "src": "./static-2/丽齿兽.jpg"
                },
                {
                    "name": "主龙类",
                    "time": "2.52亿年前",
                    "description": "主龙类开始演化出许多分支，包括恐龙和鸟类的直接祖先。",
                    "src": "./static-2/主龙类.jpg"
                },
                {
                    "name": "盾甲龙",
                    "time": "2.52-2.48亿年前",
                    "description": "龙族早期大型食草动物",
                    "src": "./static-2/盾甲龙.jpg"
                },
                {
                    "name": "西伯利亚暗色岩事件",
                    "time": "2.51亿年前",
                    "description": "今西伯利亚地区的超级火山突然喷发, 规模比峨眉山暗色岩时间更为庞大",
                    "src": "./static-2/西伯利亚暗色岩事件.jpg"
                },
                {
                    "name": "水龙兽",
                    "time": "2.5-2.4亿年前",
                    "description": "曾经最庞大的兽群 - 水龙兽，已绝灭的类哺乳爬行动物。头大、颈短、体桶状。体形有点类似今日的河马。其特征是面部显著向下折曲，因此头骨很高。鼻位置很靠上，一直到眼孔之下，身体结构已具有若干哺乳动物的进步性状，但头部尚原始，生活于湖泊池沼边缘，以植物为生存活在二叠纪晚期到三叠纪早期,约2亿5000万年前，是一种极其古老的生物。",
                    "src": "./static-2/水龙兽.jpg"
                },
                {
                    "name": "二叠纪-三叠纪灭绝事件",
                    "time": "2.51-2.48亿年前",
                    "description": "第三次物种大灭绝, 又叫P-T灭绝事件, 二叠纪末大灭绝, 大死亡事件, 是生命诞生以来最惨烈的大灭绝事件, 约有95%的物种在这场浩劫中绝迹, 包括寒武纪就诞生的三叶虫纲",
                    "src": "./static-2/二叠纪-三叠纪灭绝事件.jpg"
                }
            ],
            "src": "./static-2/显生宙.jpg"
        },
        {
            "name": "中生代",
            "time": "2.52-0.67亿年前",
            "description": "中生代（英语：Mesozoic）是地球地质历史中显生宙的三个地质时代之一，介于古生代与新生代之间，分为三叠纪、侏罗纪和白垩纪三个纪。由于这段时期是蜥形纲脊椎动物彻底击败合弓纲成为食物链上层生态位的优势陆生动物、并压倒各种两栖类、鱼类和头足类成为优势水生动物的时期，因此又称为爬行动物时代；而因为三叠纪末期灭绝事件后恐龙迅速崛起成为之后1.5亿年之间的优势陆地动物，侏罗纪和白垩纪也可称为恐龙时代。中生代的名称最早是由意大利地质学家乔瓦尼·阿尔杜伊诺提出，最初称作“第二纪（Secondary）”，以对应古生代的“第一纪”和新生代的“第三纪”与“第四纪”[1]。古生代的英文名称源于希腊文的拉丁化前缀meso-（μεσο-，意为“中间”）和词根zōon（ζῷον，意为“动物、生灵”）[2][3][4]。中生代也是板块、气候、生物演化改变极大的时代。在中生代开始时，各大陆连接为一块超大陆－盘古大陆。盘古大陆后来分裂成南北两片，北部大陆进一步分为北美和欧亚大陆，南部大陆分裂为南美、非洲、印度与马达加斯加、澳洲和南极洲，只有澳洲没有和南极洲完全分裂。中生代的气候非常温暖，对动物的演化产生影响。",
            "children": [
                {
                    "name": "主龙类及裸子植物分化",
                    "time": "2.51-2亿年前",
                    "description": "主龙类（Archosauria）又名初龙类、祖龙类、古龙类，在希腊文意为“具优势的蜥蜴”，是双孔亚纲爬行动物的一个主要演化支，包含现存的鳄鱼与鸟类，而已经灭亡的非鸟恐龙、翼龙目也属于此。关于主龙类何时开始出现，有许多争论。有一派将二叠纪的俄罗斯主龙（Archosaurus rossicus）与原龙（Protorosaurus speneri）视为真正的主龙类，这让主龙类首次出现于晚二叠纪。而另外一派，将俄罗斯主龙与原龙分类于主龙形类（并非主龙类但关系较近），使得主龙类在三叠纪奥伦尼克期从主龙形类演化而来。主龙类主要分为两个组成部分：鸟跖类和伪鳄类，伪鳄类包括现在还活着的鳄鱼以及其他例如劳氏鳄、法索拉鳄、海鳄等已经灭绝的物种；鸟跖类包括翼龙、非鸟恐龙和鸟类。",
                    "children": [
                        {
                            "name": "伪鳄类",
                            "time": "2.51-2亿年前",
                            "description": "伪鳄类（学名：Pseudosuchia）是脊椎亚门蜥形纲主龙形下纲中的两个主要演化支之一。与同为主龙类的鸟颈类相比，伪鳄类的头骨通常十分厚重，口鼻部长而狭窄，颈部短而强壮，身体通常由两排或更多排的鳞甲保护，四肢的结构介于爬行动物典型的向两侧延伸和恐龙、鸟类或哺乳类的体下直立四肢之间（虽然恐龙和鸟类与哺乳类的姿态不同）。伪鳄类主龙的体形大多数相当大，可达3米甚至更长。在2011年之前，伪鳄类经常被非正式称为“镶嵌踝类主龙”，2011年的一项研究[1]提出镶嵌踝是由伪鳄类保留的原始特征。所以镶嵌踝类现在指的是更广泛的演化支，包括植龙目、伪鳄类和鸟跖类(鸟颈类主龙)。尽管Pseudosuchia的意思是“假鳄鱼”，但这是不恰当的名称，因为真正的鳄鱼就是属于伪鳄类。------演化 : 伪鳄类主龙似乎在三叠纪早期（奥伦尼克阶晚期）出现，到三叠纪中期（拉丁阶）成为陆地肉食性优势动物。它们的全盛期是三叠纪晚期，在这时代它们分为直立四肢的劳氏鳄科、植食性带有装甲的坚蜥目、大型狩猎动物波波龙科、小型敏捷的喙头鳄亚目、还有其他族群。在三叠纪-侏罗纪灭绝事件中，所有大型的伪鳄类主龙绝种，而恐龙继承它们的陆地优势动物地位。只有小型的喙头鳄亚目与原鳄亚目存活下来。随者中生代前进，原鳄类演化得更像典型的鳄鱼，当恐龙称霸于陆地的时候，鳄形超目繁盛于河流、沼泽、海洋，比现代鳄鱼更具多样性。当白垩纪末灭绝事件发生时，情况被翻转了，大部分鸟颈类主龙灭亡，只有鸟类继续存活，虽然鳄形超目在白垩纪末灭绝事件的损失并不重，但在新生代越来越冷的气候趋势下，鳄形超目的许多演化支因此灭绝。现在仅现存二十多种的鳄目是伪鳄类主龙中仍然存活的唯一一支",
                            "src": "./static-2/伪鳄类.jpg"
                        },
                        {
                            "name": "恐龙类",
                            "time": "2.51-2亿年前",
                            "description": "外形特征 : -----骨骼特征 : 对于体形庞大的植食性恐龙来说，力量是最重要的要求。它们的腿骨庞大而结实，足以负担巨大的身体。同时，它们进化出了一种巧妙的构造，减轻了其他骨骼的重量，而不会造成力量的衰减。 [5]那些体形更小的、行动迅速的恐龙则进化出了一种在现代动物身上也可以看到的特点：薄壁长骨。这种骨骼如同一根空心的管子，薄薄的外壁由重型骨骼构成，而骨骼中央则是轻得多的骨髓。行动迅速的植食性恐龙，如橡树龙,就有这种薄壁长骨。我们可以假定这种骨骼是为了减轻重量，从而在逃离天敌时获得更快的速度。 [5]-----体型特征 : 恐龙整体而言的体型很大。以恐龙作为标准来看，蜥脚下目是其中的巨无霸。在漫长的恐龙时代，即使是体型最小的蜥脚类恐龙也要比它们栖息地内的其他动物要大，而最大的蜥脚类则比任何出现在地表的动物都要大出几个等级。 [6]大部分的恐龙要比大型蜥脚类恐龙还小得多。现有的证据表明，恐龙的平均大小在三叠纪、早侏罗纪、晚侏罗纪和白垩纪都不断变化。大部分兽脚类恐龙的体重在100到1000公斤之间，而全新世的掠食性肉食动物则多半在10到100公斤之间。恐龙的体重估计值，大多介于1到10吨之间。伦敦国立自然历史博物馆的一个研究指出恐龙的体重平均值约在100公斤左右，而新生代的哺乳类体重平均值多在2到5公斤之间。 [6]从现有的状况较好的骨架来看，最高和最重的恐龙是长颈巨龙（Giraffatitan brancai，原名布氏腕龙）。长颈巨龙的化石在1907年至1912年间发现于坦桑尼亚。从多具大小相近的个体所组合而成的骨架模型，现正展示于柏林洪堡博物馆，该模型高12米，长22.5米，预期活体的重量在30到60吨之间。最长的恐龙是27米长的梁龙，是在1907年发现于美国怀俄明州，现展示于宾州匹兹堡的卡内基自然历史博物馆。 [6]-----主要区别 : 恐龙与其它爬行动物的最大区别在于它们的站立姿态和行进方式，恐龙具有全然直立的姿态，其四肢构建在其躯体的正下方位置。这样的架构比其他各类的爬行动物（如鳄类，其四肢向外伸展）在走路和奔跑上更为有利。根据恐龙腰的构造特征不同，可以划分为两大类：蜥臀目（Saurischia）、鸟臀目（Ornithischia）。二者间的区别主要在于其腰带结构。 [7]大部分的蜥臀目恐龙都具有往前突出的耻骨，而鸟臀目恐龙的每根耻骨都向后倾斜。除臀部结构不同外，两类恐龙在生活及行为特征上也不同。蜥臀目恐龙包括以四肢行走的草食性蜥脚类恐龙，以及几乎用两肢行走的肉食性兽脚类恐龙。 [7]蜥臀目的腰带从侧面看是三射型，耻骨在肠骨下方向前延伸，坐骨则向后延伸，这样的结构与蜥蜴相似。 [7]鸟臀目的腰带，肠骨前后都大大扩张，耻骨前侧有一个大的前耻骨突，伸在肠骨的下方，后侧更是大大延伸与坐骨平行伸向肠骨前下方。因此，骨盆从侧面看是四射型（除此之外，还有其他区别）。 [7]蜥脚形类主要生活在晚三叠世至白垩纪，它们绝大多数都是大型的素食恐龙。头小，脖子长，尾巴长，牙齿成小匙状。蜥脚亚目的著名代表有产于中国四川、甘肃晚侏罗纪由19节颈椎组成的脖子长度约等于体长的一半的马门溪龙，世界上已知体形最大的陆地动物——易碎双腔龙。 [7]兽脚类生活在晚三叠世至白垩纪。它们大多为肉食性，两足行走，趾端长有锐利的爪子，头部很发达，为最聪明的一类。嘴里长着匕首或小刀一样的利齿，暴龙是著名代表，其余如异特龙、南方巨兽龙、棘龙等也颇具名气。 [7]------生活习性 :觅食 : 草食性恐龙能够吃到的植物受限于它们的身高，所以有些小型草食性恐龙为了吃到高处的植物叶子，会用后肢站立。肉食性恐龙以草食性恐龙和其他动物为食。各种恐龙不同的觅食方式也会在它们的牙齿上体现出来。 [8]斗争 : 锐利的牙齿和爪子是肉食类恐龙猎食的武器。暴龙类恐龙会寻找落单的草食性恐龙，因此常常单独行动。而有些恐龙则会群体行动，锁定猎物后蜂拥而上，并用脚爪的第二根指头割开猎物的腹部。 [8]草食性恐龙一般会有一些特殊的“装备”来对付肉食性恐龙的攻击，这些装备有时是坚韧的皮甲、骨棒或骨钉，有时是有力的尾巴。如棒槌龙等。大型草食性恐龙会集体行动，一旦受到威胁，就会集体坚守阵地并反击。 [8]-----生长繁殖 : 爬行动物是产卵的，以前人们假设恐龙也这样。不过直到20世纪20年代，一支美国探险队到蒙古寻找恐龙化石时，才获得最初的证据。 [9]科学家不只找到了恐龙的遗骨，还找到了它们留下的巢和巢里的蛋。最初发现的恐龙蛋是原角龙的蛋，呈鹅卵形，大约宽7.5厘米、长15厘米，多至30只，蛋尖向内，在巢中以螺旋状排列。恐龙蛋属羊膜卵，巢位于沙中的一个洼处，因为原角龙生活在一个多沙的地方。很多雌龙似乎在同一个集中产卵。很偶然，在其中一个巢中，找到了一只吃蛋恐龙——一偷蛋龙的化石骨骼。看来似乎这只动物在偷袭这巢时，被沙暴压死了。自那以后，很多其他种类恐龙的蛋相继被发现了。 [9] [24]恐龙蛋的直径通常在10厘米～15厘米之间。在中国河南西峡县出土的一种恐龙蛋化石，长直径达30厘米，短直径12厘米，这在中国是很罕见的。 [9]恐龙蛋属羊膜卵，其他爬行动物以及鸡鸭等产的蛋也是羊膜卵。羊膜卵的外面包有一层既坚固又耐干燥的钙质外壳，壳上有许多小气孔是供胚胎发育时呼吸空气用的“窗口”。恐龙蛋壳厚2毫米～7毫米，是世界上最厚的蛋壳。在蛋壳的里面，含有一个大卵黄，为胚胎供应养料：个被羊膜包裹的羊膜囊，其中充满了羊水，胚胎沉漫在羊水中。另外还有一个囊，是存放排泄物用的。 [9]羊膜卵构造精巧、合理，在陆地上不会干涸、失水，胚胎在里面既安全又舒适。与青蛙等两栖动物的卵相比，条件不知好多少倍。青蛙的卵必须产在水中，一离开水它就不能成活；就是不离开水，成活率也有限。所以青蛙一次要产很多很多的卵，以提高成活率。 [9]羊膜的出现是脊椎动物演化过程中的一个重大的飞跃，是动物生殖方面的一大进步，为它们在陆地上繁殖后代创造了必需的条件。 [9]世界各地发现的恐龙蛋大约有数千枚之多，但其中绝大多数都弄不清楚是什么恐龙下的。 [9]还有，到目前为止，发现的化石恐龙蛋都是素食恐龙生的，食肉恐龙的蛋则没发现。但也有报道说，不久前已在美国找到了跃龙蛋的化石。美国科学家发现，恐龙像鸵鸟与鸽子一样，采用坐窝孵蛋的方式孵出后代，这是古生物研究领域的一项重要发现。这项发现印证了古生物考古学家一直在猜测，但又苦于未能证实的事实，这使人类对恐龙的认识又前进了一大步。美国纽约自然历史博物馆的研究人员最近发表报告说，他们与蒙古科学家组成的考古队在戈壁大沙漠中发现了一处保存异常完好的恐龙化石。这是生活在7000万年～8000万年前的一种食肉性恐龙化石，化石清楚地显示，恐龙死前正在孵蛋。它坐在窝上，窝内有15枚恐龙蛋，它的腿微微弯曲，其前爪叉开并伸向后方，似在护着自己的卵。此情此景，与今天的鸵鸟和子、母鸡孵蛋的形式并无两样。从化石上看，该恐龙很像今天的鸵鸟，只是它的尾巴较长而脖子短。 [9]美蒙联合考察队成员、纽约自然历史博物馆鸟类学部研究员路易斯·查蓬指出，对鸟类化石及新发现的恐龙化石进行分析研究，并参照已有的文献及解剖图可以看出，鸟类与恐龙有许多共同的地方。在戈壁大沙漠中的发现，第一次证实鸟与恐龙在行为上有着共同点，其中最主要的一点是它们都是自己孵蛋育出后代。 [9]纽约自然历史博物馆与蒙古科学院组成的古生物考察队，自1990年以来一直在戈壁沙漠里从事考古发掘。他们是在一处名为乌哈一托尔戈特的地方，发现这一极其珍贵恐龙化石的，该地区已被列为恐龙化石保护区。",
                            "src": "./static-2/恐龙类.jpg"
                        },
                        {
                            "name": "翼龙目",
                            "time": "2.51-2亿年前",
                            "description": "翼龙目(Pterosauria)，希腊文意思为“有翼蜥蜴”，是一个飞行爬行动物的演化支。它们生存于三叠纪晚期到白垩纪末期，约2亿2000万年前到6550万年前。翼龙类是第一种能够动力飞行的脊椎动物。它们的翼是由皮肤、肌肉与其他软组织构成的膜，膜从胸部延展到极长的第四手指上。较早的物种有长而布满牙齿的颌部，以及长尾巴;较晚的物种有大幅缩短的尾巴，而且缺乏牙齿。翼龙类的体型有非常大的差距，从小如鸟类的森林翼龙，到地球上曾出现的最大型飞行生物，例如风神翼龙与哈特兹哥翼龙。翼龙类常被大众媒体当成恐龙，但这是错误的。恐龙指的是特定的陆地爬行动物，包括蜥臀目与鸟臀目，并不包括翼龙类、鱼龙类、蛇颈龙类、沧龙类。这群动物通常被大众俗称为翼手龙(Pterodactyls)，希腊文意思为有翼的手指",
                            "src": "./static-2/翼龙目.jpg"
                        },
                        {
                            "name": "裸子植物",
                            "time": "2.51-2亿年前",
                            "description": "裸子植物为多年生木本植物，大多为单轴分枝的高大乔木，少为灌木，稀为藤本；次生木质部几全由管胞组成，稀具导管。叶多为线形、针形或鳞形，稀为羽状全裂、扇形、阔叶形、带状或膜质鞘状。花单性，雌雄异株或同株；小孢子叶球（雄球花）具多数小孢子叶（雄蕊），小孢子叶具多数至2个小孢子囊（花药），小孢子（花粉）具气囊或船形具单沟，或球形外壁上具一乳头状突起或具明显或不明显的萌发孔或无萌发孔，或橄榄形具多纵肋和凹沟，有时还具一远极沟，多为风媒传粉，花粉萌发后花粉管内有两个游动或不游动的精子；大孢子叶（珠鳞、珠托、珠领、套被）不形成封闭的子房，着生一至多枚裸露的胚珠，多数丛生树干顶端或生于轴上形成大孢子叶球（雌球花）；胚珠直立或倒生，由胚囊、珠心和珠被组成，顶端有珠孔。种子裸露于种鳞之上，或多少被变态大孢子叶发育的假种皮所包，其胚由雌配子体的卵细胞受精而成，胚乳由雌配子体的其他部分发育而成，种皮由珠被发育而成；胚具两枚或多枚子叶。裸子植物的染色体基数少（x=8～20），形较大，在各属基本一致。",
                            "children": [
                                {
                                    "name": "松柏门",
                                    "time": "2.51-2亿年前",
                                    "description": "松柏门（学名：Pinophyta）又名球果植物门，是植物界里13或14个门之中的一个，属于裸子植物也是仅次被子植物外最常见的种子植物，为结有球果的维管植物；现存的大部分是树木，但有少部分为灌木，现代松柏门没有草本。典型的松柏门植物包含有香柏、柏、花旗松、冷杉、刺柏、贝壳杉、落叶松、松、红杉、云杉和红豆杉等[1]。松柏门约有8科、68属且630个现存物种[2][3]。松柏门的物种可以在世界上几乎所有的地方上发现其自然生长的踪迹，且通常会在其栖息地内成为优势物种[4]，如在泰加林[1]里。松柏门有很大的经济价值，主要用做木材和纸张的生产[1][4]；松柏门的木材称之为软木。-----演化 : 最早的松柏门植物可追溯至石炭纪晚期（宾夕法尼亚纪）的时代[5]，最初的属可能属于科达属，外形类似今日的南洋杉。松柏门、苏铁门和银杏门都是在此时期出现的[5]。裸子植物的演化允许植物不再那么依赖水生存。另外，花粉和种子也允许胚胎传播到别处，并在别处生长[5]。",
                                    "src": "./static-2/松柏门.jpg"
                                },
                                {
                                    "name": "苏铁门",
                                    "time": "2.51-2亿年前",
                                    "description": "苏铁目（学名：Cycadales，旧称苏铁部[3]）统称苏铁，是苏铁纲（Cycadopsida）中一个唯一目，也是苏铁门植物唯一现存的群类，共有3科，10至12属约305种，分布在全球的热带和亚热带地区。-----形态 : 本科植物为常绿乔木或灌木，典型特征是茎粗壮，多数有羽状叶集生于茎干顶部，孢子叶球也生于茎顶部，为雌雄异株植物。苏铁类外观是一根主干垂直向上生长，没有树支而从主干的顶部不形成树冠，仅向外长出软支长长的叶柄，再向外长对对生的细长羽毛状复叶，其与被子植物的棕榈目或蕨类植物的桫椤目神似，三者常被人认错的超远缘植物，但按趋同演化出适合炎热多雨的地区。-----分布 : 现存的苏铁目物种主要分布于亚洲、美洲、澳洲及非洲的热带及亚热带地区，在温带地区只可在温室内种植。由于多数生长在人迹罕见的热带森林中，最近25年才逐渐被人们发现越来越多的品种，可能尚有许多品种没有被人们发现。苏铁被发现横跨许多世界各地的亚热带和热带地区。苏铁在南美洲和中美洲有最多样性，其余分布在墨西哥，安的列斯群岛，美国东南部，澳大利亚，美拉尼西亚，密克罗尼西亚联邦，日本，中国，东南亚，印度，斯里兰卡，马达加斯加等地则至少有65 种。有些苏铁可以生存在半沙漠、气候恶劣、干旱、潮湿的热带雨林环境下。-----分类 : 苏铁纲植物传统分类被分到裸子植物门，但后来发现裸子植物门是个并系群（被子植物也是起源于裸子植物祖先），且各种裸子植物的性质有很大的差别，所以最新的分类方法将其拆分，单独列为一个苏铁门（Cycadophyta）。灭绝的本内苏铁目曾被认为是本类的祖先之一，现在被认为是从其他裸子植物分裂出来，还有人认为是被子植物的祖先或旁系姐妹群。",
                                    "src": "./static-2/苏铁门.jpg"
                                }
                            ],
                            "src": "./static-2/裸子植物.jpg"
                        }
                    ],
                    "src": "./static-2/主龙类及裸子植物分化.jpg"
                },
                {
                    "name": "三叠纪",
                    "time": "2.5-2亿年前",
                    "description": "主龙王朝开幕 - 三叠纪 [7]（英语：Triassic），是公元前2.5亿至公元前2亿年的一个地质时代，它位于二叠纪和侏罗纪之间，是中生代的第一个纪。三叠纪的开始和结束各以一次灭绝事件为标志。虽然这段时间的岩石标志非常明显和清晰，其开始和结束的准确时间却如同其它古远的地质时代无法非常精确地被确定。其误差在正负数百万年。",
                    "src": "./static-2/三叠纪.jpg"
                },
                {
                    "name": "鱼龙下海",
                    "time": "2.5亿年前",
                    "description": "鱼龙（拉丁语学名：Ichthyosauria，来自希腊语ιχθυς，“鱼”和σαυρος“蜥蜴”）是一种类似鱼和海豚的大型海栖爬行动物。它们生活在中生代的大多数时期，最早出现于约2.5亿年前，比恐龙稍微早一点（2.3亿年前），约9000万年前它们消失，比恐龙灭绝早约2500万年。有些鱼龙身体十分渺小，但还有些鱼龙身体很大。在三叠纪中期今天还未能确定的陆栖爬行动物逐渐回到海洋中生活，演化为鱼龙，这个过程类似海豚和鲸的演化过程。在侏罗纪它们分布尤其广泛。在白垩纪它们作为最高的水生食肉动物被蛇颈龙取代。",
                    "src": "./static-2/鱼龙下海.jpg"
                },
                {
                    "name": "伪鳄类崛起",
                    "time": "2.47亿年前",
                    "description": "伪鳄类（学名：Pseudosuchia）是主龙形下纲中的两个主要演化支之一。它们的头骨通常是厚重的，尤其是与鸟颈类主龙相比；伪鳄类主龙的口鼻部通常是长而狭窄的，颈部短而强壮，四肢的结构介于典型爬行动物的往两侧延伸到恐龙或哺乳类的直立四肢之间（虽然恐龙与哺乳类的姿态不同）。身体通常由两排或更多排的甲板保护者。伪鳄类主龙的体形大多数相当大，可达3米甚至更长。",
                    "src": "./static-2/伪鳄类崛起.jpg"
                },
                {
                    "name": "派克鳄",
                    "time": "2.47-2.45亿年前",
                    "description": "派克鳄（Pachycormus）, 与主龙类血缘最近, 在距今约2.45亿到2.3亿年前的三叠纪中期，生活着一种小型的爬行动物——派克鳄。1913年，派克鳄的第一个化石在南非被发现，是以英国科学家派克的名字来命名的一种爬行动物，派克鳄体型较小，行动非常灵活，令人注目的是，派克鳄拥有相当长的后肢，能够只以后肢快速奔跑，这是一个非常进步的特征，有利于掠食者更加高效地捕猎。这种两足运动的趋势，一直体现在某些恐龙与早期镶嵌踝类主龙身上",
                    "src": "./static-2/派克鳄.jpg"
                },
                {
                    "name": "板龙",
                    "time": "2.4亿年前",
                    "description": "早期大型恐龙 - 板龙是三叠纪的古老恐龙，生存于2.22亿年 ~ 2亿年前，它是出现在地球上的第一种巨型恐龙。在板龙出现以前，最大的植食类动物的身材也就像一头猪那样大，而板龙要大得多，它的身体有一辆公共汽车那么大。板龙意为'平板的爬行动物'，是生存于2亿1000万年前，晚三叠纪的古老恐龙。体长6－8米，身高3.6米，体重5吨左右，据考古研究它是生活在地球上食植物第一种巨型恐龙。",
                    "src": "./static-2/板龙.jpg"
                },
                {
                    "name": "幻龙",
                    "time": "2.4亿年前",
                    "description": "幻龙是远古时期鳍龙类的一种，（其它鳍龙类包括蛇颈龙类和盾齿龙类），属三叠纪时期动物，据今达2.43亿年，它们体型大小不一，最小的只有36厘米，最大的长达6米，长有锐利的牙齿，捕食各种鱼类，另外幻龙的四肢相当发达，可以想象它们会爬上岸捕食或产卵。",
                    "src": "./static-2/幻龙.jpg"
                },
                {
                    "name": "卡尼期洪积事件",
                    "time": "2.34-2.32亿年前",
                    "description": "一场连绵200万年的大雨 - 卡尼期洪积事件，指2.33亿年前发生的一次生物大灭绝事件，期间200多万年气候处于湿润期。该事件除了导致一些物种灭绝外，也将恐龙送上地球之王的宝座。",
                    "src": "./static-2/卡尼期洪积事件.jpg"
                },
                {
                    "name": "哺乳形类出现",
                    "time": "2.3亿年前",
                    "description": "哺乳类是很古老的类群，出现于中生代三叠纪末期，其祖先可追溯到 大约在2.8 亿年前的二叠纪。 早在恐龙兴起之前，有一些类哺乳类就已在陆地生活，它们属合颞窝类（Synapsida），在其头骨两侧各有一个颞窝，以后眶骨和鳞状骨为上界、颧骨为下界。 最早的肉食性合颞窝类是盘龙类，是二叠纪早期最常见的羊膜类，外形与蜥蜴接近。 后被更进化的类群兽孔类所代替。",
                    "src": "./static-2/哺乳形类出现.jpg"
                },
                {
                    "name": "恐龙诞生",
                    "time": "2.25亿年前",
                    "description": "中生代的无冕之王",
                    "src": "./static-2/恐龙诞生.jpg"
                },
                {
                    "name": "菊石亚纲崛起",
                    "time": "2.25亿年前",
                    "description": "菊石亚纲动物是已绝灭的海生无脊椎动物，生存于中奥陶纪至晚白垩纪，因它的表面通常具有类似菊花的线纹而得名。有关菊石动物的知识主要来自保存为化石的菊石壳体和口盖以及通过对菊石在地层中的分布和保存状态的观察并基于与现代海洋中生活的鹦鹉螺属的对比而获得。",
                    "src": "./static-2/菊石亚纲崛起.jpg"
                },
                {
                    "name": "波斯特鳄",
                    "time": "2.21亿年前",
                    "description": "波斯特鳄（Postosuchus）是一种产自德克萨斯、亚利桑那和新墨西哥州的巨型初龙类，以得克萨斯州的小镇波斯特命名。从复原图上看，波斯特鳄有些像鳄鱼和霸王龙的杂交种。波斯特鳄体长最大为6米，具有较高的巨大头骨，似乎是能够抓住并杀死当时大多数大型动物的令人恐惧的捕食动物。",
                    "src": "./static-2/波斯特鳄.jpg"
                },
                {
                    "name": "翼龙诞生",
                    "time": "2.16亿年前",
                    "description": "脊椎动物第一次拥抱天空 - 翼龙，是蜥形纲翼龙目的爬行动物的统称，与恐龙和鳄类有着较近的亲缘关系，其名字的含义为有翼的蜥蜴。 [13]翼龙是一种已经灭绝的能够飞行的爬行动物和脊椎动物。 [14]翼龙前肢已变成膜状翼，由前肢第四指加长与腹侧延伸出的薄膜相连而成，第五指消失，其余三指很小，前端有爪。骨骼中空而轻，头骨低平，多具锥形齿，胸骨发育。翼龙仅具膜状翼，翼虽大，但因无骨骼支撑，故不能作远距离飞行。 [15]雄性的骨盆小，头骨有脊；而雌性骨盆大，头骨无脊。 [16]翼龙化石在中国的新疆、内蒙古、辽宁、河北、甘肃、四川、山东、浙江等地均有发现，而在世界范围内，目前已经在各大洲，包括南极洲都发现了翼龙化石。 [17]翼龙目的生存年代从三叠纪晚期开始一直延续到白垩纪晚期，几乎跨越了整个中生代。 [18]翼龙脑子大，具有良好的视觉神经系统，视觉发达，每日盘旋于海域上空， [19]生活在海、湖边，有的以鱼虾类为食， [20]还有的以昆虫或水果为食。 [21]翼龙以卵生的方式繁殖，类似今天的鸟类，它们会把卵产在水边的沙地上。 [22]翼龙灭绝的原因，有科学专家通过研究认为，火山频繁的爆发导致翼龙灭绝，也有专家认为翼龙有可能在进化到了温血动物阶段，由于进化速度不快、程度不同，最终还是被进化速度快、程度高的鸟类独霸了天空。 [23]新的观点认为翼龙在进化的过程中适应了依靠海洋的生活模式，所以，当白垩纪灭绝事件发生时，翼龙与海洋生物一同灭绝。",
                    "src": "./static-2/翼龙诞生.jpg"
                },
                {
                    "name": "秀尼鱼龙",
                    "time": "2.15亿年前",
                    "description": "鱼龙体型巅峰, 部分种类体长可达21m - 秀尼鱼龙属是鱼龙目萨斯特鱼龙科 [1]的一个属，学名Shonisaurus。秀尼鱼龙的化石是在1920年首次发现，发现于内华达州的大型沉积物里。30年后，它们的化石被挖掘出来，并且发现该沉积物有37个非常大型鱼龙类化石，它们后来被命名为秀尼鱼龙（Shonisaurus），意思为“来自休尼山脉的蜥蜴”，以该化石发现的地层组命名。秀尼鱼龙是发现的最大的鱼龙目动物，它的体长比得上一辆公共汽车。秀尼鱼龙处在鱼龙目进化历程中很早的阶段，有一些很特别的特征，使其有别于它的亲缘动物。它体型宽大笨重，鳍状肢很长且等尺寸，牙齿只长在口腔的前部。秀尼鱼龙的食物还不确定，但就其尺寸而言，它也是一种可怕的掠食者，能够捕捉很多其他海洋动物",
                    "src": "./static-2/秀尼鱼龙.jpg"
                },
                {
                    "name": "三叠纪末大灭绝",
                    "time": "2.14-1.99亿年前",
                    "description": "第四次物种大灭绝, 又叫T-J灭绝事件, 三叠纪-侏罗纪灭绝事件, 约有76%的物种灭绝 - 三叠纪-侏罗纪灭绝事件（Triassic–Jurassic extinction event）是五大生物集群灭绝事件之一，发生于三叠纪与侏罗纪之间，大约是1.996亿年前（一说是2.14亿年前）。这次灭绝事件的影响程度遍及陆地与海洋。在海洋生物中，有20%的科消失，包含著名的牙形石。大型鳄类（如角鳄、狂齿鳄、波斯特鳄、灵鳄、楔形鳄）遭遇三叠纪早期植物面貌多为一些耐旱的类型，随着气候由半干热、干热向温湿转变遭受重创；大部分兽孔目、以及许多大型两栖动物也灭亡。三叠纪是古生代生物群消亡后现代生物群开始形成的过渡时期，植物趋向繁茂，低丘缓坡则分布有和现代相似的常绿树，如松、苏铁等，而盛产于古生代的主要植物群（尤其是裸子植物）几乎全部灭绝。三叠纪-侏罗纪灭绝事件使当时至少50%的物种消失。这次灭绝事件造成许多空缺的生态位，使恐龙成为了侏罗纪的优势陆地动物。三叠纪-侏罗纪灭绝事件发生于盘古大陆分裂前，经历时间短于一万年。这次灭绝事件，也造成三叠纪恐龙、侏罗纪恐龙的明显差异。",
                    "src": "./static-2/三叠纪末大灭绝.jpg"
                },
                {
                    "name": "狂齿鳄",
                    "time": "2.03亿年前",
                    "description": "狂齿鳄，属于副鳄类。生活在2.03亿年前年前的中生代三叠纪和侏罗纪，体长可达12英尺，性情凶恶贪婪，是当时湖泊中的顶级猎食者。常常潜伏在溪流和湖泊中，仅将鼻孔露出水面，捕食鱼类或其他动物。该物种在第四次生物大灭绝中灭绝。",
                    "src": "./static-2/狂齿鳄.jpg"
                },
                {
                    "name": "哺乳动物的首个先躯兽孔目出现",
                    "time": "2亿年前",
                    "description": "-----演化史 : 兽孔目演化的轨迹起源于早二叠纪，当时一群盘龙目中的楔齿龙科，演化出异齿龙的世系，演化出兽孔目。证据是它们解剖学上的特征，例如头骨与脊椎。兽孔目在中二叠纪取代盘龙目成为陆地上的优势动物。兽孔目的颞颥孔远比盘龙目的大。兽孔目可能在中或晚二叠纪时演化出热量调节(温血动物)。兽孔目可能拥有皮腺，较类似哺乳类而非爬虫类的鳞片。早期兽孔目没有皮毛；晚二叠纪演化出的兽齿类可能是所知拥有皮毛的兽孔目。兽孔目由三个主要的演化支组成，恐头兽亚目、草食性的缺齿亚目、还有大多是肉食性的兽齿类，而肉食性的始巨鳄亚目是个原始物种的并系群集合。 [2]在一阵简短的多样性演化爆炸后，恐头兽亚目在中二叠纪(瓜达鹿白阶)晚期消失，但缺齿亚目的二齿兽类与兽齿类的丽齿兽类与兽头类繁盛起来，二叠纪末期第一批犬齿兽类也出现。就像所有陆地动物，兽孔目被二叠纪-三叠纪灭绝事件严重影响，繁盛的丽齿兽类全部灭亡，只有ㄧ两科的少数品种残存下来，每个存活到三叠纪。缺齿亚目中一科大型笨重的草食性肯氏兽，与中等大小的犬齿兽类(包括草食性与肉食性)在全世界繁盛持续到三叠纪早期与中期。它们在卡尼阶(晚三叠纪)末期从盘古大陆上逐渐消失，但它们仍在赤道地带与南方持续存活一段时间。有些仍持续演化出真犬齿兽类，至少有三群存活者：1.极像哺乳类的一科，三瘤齿兽科，存活到早白垩纪2.极像哺乳类的一科，三棱齿兽科，早侏罗纪后不知去向3.第三群，摩根齿兽与小型动物，是哺乳形动物二齿兽类被认为在侏罗纪末期灭亡，但有证据显示它们仍然存活者。它们的化石在冈瓦纳大陆被发现。其他侏罗纪常见的生物也在这里避难，例如：分椎目。这是个考古学上忽隐忽现的物种的证据。-----兽孔目动物的衰落 : 三叠纪的世界与二叠纪时并没有什么不同：动物们没有被海洋互相隔离开，可以到处游荡，相同物种的化石在相隔很远的地方都有发现。在二叠纪得到进化的兽孔目动物就充分利用了这种陆地上的行动自由，向四周不断蔓延。水龙兽是一种躯体呈桶状的植食性动物，人们在相隔甚远的欧洲和南极洲发现了它们的化石，这说明这些大陆曾经是连在一起的。然而，对整个兽孔目动物群来说，三叠纪是一个艰难的时期。尽管它们在二叠纪成为了陆地生命的主宰，但在终结二叠纪的大灭绝中，却没能够保住自己的地位。爬行动物的一个新族群——祖龙，经过一场迅速的进化爆发之后，慢慢地将兽孔目动物挤出了历史舞台。兽孔目动物在衰落的过程中，渐渐产生了最早的哺乳动物，不过它们还比较小也不太起眼。这些哺乳动物就一直用这样的方式，生存了数百万年，直到爬行动物时代残酷剧终 [3]。",
                    "children": [
                        {
                            "name": "真犬齿兽下目",
                            "time": "2亿年前",
                            "description": "真犬齿兽下目（Eucynodontia）是一个似哺乳爬行动物演化支，属于合弓纲兽孔目的犬齿兽亚目，包含现代哺乳动物的直系祖先与其旁系近亲。其成员可分成肉食性与草食性。存在时间可能从晚二叠纪或早三叠纪，直到现代。关于真犬齿兽类的论述集中在晚三叠纪到晚白垩纪的原始哺乳类上。",
                            "src": "./static-2/真犬齿兽下目.jpg"
                        },
                        {
                            "name": "SRY基因演化",
                            "time": "2亿年前",
                            "description": "SRY基因（sex-determining region of Y-chromosome，全称：Y染色体性别决定区），又名睾丸决定因子，（英语：Testis-determining factor，简称TDF）是人体Y染色体上的一段基因片段，该基因是决定男性睾丸发育的主要基因。存在于Y染色体的短臂末端上。该基因由Sinclair在1990年发现。有些人宣称，SRY基因就是唯一一个性别决定基因，因此可以通过寻找该基因片段，达到判断测试者的性别的目的，若样本中存在该基因表示受试者是男性，否则为女性。然而一篇有一千六百余名科学家签名的声明（包括700 名生物学者、100名遗传学者、9名诺贝尔奖得主）指出：目前不存在任何方式可以准确地判断生理性别，且即使有办法判断，也不应该因此限制人们追求不同的自我认同。",
                            "src": "./static-2/SRY基因演化.jpg"
                        }
                    ],
                    "src": "./static-2/哺乳动物的首个先躯兽孔目出现.jpg"
                },
                {
                    "name": "侏罗纪",
                    "time": "2-1.45亿年前",
                    "description": "恐龙盛世 - 侏罗纪（Jurassic）是一个地质年代，界于三叠纪和白垩纪之间，约公元前1亿9960万年（误差值为60万年）到1亿4550万年（误差值为400万年）。侏罗纪是中生代的第二个纪，开始于三叠纪-侏罗纪灭绝事件。虽然这段时间的岩石标志非常明显和清晰，其开始和结束的准确时间却如同其它古远的地质时代，无法非常精确地被确定。",
                    "src": "./static-2/侏罗纪.jpg"
                },
                {
                    "name": "蛇颈龙崛起",
                    "time": "2亿年前",
                    "description": "蛇颈龙是已灭绝的蛇颈龙属海生爬行类的统称，属双孔亚纲鳍龙目，是一类适应浅水环境中生活的类群，个体较大，且长颈，因以得名。从三叠纪晚期开始出现，到侏罗纪已遍布世界各地，白垩纪末灭绝。蛇颈龙体型硕大无比，是海洋中的霸王，与鱼龙类一起统治着中生代的海洋。",
                    "src": "./static-2/蛇颈龙崛起.jpg"
                },
                {
                    "name": "恐龙存活并繁盛",
                    "time": "2亿年前",
                    "description": "恐龙（英语：dinosaur）是蜥形纲鸟颈主龙类恐龙总目（学名：Dinosauria）下的所有动物的统称，是繁盛于显生宙中生代的一大类陆生和半水生生物，也是大众文化中最著名的古生物类群。恐龙最早出现在2亿3千万年前的三叠纪中期，在卡尼期洪积事件后出现大规模的演化辐射，在三叠纪末灭绝事件后演替取代了伪鳄类成为优势物种，并与同属鸟颈类的翼龙一起在之后的侏罗纪和白垩纪支配全球陆地生态系统长达1亿4千万年之久[2]，直到其在至今6千6百万年前的白垩纪—古近纪灭绝事件中集体灭绝为止。恐龙常被分为“非鸟恐龙”和“鸟形恐龙”两类。所有非鸟恐龙、鸟型恐龙中的反鸟亚纲和扇尾亚纲都在白垩纪末灭绝事件（即“恐龙大灭绝”）中灭绝，仅剩下鸟形恐龙中的今鸟亚纲存活了下来，演化至今的鸟类[3][4]。按照骨盆结构分类，恐龙则可以分为蜥臀目和鸟臀目两大演化支。和一些大众固有的印象不同，同样兴盛于中生代的翼龙和鱼龙、蛇颈龙、沧龙等海生爬行动物并不属于恐龙的范畴，都仅只是生存于同地质时期的蜥形纲类群。自从1822年，人类在英国的曼彻斯特发现一具恐龙化石——禽龙以来，恐龙的骨架化石因为其构造奇妙、和现存生物差异颇多，就迅速成为了全球博物馆的热门展览品，世界上第一次世博会的会场伦敦水晶宫内就已经有恐龙化石展出[5][6][7][8]；而世界上第一个专门的恐龙展则是在1852年出现的，它被称为恐龙水晶宫，至今仍作为英国的历史建筑被保留[9][10][11]。随着一批又一批的恐龙化石被挖掘出来，恐龙这一生物逐渐被地球上的人类所熟知[12]。20世纪前期，欧洲各大殖民帝国，例如英法德义奥俄等，均在自己的首都建立恢弘的博物馆，用以摆放巨大的恐龙骨架化石[13][14]。在20世纪中后期，随着美国好莱坞电影工业的兴起，恐龙开始去学术化、去高雅化，逐渐变为现代大众文化的一部分，无论儿童或者成年人均对恐龙有很高的兴致[15]，日本在二战后也把恐龙作为怪兽特摄片的直接灵感来源之一，例如《哥斯拉》系列电影[16][17]。从1990年代开始，美国的恐龙小说及以CGI特效作为视觉效果技术支持的改编电影《侏罗纪公园》和《侏罗纪世界》系列[18]造成轰动，在全球范围内引发“恐龙热”。恐龙在知名度大增过后，往往也会成为各种书籍、电影、玩具、电子游戏的常见题材，公共媒体也时常报导关于恐龙的最新研究成果，或者作为未知生物、恐龙复活（尽管目前未能实现）等消息出现在人们的视野中。19世纪早期，一开始发现恐龙化石的时候，它们被认为是和蜥蜴相近的物种，当时的欧洲科学界也都视恐龙为行动缓慢、慵懒的冷血动物，所以当时欧洲人就把恐龙的拉丁文名称取为“恐怖的蜥蜴”。进入19世纪的工业革命后期之后发现始祖鸟的化石，它明明身为鸟类，但骨架的结构却和身为恐龙的美颌龙极度相似，差别只在于始祖鸟化石上有羽毛，而美颌龙爪子较大。到了20世纪的1970年代，恐龙被证明是属于主龙，而非蜥蜴所属的鳞龙，加上美国西部内陆海道中出土的大量恐龙化石，让全世界产生了一股研究恐龙的风潮，是为恐龙文艺复兴。在1980年代，科学家提出恐龙也许是群活跃的温血动物，与鸟类之间必定存在某种关系，且可能有社会行为，但这个推测在当时缺乏化石证明，所以并未成为共识[19][20]。至1990年代，古生物学家于中国和蒙古陆续发现包含中华龙鸟、尾羽龙、北票龙等有羽毛恐龙的化石证据，证明了恐龙就是现代鸟类的祖先。2000年以后，愈来愈多的“现代鸟类”和“鸟型恐龙”之间的过渡物种在全球各地陆续被发现，填补了原本化石材料上的空白，验证了之前“恐龙是温血动物且拥有高智商”的假设，古生物学家也主张恐龙和鸟类应该分类于同一纲之内[21]。到了2010年代，根据从鸟类基因出发的支序分类学的研究，鸟类从“恐龙的后代”被更进一步证明为是“现代唯一存活的恐龙类群”，在博物馆、儿童读物或电影中的兽脚类恐龙也被更新为有羽毛的形象。虽然“恐龙”一词的科学定义已足够明确，现代的鸟类即恐龙本身，但鉴于普罗大众仍不将现生的鸟类视为恐龙，本文以及绝大多数百科书籍所写的“恐龙”介绍，均以“非鸟恐龙”为主，鸟类则单独罗列条目介绍。",
                    "children": [
                        {
                            "name": "三叠纪-侏罗纪灭绝事件",
                            "time": "2亿年前",
                            "description": "三叠纪-侏罗纪灭绝事件（Triassic–Jurassic extinction event）是五大生物集群灭绝事件之一，发生于三叠纪与侏罗纪之间，大约是1.996亿年前（一说是2.14亿年前）。这次灭绝事件的影响程度遍及陆地与海洋。在海洋生物中，有20%的科消失，包含著名的牙形石。大型鳄类（如角鳄、狂齿鳄、波斯特鳄、灵鳄、楔形鳄）遭遇三叠纪早期植物面貌多为一些耐旱的类型，随着气候由半干热、干热向温湿转变遭受重创；大部分兽孔目、以及许多大型两栖动物也灭亡。三叠纪是古生代生物群消亡后现代生物群开始形成的过渡时期，植物趋向繁茂，低丘缓坡则分布有和现代相似的常绿树，如松、苏铁等，而盛产于古生代的主要植物群（尤其是裸子植物）几乎全部灭绝。三叠纪-侏罗纪灭绝事件使当时至少50%的物种消失。这次灭绝事件造成许多空缺的生态位，使恐龙成为了侏罗纪的优势陆地动物。三叠纪-侏罗纪灭绝事件发生于盘古大陆分裂前，经历时间短于一万年。这次灭绝事件，也造成三叠纪恐龙、侏罗纪恐龙的明显差异。",
                            "src": "./static-2/三叠纪-侏罗纪灭绝事件.jpg"
                        },
                        {
                            "name": "联体病毒科出现",
                            "time": "2亿年前",
                            "description": "联体病毒科（Geminiviridae）病毒含有这种类 型基因组，复制时单链DNA先合成双链DNA，再 以常规途径转录生成mRNA。 核酸类型与高等动、植物的相同，为互补的双 链DNA，花椰菜花叶病毒属（Caulimovirus）、杆 状DNA病毒属（Badnavirus）具有这种类型基因组。 ff植物病毒有两种基本结构方式：螺旋对称型结构和等面体对称型 结构。",
                            "src": "./static-2/联体病毒科出现.jpg"
                        }
                    ],
                    "src": "./static-2/恐龙存活并繁盛.jpg"
                },
                {
                    "name": "链鳄",
                    "time": "1.93亿年前",
                    "description": "链鳄属（属名：Desmatosuchus）又名有角鳄、钉鳄龙，意为，是种已灭绝主龙类爬行动物，属于坚蜥目。链鳄是最大型的坚蜥目动物之一，身长5米，高度约1.5米。它们生存于晚三叠纪的北美洲德州。链鳄的外表类似它们的近亲，身体拥有鳞甲，头部类似猪。链鳄使用它们铲状口鼻部来拔起植物。不像其他坚蜥类，链鳄背部侧边有两排尖刺，肩膀两侧各有一只长达45公分的尖角。这提供链鳄额外的防护以抵抗掠食动物",
                    "src": "./static-2/链鳄.jpg"
                },
                {
                    "name": "现今两栖类开始出现",
                    "time": "1.9-1.5亿年前",
                    "description": "两栖类的起源要追溯到距今3.7亿～3.5亿年前的泥盆纪晚期。 那时，陆上的气候变得干燥，河流与湖泊周期性地变成污浊的池塘和广阔的泥滩。 同时，海平面下降，使得一些鱼类只能生活在留存的水塘或潮湿的岸边。 鱼类遇到了强大的选择压力。 它们只有两种结局：一种是死掉，另一种是想方设法到其他有水的池塘里去。 因此，由于逐渐适应和相对快速的一系列进化改变，具有气呼吸与肉鳍的鱼越来越适应陆地生活。",
                    "children": [
                        {
                            "name": "滑体亚纲",
                            "time": "1.9-1.5亿年前",
                            "description": "滑体亚纲 Lissamphibia 滑体亚纲是两栖纲现存的唯一一个亚纲。 头部骨片少，包括近代型的两栖动物。 有 无尾目 、 有尾目 和 蚓螈目 三个目。 过去有人以椎体为依据，认为 无尾目 起源于 迷齿亚纲， 蚓螈目 和有尾目起源于 壳椎亚纲，还有其它论点，其论据均不充分。 根据3目的主要共性,可归并为一个亚纲。 共性为： 内耳有两栖乳突等。",
                            "children": [
                                {
                                    "name": "无尾目",
                                    "time": "1.9-1.5亿年前",
                                    "description": "无尾目（学名Anura）是属于两栖纲的动物，成体基本无尾，卵一般产于水中，孵化成蝌蚪，用鳃呼吸，经过变态，成体主要用肺呼吸，但多数皮肤也有部分呼吸功能。主要包括两类动物：蛙和蟾蜍。这两类动物没有太严格的区别，有的一科中同时包括两种。一般来说，蟾蜍多在陆地生活，因此皮肤多粗糙；蛙体形较苗条，多善于游泳。两种体形相似，颈部不明显，无肋骨。前肢的尺骨与桡骨愈合，后肢的胫骨与腓骨愈合，因此爪不能灵活转动，但四肢肌肉发达。无尾目是生物从水中走上陆地的第一步，比其他两栖纲生物要先进，虽然多数已经可以离开水生活，但繁殖仍然离不开水，卵需要在水中经过变态才能成长。因此不如爬行纲动物先进，爬行纲动物已经可以完全离开水生活。",
                                    "src": "./static-2/无尾目.jpg"
                                },
                                {
                                    "name": "有尾目",
                                    "time": "1.9-1.5亿年前",
                                    "description": "有尾目（学名Caudata）是终身有尾的两栖动物，一共有8科60属300多种，幼体与成体形态上差别不大，主要包括蝾螈、小鲵和大鲵。有尾目有发展完全的前肢和后肢，大小大约一致。没有鼓膜或外耳开口。牙齿位于下颌。身体没有鳞片或尖锐的爪子。通常行体内受精。",
                                    "src": "./static-2/有尾目.jpg"
                                }
                            ],
                            "src": "./static-2/滑体亚纲.jpg"
                        }
                    ],
                    "src": "./static-2/现今两栖类开始出现.jpg"
                },
                {
                    "name": "盘古大陆分裂",
                    "time": "1.8亿年前",
                    "description": "盤古大陸經過三個階段的分裂，形成現今大陸的分布情形： 第一階段：距今2亿3000万年前的 三叠纪 中期，盘古大陆西岸开始分裂形成现今的 墨西哥湾 和 加勒比海。 距今1亿7500万年前的 侏罗纪 早期，裂缝加大开始形成 北大西洋 南部，盘古大陆重新分裂成仅有一小块 陆桥 连接的 劳亚大陆 和 冈瓦纳大陆。",
                    "children": [
                        {
                            "name": "冈瓦那大陆",
                            "time": "1.8亿年前",
                            "description": "冈瓦纳古陆（冈瓦纳大陆），是一个推测存在于南半球的古大陆，也称南方大陆，它因印度中部的冈瓦纳地方而得名。在印度半岛，从石炭纪到侏罗纪包括其下部的特征冰碛层到较上部的含煤地层，统称为“冈瓦纳（岩）系”。南半球各大陆都发现有这一时代的相似岩系和化石，根据这一相似性和其他证据，便给这个推论为统一的古大陆命名为冈瓦纳古陆。",
                            "children": [
                                {
                                    "name": "南极洲",
                                    "time": "1.8亿年前",
                                    "description": "南极洲(Antarctica)，围绕南极的大陆，地球七大洲之一。位于地球南端，四周被南冰洋所包围， [5]边缘有别林斯高晋海、罗斯海、阿蒙森海和威德尔海等。南极洲由大陆、陆缘冰、岛屿组成，总面积1424.5万平方公里，其中大陆面积1239.3万平方千米，陆缘冰面积158.2万平方公里，岛屿面积7.6万平方公里。全境为平均海拔2350米的大高原，是世界上平均海拔最高的洲。大陆几乎全被冰川覆盖，占全球现代冰被面积的80%以上。大陆冰川从中央延伸到海上，形成巨大的罗斯冰障，周围海上漂浮着冰山。整个大陆只有2%的地方无长年冰雪覆盖，动植物能够生存。气候酷寒，极端最低气温曾达-89.2℃（1983年）。风速一般达每秒17~18米，最大达每秒90米以上，为世界最冷和风暴最多、风力最大的陆地。全洲年平均降水量为55毫米，极点附近几乎无降水，空气非常干燥，有“白色荒漠”之称。在南极圈内暖季有连续的极昼，寒季则有连续的极夜，并有绚丽的弧形极光出现。动物有企鹅、海豹、海狮、信天翁等。附近海洋产南极鳕鱼、大口鱼等，磷虾产量全球最大。已发现矿物有煤、石油、天然气、金、银、镍、钼、锰、铁、铜、铀等，主要分布在南极半岛及沿海岛屿地区。",
                                    "src": "./static-2/南极洲.jpg"
                                },
                                {
                                    "name": "澳洲",
                                    "time": "1.8亿年前",
                                    "src": "./static-2/澳洲.jpg"
                                },
                                {
                                    "name": "南美洲",
                                    "time": "1.8亿年前",
                                    "description": "南美洲（South America）是南亚美利加洲的简称，位于西半球、南半球。东临大西洋，西临太平洋，北临加勒比海。北部和北美洲以巴拿马运河为界，南部和南极洲隔德雷克海峡相望。南美洲是陆地面积第四大的大洲，陆地面积1784万平方千米。安第斯山脉几乎纵贯整个南美洲西部，拥有美洲最高的山峰——阿空加瓜山。安第斯山脉东部就是面积广大的亚马孙河盆地，占地超过700万平方千米，大部分地区都是热带雨林。",
                                    "src": "./static-2/南美洲.jpg"
                                },
                                {
                                    "name": "非洲",
                                    "time": "1.8亿年前",
                                    "description": "非洲（英文：Africa），全称阿非利加洲，位于东半球西部，欧洲以南，亚洲之西，东濒印度洋，西临大西洋，纵跨赤道南北，面积大约为3020万平方公里（土地面积），占全球总陆地面积的20.4%，是世界第二大洲，最新估计，非洲人口超过14亿，约占世界六分之一。 [1]非洲大陆东至哈丰角（东经51°24′、北纬10°27′），南至厄加勒斯角（东经20°02′、南纬34°51′），西至佛得角（西经17°33′、北纬14°45′）， 北至吉兰角（本赛卡角）（东经9°50′、北纬37°21′） [15]。非洲大陆高原面积广阔，海拔在500米-1000米的高原占非洲面积的60%以上，有“高原大陆”之称。海拔2000以上的山地高原约占非洲面积5%。低于海拔200米的平原多分布在沿海地带，不足非洲面积的10%。非洲大陆平均海拔为750米",
                                    "src": "./static-2/非洲.jpg"
                                },
                                {
                                    "name": "印度",
                                    "time": "1.8亿年前",
                                    "src": "./static-2/印度.jpg"
                                }
                            ],
                            "src": "./static-2/冈瓦那大陆.jpg"
                        },
                        {
                            "name": "劳亚大陆",
                            "time": "1.8亿年前",
                            "description": "劳亚大陆（ Laurasia）又译“劳拉西亚大陆”，为地质史古陆之一，存在于侏罗纪到白垩纪。劳亚大陆包含现今北半球大部分陆地。由劳伦大陆、波罗地大陆、西伯利亚大陆、哈萨克大陆、华北陆块、华南陆块构成，在侏罗纪中期由盘古大陆北端分裂而成，然后在白垩纪分裂成今天的欧亚大陆和北美大陆。其名称是由劳伦大陆（Laurentia）与欧亚大陆（Eurasia）组成。",
                            "children": [
                                {
                                    "name": "北美洲",
                                    "time": "1.8亿年前",
                                    "description": "北美洲（英语：North America），全称为北亚美利加洲，位于西半球北部，是世界经济第二发达的大洲，其中美国经济位居世界首位，在全球经济和政治上有重要影响力。北美洲大部分面积属于发达国家，有着极高的人类发展指数和经济发展水平。通用英语，其次是西班牙语、法语、荷兰语、美洲原住民语言等。北美洲总面积2422.8万平方公里（包括附近岛屿），约占世界陆地总面积的16.2%，是世界第三大洲。其东临大西洋，西临太平洋，北临北冰洋，南以巴拿马运河为界与南美洲相分，东北面隔丹麦海峡与欧洲相望，地理位置优越。大陆东至圣查尔斯角（西经55°40′，北纬52°13′），南至马里亚托角（西经81°05′,北纬7°12′），西至威尔士王子角（西经168°05′,北纬65°37′），北至布西亚半岛的穆奇森角（西经94°26′，北纬71°59′）。",
                                    "src": "./static-2/北美洲.jpg"
                                },
                                {
                                    "name": "欧亚大陆",
                                    "time": "1.8亿年前",
                                    "description": "亚欧大陆，也称做“欧亚大陆”，是亚洲大陆和欧洲大陆的合称，面积达5000多万平方千米。从板块构造学说来看，亚欧大陆由亚欧板块、印度板块、阿拉伯板块和东西伯利亚所在的北美板块所组成。",
                                    "src": "./static-2/欧亚大陆.jpg"
                                }
                            ],
                            "src": "./static-2/劳亚大陆.jpg"
                        }
                    ],
                    "src": "./static-2/盘古大陆分裂.jpg"
                },
                {
                    "name": "软骨鱼纲的第二次主要演化事件",
                    "time": "1.8-1.44亿年前",
                    "description": "软骨鱼纲的第二条进化路线以全头类为代表。 这可从现代的 银鲛 类经由中生代的多棘鲛类追溯到颊甲鲛类。 它们几乎全是底栖的，具有替换缓慢的 齿板，基本以带壳食物为食，用齿板研磨。 全头类 于石炭纪达到极盛期，侵占了原来被 盾皮鱼 类占据的环境，并取而代之。 全头类中有两类齿型：即“鲨”型和“齿板”型。",
                    "src": "./static-2/软骨鱼纲的第二次主要演化事件.jpg"
                },
                {
                    "name": "滑齿龙",
                    "time": "1.7亿年前",
                    "description": "滑齿龙是一种海洋爬行动物，在侏罗纪晚期，它们粗壮的身影在四片中等大小桨鳍的驱动下四处游荡。滑齿龙的长颚里满部尖锐的牙齿。滑齿龙的鼻腔结构使得它在水中也能嗅到气味，这样滑齿龙就可以在很远的地方发现猎物行踪。除了要上浮呼吸外，滑齿龙一生都在水中度过，因此它们也是卵胎生动物，喜欢在浅海域产仔。滑齿龙意思是“平滑侧边牙齿”，是种肉食性海生爬行动物，属于蛇颈龙目里短颈部的上龙亚目。滑齿龙生存于中侏罗纪的卡洛夫阶，约1亿7000万年前到1亿5500万年前。滑齿龙是生活在侏罗纪中晚期的动物，一些保存相当完好的滑齿龙骨骼化石，清楚显示牙齿的排列及其头部的形状。但这些头骨并不一定就属于片中威胁牛津夏（oxford shire）附近水域。",
                    "src": "./static-2/滑齿龙.jpg"
                },
                {
                    "name": "大眼鱼龙",
                    "time": "1.65亿年前",
                    "description": "大眼鱼龙（Ophthalmosaurus）是侏罗纪晚期中等体型的一种肉食性鱼龙。眼窝直径有10厘米，相对于3.5米的体长来说，这眼睛实在是很可观了。流线型的身体帮助它以2.5千米的时速在侏罗纪的海洋中游弋。 生活在广大的海洋，为胎生动物，并只有在生产时才会靠近岸边。它们的游泳速度可能相当快，并以没有牙齿的长嘴追捕乌贼和鱼类。",
                    "src": "./static-2/大眼鱼龙.jpg"
                },
                {
                    "name": "最早能游泳的哺乳动物近亲獭形狸尾兽出现",
                    "time": "1.64亿年前",
                    "src": "./static-2/最早能游泳的哺乳动物近亲獭形狸尾兽出现.jpg"
                },
                {
                    "name": "达尔文翼龙",
                    "time": "1.61亿年前",
                    "description": "达尔文翼龙Darwinopterus是既具有进步类型（翼手龙类）的头骨和颈椎特征，又有原始类群（喙嘴龙类）的特征，适逢达尔文翼龙的发表年为英国博物学家、进化论奠基者达尔文(1809-1882)诞辰200周年和他的《物种起源》发表150周年，达尔文翼龙的研究者中国地质科学院地质研究所的吕君昌博士特命名为模块达尔文翼龙以纪念这两大重要事件。达尔文翼龙是处于长尾的原始喙嘴龙类和进步的、短尾的翼手龙类之间的过渡类型。它的头部和颈椎构造（头骨上鼻孔和眶前孔愈合一起形成大的鼻眶前孔，颈椎具有不发育的颈肋等）体现进步类群-翼手龙类的特征，而身体的其它部分与喙嘴龙的一样：比如长的尾部和第5脚趾具有两个长的趾节等。达尔文翼龙发现于大约1.6亿年的中侏罗世地层中，尖锐而长的牙齿显示它是肉食性动物,而其骨骼结构又显示它几乎肯定地在空中掠食（它在陆地上动作很缓慢，笨拙，表现在长的尾部和脚上第5趾有两节长的趾节等）, 但是其牙齿不像其它翼龙那样吃鱼或者昆虫。它们同时代的会飞行动物，包括不同种类的翼龙，小的、滑翔的哺乳动物-翔兽以及鸽子大小食肉恐龙，它们与达尔文发现于同一层位，因而很可能成为达尔文翼龙的食物。达尔文翼龙可能用它的长有具有尖锐牙齿的上下颌，不是在空中，就是当它快速掠过树枝或树叶时抓住它的食物，非常类似于现在的蝙蝠从树和灌木丛间掠食昆虫。",
                    "src": "./static-2/达尔文翼龙.jpg"
                },
                {
                    "name": "冠龙-五彩冠龙在中国西北的新疆出现",
                    "time": "1.6亿年前",
                    "description": "暴龙科祖先",
                    "src": "./static-2/五彩冠龙在中国西北的新疆出现.jpg"
                },
                {
                    "name": "中华侏罗兽",
                    "time": "1.6亿年前",
                    "description": "最早的真兽类哺乳动物, 伟大的母亲 - 中华侏罗兽化石产自辽宁省建昌县玲珑塔地区距今1.6亿年的侏罗纪髫髻山组，由中国地质科学院地质研究所季强发现，正型标本收藏于北京自然博物馆。其名称含有“来自中国的侏罗纪母亲”之意，代表已知最古老的真兽类哺乳动物化石记录。中华侏罗兽的发现为哺乳动物演化历史建立了一个新的里程碑，将以前的白垩纪记录提前了3500万年。研究表明：中华侏罗兽体重约13克，具有攀爬能力，是一种树上生活的食虫哺乳动物。",
                    "src": "./static-2/中华侏罗兽.jpg"
                },
                {
                    "name": "恐龙多样性达到高峰",
                    "time": "1.5亿年前",
                    "description": "恐龙时代也是地球上其他生物多样性的高峰时期。 除了恐龙外，地球上还有其他史前生物如翼龙、史前鸟类和海生爬行动物等。 这些史前生物在恐龙时代发展繁荣，形成了一个庞大的史前生物群落。 然而，恐龙时代并非一帆风顺。 在白垩纪末期，一次大规模的灭绝事件导致了恐龙的灭绝。 这个事件可能是由于陨石撞击地球、火山喷发或气候变化引起的，具体原因尚不明确。 这次灭绝事件结束了恐龙的统治，使地球进入了新的生物时代。",
                    "children": [
                        {
                            "name": "异特龙",
                            "time": "1.55亿年前",
                            "description": "异特龙是最著名的大型肉食性恐龙之一，占据晚侏罗世陆地生态系统食物链的顶端，其模式种脆弱异特龙由20世纪伟大的美国古生物学家奥斯尼尔.马什于1877年描述命名。它们也是晚侏罗世发现化石数量最多，最广布的掠食者。成年异特龙体长可达9米，有少数个体被认为可以达到12米。虽然不及霸王龙魁梧的体型，但异特龙的身体比例更为匀称，拥有更发达的前肢，显得更为矫健。同时，异特龙的标本数量也要远多于霸王龙，使得它成为被古生物学家研究的最透彻的恐龙之一。由于发掘出的化石数量极为庞大，异特龙已成为莫里逊组的标志性化石物种。",
                            "src": "./static-2/异特龙.jpg"
                        },
                        {
                            "name": "腕龙",
                            "time": "1.5亿年前",
                            "description": "腕龙是侏罗纪时期“腕龙属”恐龙的统称。 [5]体长25米，高15米，重30吨，尾巴粗短，脑袋很小，脖子很长，外形与长颈鹿类似；前脚内侧长有大爪子；颌部发达，上下布满52颗牙齿，牙齿边缘锋利；四肢粗壮；鼻孔长在头顶上。 [6]因前肢较长而得名。 [7]腕龙生活于侏罗纪晚期的北美洲、白垩纪早期的北非。 [8]栖息在充满蕨类、苏铁目及木贼属的草原。 [6]性情温和，喜欢群居生活。 [9]以树叶、嫩枝为食。 [10]常结伴觅食。在行走的过程中，雌性会下蛋。恐龙蛋既没有窝，也没有父母照顾，独自长大。 [11]腕龙是侏罗纪时期体形最为庞大的恐龙之一， [7]是知名恐龙，在电影或电视节目中出镜率很高，如最著名的《侏罗纪公园》以及《与恐龙共舞》《与巨兽共舞》。名字还曾被天文学家拿来给一颗小行星命名。",
                            "src": "./static-2/腕龙.jpg"
                        },
                        {
                            "name": "迷惑龙",
                            "time": "1.5亿年前",
                            "description": "迷惑龙，梁龙科迷惑龙属，包括埃阿斯迷惑龙（A. ajax）、路氏迷惑龙（A. louisae）。 [1]迷惑龙的特点为粗且长的颈部、和又细又长的尾部。迷惑龙曾经一度和雷龙混为一谈，现已证明它们其实是两种不同的恐龙。",
                            "src": "./static-2/迷惑龙.jpg"
                        },
                        {
                            "name": "剑龙",
                            "time": "1.5亿年前",
                            "description": "剑龙是鸟臀目装甲亚目剑龙下目剑龙科剑龙属的动物， [5-6]也叫骨板龙。 [7]脑袋小，嘴的最前端长着像鸟一样的尖喙，喙上没有牙齿，牙分布在嘴的两侧，十分细小。外形健硕，体重可达4吨，前腿生有5个脚趾，后腿3个脚趾；剑龙的前腿稍短，后腿更长也更健壮。 [8]剑龙因身上大大的剑板以及尾巴上尖尖的尾刺是得名。 [9]剑龙分布于中国、美国、英国，生活在侏罗纪中晚期至白垩纪早期。 [9]它们食性为植食性。 [7]因牙齿细小，无法碾磨植物，只能吃一些低矮的苔藓或是蕨类植物。为减轻肠胃消化食物的负担，其也有吞食胃石的习惯。 [10]在繁殖时，雄性剑龙的两排骨板可能会充血，显示出漂亮的颜色，以此来吸引雌性。 [11]剑龙尾巴上有四根锋利的尖刺，可以御敌。 [8]当凶猛的肉食性恐龙发动袭击时，剑龙会调转方向，使骨质板朝向敌人，以吓退对方。若对方依然不放弃攻击的话，剑龙还会挥舞尾巴，用尾巴上的尖刺抽打敌人。 [10]剑龙是一种巨大的长相古怪的恐龙，被人们称为“带屋顶的爬行动物”。",
                            "src": "./static-2/剑龙.jpg"
                        },
                        {
                            "name": "嗜鸟龙",
                            "time": "1.5亿年前",
                            "description": "嗜鸟龙（Ornitholestes hermann）属名意为“偷鸟类者”，种名hermanni是用来纪念美国自然历史博物馆的标本制作人员Adam Hermann。嗜鸟龙是种兽脚亚目恐龙，生存于晚侏罗纪的劳亚大陆西部，为现在的北美洲。对于嗜鸟龙的了解几乎都来自单一个化石，该化石在1900年发现于怀俄明州的科莫崖附近，并由亨利·费尔费尔德·奥斯本（Henry Fairfield Osborn）在1903年所叙述、命名。嗜鸟龙化石，发现于莫里逊组的第2地层带。",
                            "src": "./static-2/嗜鸟龙.jpg"
                        },
                        {
                            "name": "奥斯尼尔龙",
                            "time": "1.5亿年前",
                            "description": "奥斯尼尔洛龙原本是化石龙的一个种，部分化石则先后属于侏儒龙与奥斯尼尔龙（Othniela）。这种混乱的状态，导因于奥塞内尔·查利斯·马什在19世纪后期的化石战争期间，建立了过多的物种。奥斯尼尔洛龙的化石，原本属于化石龙、侏儒龙、奥斯尼尔龙（Othniela），它们通常被认为属于鸟脚下目的棱齿龙类；棱齿龙类是一群小型、敏捷的草食性恐龙，但它们的定义却很模糊。在1990年，罗伯特·巴克（Robert Bakker）等人在同一份研究中，建立了新属德林克龙，并将奥斯尼尔龙分为两个种，雷克斯奥斯尼尔龙（O. rex）、伴侣奥斯尼尔龙（O. consors），并成立奥斯尼尔龙科（Othnieliidae），定位于比棱齿龙科更原始的位置。近期的研究多认为棱齿龙科是个并系群[8][1][9]，而所谓的“奥斯尼尔龙科”，被认为比棱齿龙科更为原始，但没有发现新的德林克龙化石，所以德林克龙的地位有些争议。其他原始鸟脚类恐龙有时也被认为是奥斯尼尔龙，尤其是何信禄龙，何信禄龙曾被一些研究人员归类于多齿奥斯尼尔龙（O. multidens）。新的研究也认为奥斯尼尔洛龙比其他棱齿龙类而原始，但仍属于角足亚目鸟脚下目的范围内。",
                            "src": "./static-2/奥斯尼尔龙.jpg"
                        },
                        {
                            "name": "梁龙",
                            "time": "1.5亿年前",
                            "description": "梁龙是蜥臀目梁龙科梁龙属恐龙。 [6]脖子很长，脑袋很小，鼻孔的位置比眼睛高； [7]嘴的前部长有扁平的牙齿，侧面和后部均无齿；四肢粗壮，前肢短，后肢长；臀部高于前肩；掌部都有5个指（趾）； [8]尾巴比脖子长，逐渐向末端变细，呈鞭子状， [9]中部有10多个人字骨。因人字骨顶端伸出两个突起似双梁而得名双梁龙，通常称梁龙。 [10]梁龙生活于侏罗纪末期的北美洲西部。 [7]群居生活，当本地食物不足时，集体迁徒到远方。 [11]植食性，以树叶和蕨类植物为食。 [9]一只雌性梁龙会在森林边缘产下上百枚梁龙蛋，产卵后离开森林边缘到开阔的平原地带生活，任恐龙蛋自行孵化。 [12]梁龙是目前发现的地球上曾出现过的最长的动物。其化石被大量发现，是人们最熟悉的恐龙之一。 [13]1877年，美国教育家塞缪尔·W·威利斯顿在科罗拉多州峡谷镇附近发现了第一块梁龙化石。化石所处地层的年代为距今1亿4700万年到1亿5600万年的晚侏罗世。",
                            "src": "./static-2/梁龙.jpg"
                        }
                    ],
                    "src": "./static-2/恐龙多样性达到高峰.jpg"
                },
                {
                    "name": "鸟类从兽脚亚目演化出来",
                    "time": "1.5亿年前",
                    "description": "鸟类的演化始于侏罗纪时期，最早的鸟类源自名为近鸟类的兽脚亚目恐龙演化支。[1] 侏罗纪晚期的印石板始祖鸟被认为是最早的鸟类。在6600万年前的大灭绝事件中，至少有四支不同的鸟类幸存下来，分别是古颚类（鸵鸟及其近亲）、齿雁类（鸭子及其近亲）、泛鸡形类（鸡及其近亲）和新鸟小纲（其他鸟类）。",
                    "children": [
                        {
                            "name": "始祖鸟",
                            "time": "1.5亿年前",
                            "description": "始祖鸟属（学名：Archaeopteryx）是始祖鸟科的一个属，是介于有羽毛恐龙和鸟类之间的过渡物种。属的学名即来自古希腊文的ἀρχαῖος（古代）和πτέρυξ（翼），故又名古翼鸟。[3]19世纪末至21世纪初，始祖鸟被普遍认为是最早及最原始的鸟类，但随着比其更古老，构造上也比其更接近现生鸟类的近鸟龙、晓廷龙和曙光鸟相继被发现，始祖鸟在鸟类演化学上的地位已经动摇。因此虽然在现代定义上，始祖鸟仍然属于原始的鸟类，但古生物学家如今已多不将始祖鸟视为现生鸟类的共同直系始祖。[4]始祖鸟生活于约1亿5千万年前的晚侏罗纪，化石分布在德国南部索伦霍芬石灰岩矿床。它的德文名字意指“原鸟”或“首先的鸟”。在始祖鸟仍然生存的时期，欧洲仍然是个接近赤道的群岛。始祖鸟生活于恐龙时代，但是由于与同时拥有鸟类及兽脚亚目的特征，因此与恐龙有所区别。始祖鸟的大小及形状与喜鹊相似，它有着阔及圆的翅膀及长的尾巴。它可以生长达半米长。它的羽毛与现代鸟类相似，但它却在颚骨上有锋利的牙齿，脚上三趾都有弯爪及有长的骨质尾巴。这些特征正好与兽脚亚目恐龙相似，使得始祖鸟成为演化过程的重要角色。事实上，始祖鸟首次的发表是于1862年，亦即达尔文发表《物种起源》之后两年，使有关讨论演化之说更为激烈。现今有12个化石被分类为始祖鸟，是侏罗纪时期不多的羽毛证据之一。由于它们拥有进步的性状，可见它们的起源应当更早。[5]所有遗骸多被认为是来自独立的标本。-----描述 : 8个始祖鸟标本与人类外形尺寸比较。始祖鸟曾经被认为是鸟类的祖先，并生活于侏罗纪的提通阶早期。这些标本都只在德国境内发现。[6]始祖鸟约为现今鸟类的中型大小，有着阔及于末端圆形的翅膀，并比体型较长的尾巴。整体而言，始祖鸟可以成长至0.5米长。它的羽毛（比起其他特征来说证据较少）与现今鸟类羽毛在结构及设计上相似。[6]但是除了一些与鸟类相似的特征外[7]，它有着很多兽脚亚目恐龙的特征。不像现今鸟类，始祖鸟有细小的牙齿[6]可以用来捕猎昆虫及其他细小的无脊椎生物。始祖鸟亦有长及骨质的尾巴，及它的脚有三趾长爪，与恐龙极为相似。由于始祖鸟有着鸟类及恐龙的特征，始祖鸟一般被认为是它们之间的连结：可能是第一种由陆地生物转变成鸟类的生物。[6]1970年代，约翰·奥斯特伦姆指鸟类是由兽脚亚目恐龙演化而来，而始祖鸟就是当中最重要的证据。它保有一些鸟类的特征，例如叉骨、羽毛、翅膀及部分相反的首趾。它亦有一些恐龙特征，例如长的距骨升突、齿间板、坐骨突及人字形的长尾巴。奥斯特伦姆亦发现始祖鸟与驰龙科很显著地相似。始祖鸟的首个遗骸是在达尔文发表《物种起源》之后两年的1862年发现。始祖鸟的发现似乎确认了达尔文的理论，并从此成为恐龙与鸟类之间的关系、过渡性化石及演化的重要证据。事实上，在戈壁沙漠及中国就恐龙的进深研究提供了更多证据有关始祖鸟与恐龙的关系，例如长有羽毛的恐龙。始祖鸟较接近现今鸟类的祖先，因它有着很多鸟类的特征；因它与当时鸟类的分歧程度仍有疑义。-----古生物学 : -----羽毛 : 印石板始祖鸟的模型。始祖鸟的标本最值得注意的是它那已发展的飞羽。它们是不对称的及有着现今鸟类飞羽的结构，翼片由羽支—小羽枝—羽纤支的排列来提供平衡。尾巴羽毛则较小不对称，且与现今鸟类相似及有着坚固的翼片。拇指却没有独立的小翼羽。始祖鸟的体羽并没有很多资料，而当中只有柏林标本曾被适当的研究。由于涉及多个物种，只有柏林标本的研究则并不能完全代表所有始祖鸟的品种。柏林标本在脚上有已发展的羽毛，这些羽毛只显示了基本的轮廓，而有些则已被分解了（就像平胸总目缺乏羽纤支）[8]，但就部分而言是坚实的及可以支撑飞行。[9]但其背部有一缀正羽，与现今鸟类体羽的正羽一样成对称及坚实，但却不及与飞行有关的羽毛硬。除此之外，柏林标本的羽毛就像中华龙鸟的一样，出现分解及绒毛现象，而其在生时较似毛皮多于羽毛（但在显微镜下的结构并不是）。在身体的其他部分（只限于保存下来及没有重组的部分），及低颈部亦出现同样情况。[8]始祖鸟在上颈部及头部并没有显示有羽毛。虽然这可能以为它的头部是裸的，就像其近亲的长有羽毛的恐龙一样，但是这可能是因保存时所造成的。大部分始祖鸟标本都是在经过一些时间在海面上漂浮而嵌入在缺氧的泥沙中，它的头颈部及尾巴一般都是长下倾。当嵌入后开始腐化时，筋腱及肌肉已经放松形成了化石标本的形状。即是皮肤已经软化及松开，有些标本的飞羽在嵌入开始时已经分开。所以有假说指标本在浅水处沿海床移动一些时间才被埋葬，头部及上颈部羽毛脱落，而较坚实的尾巴羽毛则仍然保存。[10]2011年，对1861年在德国巴伐利亚州的石灰岩中发现的始祖鸟羽毛化石（飞羽）的色素承载结构大小与形状的分析，显示始祖鸟的部分羽毛是黑色的[1][11][12] 。-----飞行 : 就如现今鸟类的翅膀，始祖鸟的飞羽是高度的不对称，而尾巴羽毛是较为阔的。这显示翅膀及尾巴是用来产生升力。但是始祖鸟究竟是纯粹的滑翔或是能够鼓翼而飞则是未可知的。在缺乏胸骨的情况下，可见始祖鸟并非强壮的飞行者，但飞行肌肉可能是连于厚及回力镖状的叉骨、板状的鸟喙骨、或是软骨质的胸板。而肩胛骨、鸟喙骨及肱骨之间关节窝的向旁侧定位（并非现今鸟类背部起角的排列），可见始祖鸟并不能将翅膀提升至背后，而未能达至鼓翼上升的要求。因此，它似乎并不能如现今鸟类般鼓翼飞行，但它可能利用向下鼓翼滑翔的技巧。[13]始祖鸟翅膀是相对的大，造成较低的失速空速及缩小了的转弯半径。短及圆的翅膀形状会增加拖曳力，但却会改良了始祖鸟在杂乱的环境下（如树林及丛林）飞行，而相似的翅膀形状可以在穿越树林及丛林的鸟类，如乌鸦及雉鸡中发现。脚部不对称的飞羽（像小盗龙的）就仿佛是一对尾翼，可以帮助增加空中运动性。首个就尾翼作出研究指其结构形成总翼剖面的12%。虽然这些尾翼支撑飞行的能力的程度并不清楚，但这可以额外分别减少失速空速及转弯半径达6%及12%。[9]于2004年，科学家就替始祖鸟的脑壳进行详尽的X射线断层成像分析，总结了它的脑部比大部分恐龙都要明显的大，显示它有着足够的脑部大小进行飞行。整体脑部构造亦由断层成像进行重组。重组显示涉及视觉的区域占接近脑部的三分一。其他的区域则是关于听觉及肌肉控制。[14]头颅骨成象亦发现内耳的结构。这个结构与现今鸟类的内耳结构较爬虫类的更为相似。这些特征综合起来指始祖鸟有飞行所需的敏锐听觉、平衡、空间感及调控能力。[15]始祖鸟在讨论有关鸟类起源及演化上仍然占有重要的地位。一些科学家视它为半攀树动物，这是因鸟类是由树上居住的动物演化而来的观念（即奥塞内尔·查利斯·马什（O.C. Marsh）所建议的“飞行是因树木倒下演化而来”的假说）。其他科学家则视始祖鸟为在地上快跑的动物，是因认为鸟类是由奔跑演化成飞行（即赛缪尔·威利斯顿（Samuel Wendell Williston）建议的由陆地而上的假说）。仍有其他的建议始祖鸟可能是同时住在树上及陆地上，就像现今的乌鸦，而这个建议是在形态学上最为受到支持的。综合来说，始祖鸟是一种并非专门在陆地上奔跑或暂住的动物。考虑已知有关飞行的形态，始祖鸟被认为主要是利用翅膀来逃避捕猎者，如在浅水面上滑行到达安全的地方，或是由峭壁或树梢俯冲至更远的地方等。[10]已知兽脚亚目有几个血统独立地演化成羽毛及飞行，而始祖鸟的祖先是否懂得飞行已经失去了重要性。由于始祖鸟似乎是属于与今鸟亚纲没有关系的鸟类血统，它的飞行能力可能仍是讨论的焦点，但却并非就现今鸟类祖先所讨论的项目。",
                            "src": "./static-2/始祖鸟.jpg"
                        }
                    ],
                    "src": "./static-2/鸟类从兽脚亚目演化出来.jpg"
                },
                {
                    "name": "白垩纪",
                    "time": "1.45-0.66亿年前",
                    "description": "恐龙巅峰 - 白垩纪（英语：Cretaceous Period）是地质年代中中生代的最后一个纪，开始于1.45亿年前，结束于6600万年前，历经7900万年，是显生宙的最长一个阶段 [1] [12]。白垩纪是在1822年由比利时地质学家Jean d'Omalius d'Halloy研究巴黎盆地时所提出。白垩纪因欧洲西部该年代的地层主要为白垩沉积而得名。白垩纪位于侏罗纪和古近纪之间，BC1亿4500万年（误差值为400万年）前至6500万年前（误差值为30万年）。白垩纪–第三纪灭绝事件是地质年代中最严重的大规模灭绝事件之一，包含恐龙在内的大部分物种灭亡。发生在白垩纪末的灭绝事件，则成为中生代与新生代的分界。白垩纪时期，大陆被海洋分开，地球变得温暖、干旱。白垩纪，是最大的恐龙出现时期，许多新的恐龙种类开始出现，恐龙仍然统治着陆地，翼龙在天空中滑翔，巨大的海生爬行动物统治着浅海。最早的蛇类、蛾、蜜蜂以及许多新的小型哺乳动物也出现了。被子植物也出现于此时期。",
                    "src": "./static-2/白垩纪.jpg"
                },
                {
                    "name": "中华龙鸟",
                    "time": "1.40亿年前",
                    "description": "第一只鸟起飞的地方 - 中华龙鸟是一种发现于中国的美颌龙类。和大多数美颌龙类一样，中华龙鸟的体型十分娇小。依据正型标本估计，它的体长约为1米左右。中华龙鸟在发现之初由于身披丝状羽毛，一度被认为与鸟类有着非常近的亲缘关系，被认为是解决鸟类起源的关键物种。不过以现在的相关研究来看，中华龙鸟所属的美颌龙类是手盗龙形类中最为原始的一支，与鸟类的亲缘关系较远。即便如此，中华龙鸟的发现也是具有里程碑式的意义的，它是第一件被报道的长羽毛的恐龙化石，它使古生物学家逐渐意识到非鸟类兽脚类恐龙也可以拥有鸟类的特征。",
                    "src": "./static-2/中华龙鸟.jpg"
                },
                {
                    "name": "被子植物演化出花朵",
                    "time": "1.30亿年前",
                    "description": "被子植物的花朵结构经过长时间的演化，形成了各种各样的花型和花色，这些特点有助于吸引授粉昆虫，进而实现繁殖。 在一些海岛和沙漠地区，一些被子植物已经形成了独特的花朵结构和传粉方式，以适应当地的特殊环境。 总的来说，被子植物的演化与适应环境之间存在着紧密的关系。 在长期的演化过程中，被子植物通过适应环境，逐渐形成了各种适应性特征，这些特征使得被子植物在各种自然条件下能够生存并繁衍。",
                    "src": "./static-2/被子植物演化出花朵.jpg"
                },
                {
                    "name": "辽宁古果",
                    "time": "1.25亿年前",
                    "description": "第一朵花盛开的地方 - 辽宁古果Archaefructus liaoningensis Sun et al.属于古果科Archaefructaceae（该科包括辽宁古果和中华古果两种化石植物）。它们的生存年代为距今 1亿2500万年的中生代，比以往发现的被子植物早1500万年，被国际古生物学界认为是迄今最早的被子植物，就此为全世界的有花植物起源于辽宁西部提供了有力的证据。从辽宁古果化石表面上看，化石保存完好，形态特征清晰可见。",
                    "src": "./static-2/辽宁古果.jpg"
                },
                {
                    "name": "现今有胎盘哺乳动物的祖先攀援始祖兽出现",
                    "time": "1.25亿年前",
                    "description": "攀援始祖兽，兽亚纲始祖兽属动物，发现于辽宁凌源。攀援始祖兽化石拉丁文学名的含义：Eo-（希腊文意为原始古老）；-maia（希腊文意为母亲）：Eomaia暗示了这个新发现的哺乳动物化石在真兽—有胎盘类哺乳动物的演化系统上处于最原始的位置；scansoria（希腊文意为攀登）意味着这个真兽类哺乳动物具有可能灵活攀援的肢骨特征。",
                    "src": "./static-2/现今有胎盘哺乳动物的祖先攀援始祖兽出现.jpg"
                },
                {
                    "name": "鲨齿龙",
                    "time": "1.25亿年前",
                    "description": "鲨齿龙属下目前包含两个物种，分别为撒哈拉鲨齿龙和伊吉迪鲨齿龙。鲨齿龙生活于晚白垩世塞诺曼期的北非。鲨齿龙与同属于异特龙类的魁纣龙，马普龙，南方巨兽龙有着非常近的亲缘关系。鲨齿龙的体型非常巨大，与霸王龙相似，甚至可能更大。鲨齿龙生活在一个巨兽横行的时代，同时代的巨兽还包括15米长的棘龙，9米的皱褶龙，以及身长30米以上的蜥脚类潮汐龙，水中也潜伏着12米的帝鳄。鲨齿龙很可能以同时代的巨型蜥脚类为食。",
                    "src": "./static-2/鲨齿龙.jpg"
                },
                {
                    "name": "小盗龙",
                    "time": "1.25亿年前",
                    "description": "小盗龙是一种发现于中国辽宁的小型兽脚类恐龙，属于廓羽盗龙类中的驰龙类，与鸟类有着非常近的亲缘关系。目前，该属下有三种，包括模式种赵氏小盗龙，归入种顾氏小盗龙和汉卿小盗龙。其中，赵氏小盗龙可能是目前最小的兽脚类恐龙之一。小盗龙的化石收藏量也非常巨大，除了正式发表的标本以外还包括约300件未发表的标本。小盗龙全身都披有羽毛，四肢上还具有不对称的正羽。小盗龙的发现证实了非鸟类恐龙与鸟类具有非常近的亲缘关系，且在这一演化过程中可能经过一段四翼飞行的状态。",
                    "src": "./static-2/小盗龙.jpg"
                },
                {
                    "name": "千禧中国鸟龙出现",
                    "time": "1.23亿年前",
                    "description": "在中国鸟龙的标本周围岩石都发现了羽毛的痕迹。这些羽毛痕迹由丝状物所构成，并具有两个特征显示它们是早期的羽毛。第一，数个丝状物聚合成一丛，类似羽毛的结构。第二，一排羽毛聚合成一个羽轴，类似正常鸟类的羽毛结构。然而，中国鸟龙的羽毛并没有现代鸟类羽毛所具有的次要分支与小型羽支，这些特征可形成现代鸟类的分散羽片。除了羽毛以外，中国鸟龙可以拍打它们的手臂，它们是最早发现拥有类似鸟类肩带的恐龙之一。中国鸟龙也拥有类似鸟类的骨盆与后肢，以及非常长的手臂。“Dave”（编号NGMC - 91）的羽毛覆盖了整副身体，包含了眼睛前方的头部、颈部、前肢、大腿，尾巴末端则有菱形羽块，类似始祖鸟。 [1]中国鸟龙的发现支持了鸟类飞行的“从地面起飞”理论。而“从树上滑翔”理论则假设鸟类是从树栖恐龙演化而来，这些树栖恐龙从树枝间滑翔移动。另一方面，“从地面起飞”理论则假设鸟类从奔跑恐龙演化而来，这些奔跑恐龙的羽毛具有隔热作用，或是求偶的展示物。然而，四翼恐龙小盗龙的发现，显示原本的鸟类演化理论过度单纯化，不同的近鸟类恐龙同时发展出“从地面起飞”与“从树上滑翔”的演化模式，并各自拥有相对应的生活方式。",
                    "src": "./static-2/千禧中国鸟龙出现.jpg"
                },
                {
                    "name": "森林翼龙在中国辽宁出现",
                    "time": "1.20亿年前",
                    "description": "在距今约1.2亿年前的 白垩纪早期，有一群玲珑小巧的森林翼龙在现今中国辽宁省的上空飞翔着，完全没有空中霸主的卓越风姿，远远望去，还以为是小燕子在飞呢。 但是它们却是之后的大型 鸟掌翼龙 类的祖先。 由于体型娇小的优势，森林翼龙会很容易地隐藏在树丛之间，借以躲开大型动物的捕捉。 于是渐渐地，这支体态娇小的族群随着时间的流逝，慢慢演化成能够统治天空庞然大物",
                    "src": "./static-2/森林翼龙在中国辽宁出现.jpg"
                },
                {
                    "name": "帝龙",
                    "time": "1.20亿年前",
                    "description": "早期暴龙",
                    "src": "./static-2/帝龙.jpg"
                },
                {
                    "name": "阿普第阶灭绝事件",
                    "time": "1.17-1.16亿年前",
                    "description": "阿普第阶灭绝事件 （Aptian extinction）是个发生于 白垩纪 早期的小规模灭绝事件，年代为约1亿1700万年前到1亿1600万年前，大约是 阿普第阶 中期。 根据地层中的证据，阿普第阶灭绝事件对海洋生物造成较大的影响，对陆地生物则较小 [1]。 位于 印度 孟加拉 地区的Rahjamal暗色岩火山爆发，可能是阿普第阶灭绝事件的原因。",
                    "src": "./static-2/阿普第阶灭绝事件.jpg"
                },
                {
                    "name": "棘龙",
                    "time": "1.14亿年前",
                    "description": "棘龙是一种大型兽脚类恐龙，拥有着比肩霸王龙和南方巨兽龙的体长。棘龙属下目前仅有一有效种，即埃及棘龙，由德国古生物学家斯特罗默于1915年命名 [1]。由于长相奇特，加上体型巨大，棘龙受到的关注不少于霸王龙。可惜的是，棘龙的正型标本在二战时期被炸毁。长期以来，古生物学家对于棘龙的认知都只停留在正型标本的照片和少数的化石碎片上。随着近几年化石证据的逐渐增多，棘龙真实的形象才浮出水面。近几年的新化石标本以及定量研究显示，棘龙的身体结构高度特化，是一种水性很好的恐龙。这些研究不仅使科学家弄清了棘龙的身世，同时使人们认识到，在中生代时期，恐龙不止是陆地上的霸主，在水中也有它们的一席之地。",
                    "src": "./static-2/棘龙.jpg"
                },
                {
                    "name": "波塞冬龙",
                    "time": "1.1亿年前",
                    "description": "波塞东龙生存于墨西哥湾的海岸，墨西哥湾的海岸在当时侵入到奥克拉荷马州一带，形成巨大的三角洲，类似今日的密西西比河三角洲。这个地区在当时可能没有掠食动物可以攻击完全成长的波塞东龙个体，但肉食龙下目的高棘龙（体型较小于暴龙）与以群体行动的恐爪龙可能以幼年波塞东龙个体为猎物。在2004年，德恩·奈许（Darren Naish）与他的同事叙述了一只巨大腕龙科恐龙，该恐龙发现于早白垩纪的英格兰，并类似于波塞东龙。该腕龙科恐龙仅发现两个颈椎，在某些细节明显地类似波塞东龙，而它们可能在体型上相似。该腕龙科恐龙的发现突显了早白垩纪时期北美洲与欧洲恐龙的相似。",
                    "src": "./static-2/波塞冬龙.jpg"
                },
                {
                    "name": "帝鳄出现",
                    "time": "1.1亿年前",
                    "description": "帝鳄化石的发现始于20世纪40年代到50年代。 首批帝鳄的化石是由法国古生物学家艾伯特·法布尔在尼日尔的撒哈拉沙漠发现的。 对你没看错，撒哈拉沙漠以前并非一片死地。 相反 在白垩纪时期，这里是个热带平原，有许多河流和湖泊的存在，帝鳄就生存在这些水域之中。 帝鳄的巨大体型使其成为白垩纪早期非洲地区水域的顶级掠食者。",
                    "src": "./static-2/帝鳄出现.jpg"
                },
                {
                    "name": "鲨齿龙及南方巨兽龙出现",
                    "time": "1.00亿年前",
                    "description": "南方巨兽龙属下仅有一种，为卡氏南方巨兽龙，是一种发现于阿根廷的大型兽脚类恐龙，生存年代为晚白垩世塞诺曼期，约距今9700万年前。南方巨兽龙属于异特龙超科中的鲨齿龙类，并且很有可能是地球历史中体型最大的陆地掠食动物。与霸王龙相比，南方巨兽的样本量很小，且大个体标本的完整度很差，因此对其体型的准确估计有相当的难度。它与霸王龙相比谁的体型更大也是学术界一直在争论的话题。",
                    "src": "./static-2/鲨齿龙及南方巨兽龙出现.jpg"
                },
                {
                    "name": "阿根廷龙",
                    "time": "1.00亿年前",
                    "description": "阿根廷龙属于蜥脚类恐龙的泰坦龙类， 命名十分简单， 意思是在阿根廷发现的恐龙。生存年代： 1亿年前白垩纪中期阿尔布阶-9300万年前白垩纪晚期森诺曼阶。是发现的最大的陆地恐龙之一。",
                    "src": "./static-2/阿根廷龙.jpg"
                },
                {
                    "name": "南方巨兽龙",
                    "time": "9800万年前",
                    "description": "南方巨兽龙属下仅有一种，为卡氏南方巨兽龙，是一种发现于阿根廷的大型兽脚类恐龙，生存年代为晚白垩世塞诺曼期，约距今9700万年前。南方巨兽龙属于异特龙超科中的鲨齿龙类，并且很有可能是地球历史中体型最大的陆地掠食动物。与霸王龙相比，南方巨兽的样本量很小，且大个体标本的完整度很差，因此对其体型的准确估计有相当的难度。它与霸王龙相比谁的体型更大也是学术界一直在争论的话题。",
                    "src": "./static-2/南方巨兽龙.jpg"
                },
                {
                    "name": "马普龙",
                    "time": "9700万年前",
                    "description": "马普龙无疑是非常巨大的，其体型与它的近亲南方巨兽龙相仿。在对正型标本描述的过程中，研究人员发现马普龙较大的骨骼标本接近南方巨兽龙对应部位的标本大小，于是粗略的估计了马普龙的体长大约在12米左右 [1]。古生物学家托马斯.霍兹在他的研究中估计马普龙的体型大约在12.6米 [2]。而另外一项研究则认为马普龙的体型略小于南方巨兽龙，体长约11.5米，重5吨. 发现马普龙化石的乌因库尔组整体环境偏干燥，但是会有季节性的溪流出现。与马普龙生存在同一地区的恐龙还包括属于泰坦巨龙类的阿根廷龙和乔冈龙，驰龙类的鹫龙，以及属于阿贝力龙类的蝎猎龙和肌肉龙 [4]。马普龙的多件标本在一个骨床里被发现，里面至少包括了7件处于不同个体发育阶段的标本 [5]。这种不同年龄段的个体在同一地区被一同发现的情况也见于其它大型兽脚类恐龙，这其中包括马普龙的远亲异特龙，以及更晚出现的大型暴龙类惧龙和艾伯塔龙。古生物学家认为多个处于不同年龄段的个体在同一地区被发现显示马普龙可能存在群体狩猎的行为。群体狩猎可以增加狩猎的成功率，尤其是在对付诸如阿根廷龙这样的大型猎物的时候。成年阿根廷龙体长约40米，犹如一座移动的肉山，即使是成年的马普龙单独狩猎这种巨型猎物也是十分危险的。",
                    "src": "./static-2/马普龙.jpg"
                },
                {
                    "name": "崖蜥下海",
                    "time": "9500万年前",
                    "description": "中生代最后一支大型海爬掠食者",
                    "src": "./static-2/崖蜥下海.jpg"
                },
                {
                    "name": "森诺曼期 - 土仑期灭绝事件",
                    "time": "9400万年前",
                    "description": "又称森-土灭绝事件, OAE2等 - 森诺曼期土伦期灭绝事件，就是通常所称的土伦阶灭绝事件。该灭绝事件发生在9300~9400万年前，由于发生了意外事件，导致整个海洋处于缺氧状态，以致于海洋当中的所有生物都灭绝了。生物学家们经过广泛的调查，仍然没有调查清楚导致灭绝的原因。但科学家们发现了处于那个时代的岩层标本，标本中发现了许多本不属于那里的沉积物。",
                    "src": "./static-2/森诺曼期 - 土仑期灭绝事件.jpg"
                },
                {
                    "name": "鱼龙灭绝",
                    "time": "9400万年前",
                    "description": "鱼龙的灭绝受到不稳定气候和演化速度减缓的驱使。此前曾有研究提出，是其他海洋爬行动物的增加或食物资源的减少导致鱼龙提早灭绝。但近来的研究显示，鱼龙在灭绝前几百万年依然有丰富的物种多样性，而致使其消失的原因却不清楚。英国牛津大学Valentin Fischer团队采用基于系统发生学的方法，估计了鱼龙随时间推移多样性的变化，并对诸如海洋化学和海平面高度等环境数据进行了比对。研究人员发现，鱼龙在白垩纪早期的种类一直高度多样化，但其演化速率逐渐减缓。研究数据支持气候变化是海洋生态系统变化主要驱动力的观点，不支持鱼龙是被其他海洋爬行动物和鱼类打败的假说",
                    "src": "./static-2/鱼龙灭绝.jpg"
                },
                {
                    "name": "剑射鱼",
                    "time": "9000万年前",
                    "description": "剑射鱼是乞丐鱼目乞丐鱼科剑射鱼属鱼类。体长4.3-5.1米，呈流线形；尾鳍强劲有力；齿呈利刃状； [4]颌部向上翘起。背部深蓝黑色，腹部银亮色。因为它的胸鳍有像剑一样的鳍条而得名。 [5]剑射鱼分布于北美洲、大洋洲、欧洲。 [4]栖息于大洋中。游泳速度可以达到或超过当时海洋里的任何生物，能够凭借高速游泳的巨大动能跃出水面。 [6]主要以大型鱼类为食，也捕食海鸟。 [4]剑射鱼生活于约8700万-6500万年前的白垩纪， [4]是一种非常凶猛的海洋动物， [7]高效率的掠食者。它很可能会用分叉的尾巴猛地一下把猎物击晕，还可能会跃出水面来驱除身上的寄生物。 [5]然而它并不是无敌的，一旦受伤，它那巨大的尺寸就意味着很容易被发现，并成为鲨鱼的牺牲品。",
                    "src": "./static-2/剑射鱼.jpg"
                },
                {
                    "name": "恐蛇",
                    "time": "8980万年前",
                    "description": "恐蛇属（学名：Dinilysia）是一属已经灭绝的泛蛇类，生存于白垩纪晚期（科尼亚克阶），分布于南美洲，其化石于阿根廷被发现。特征:与真足蛇相对，恐蛇身体已经完全没有足部，而且颚骨宽松，能吞下大型的食物。其形态与现代蛇类已颇为接近。 恐蛇（Dinilysia）是脊索动物门、蜥形纲、恐蛇科、恐蛇属的动物，已灭绝，生存于白垩纪晚期（科尼亚克阶），分布于南美洲，其化石于阿根廷被发现。恐蛇具有矮扁的脑壳、骨板、颚结构和方骨及活动性很强的颞颥部。其颚肌肉提供很大的附着部，典型体长为3米。",
                    "src": "./static-2/恐蛇.jpg"
                },
                {
                    "name": "印度及马达加斯加大陆分裂",
                    "time": "8800万年前",
                    "description": "印度板块形成于九千万年以前的白垩纪，原来位于南半球，自非洲东部的马达加斯加分离，每年向北漂移15厘米，大约在五千到五千五百万年以前的新生代的始新世时期和欧亚板块碰撞拼合，主要缝合带在喜马拉雅-雅鲁藏布江一带。 这一时期，印度板块移动了约二千到三千公里距离，比已知的任何板块移动的速度要快。",
                    "src": "./static-2/印度及马达加斯加大陆分裂.jpg"
                },
                {
                    "name": "无齿翼龙",
                    "time": "8800万年前",
                    "description": "无齿翼龙是种会飞的爬行动物，它们不是恐龙。它们几乎没有尾巴，躯干很小。无齿翼龙也许会有皮毛，但是不会有羽毛。它们有个大脑袋，它们的视力非常好。无齿翼龙没有牙齿。无齿翼龙能够扇动它们的翅膀飞翔，而且还能飞很长的距离。无齿翼龙是是白垩纪晚期的翼龙类，一种飞行的爬行动物，而恐龙则是陆上的动物。无齿翼龙大约如火鸡一样，体重大约15千克，但是它的身长大约有1.8米，两翼开展约8.2米。它或许较常滑翔而非飞行，而且有可能滑降水面觅食鱼类。某些证据显示无齿翼龙体覆轻毛，有可能为温血动物。有些小型的无齿翼龙比麻雀还要小；而最大型的两翼开展可达12米。它们或许须要利用热气流上升以顺势抬举离地飞翔。无齿翼龙因为头上的冠饰而著名。冠饰可能用于求偶时的炫耀，或作为方向舵用，或者两者都有。也有科学家认为头冠可以在飞行时保持身体的稳定。有论点认为雄性的冠饰较大，但只靠化石是很难分辨出冠饰形状代表什么性别或是哪些物种。翼手龙类的一种。翼展7~9米，头部巨大，喙很长，喉颈部有皮囊，嘴里完全无牙齿，可能像现在的鹈鹕一样用大嘴吞食鱼类。也许是为了取得头部的平衡，头顶上有一个大大的向后伸出的骨冠。这种翼龙不能长时间的振翅飞行，要借助高空气流滑行飞越海洋。休息时，可能像蝙蝠那样用后肢倒挂在树枝上，也能收拢翅肢用四肢在地面作短距离爬行。生活习性:无齿翼龙已知以鱼类为食；曾在一个无齿翼龙化石的胃部位置发现鱼骨头化石，而在另一个无齿翼龙化石的嘴部，发现了已化石化的鱼类食糜。无齿翼龙的翼形状显示它们可能以类似现代信天翁的方式飞行，借由上升热气流来滑翔。这个论点是根据无齿翼龙有高长宽比（9:1），类似信天翁的比例（8:1）。信天翁将大部分活动时间利用在海洋上捕食鱼类，凭借气流和涡流的动力在空中动力滑翔，而不需要拍打翅膀，而不必借助海面上缺乏的上升气流。然而，其他科学家认为无齿翼龙可以拍打它们的翼，用它们的力量飞行。它们使用大而轻的翼，进行长距离飞行。无齿翼龙等翼龙类可能可采动力滑翔飞行，也可利用上升气流来拍打飞行。近年的翼龙类风洞测试，将翅骨（Pteroid bone）保持在朝向前外下侧的姿势，以支撑者大型的前膜，测试证明前翼能产生相当高的升力，即使在高攻角的姿势也一样。与现代鸟类相比，翼龙类的胸骨脊较小，胸骨脊是胸肌的附着处。但翼龙类独有的翅骨，使翼龙类可采动力飞行。无齿翼龙在地面移动时，是采四足方式还是二足方式，曾经是过去争论的主题之一。因为发现了数个翼龙类的足迹，大多数翼龙类研究人员认为无齿翼龙是采四足方式；某些近年的研究则认为无齿翼龙是采二足方式。在Bennett在2001的研究，以及Bramwell与Whitfield的研究里，曾短暂讨论过无齿翼龙游泳的可能性，在密歇根州立大学正进行一项借由形态度量学量化的研究无齿翼龙游泳的可能性。",
                    "src": "./static-2/无齿翼龙.jpg"
                },
                {
                    "name": "玛君龙",
                    "time": "8800万年前",
                    "description": "玛君龙（Majungasaurus crenatissimus）是一种发现于马达加斯加的中大型阿贝力龙类，体长可达7-8米。其生存年代为晚白垩世，是马达加斯加岛的末代皇帝，主要捕食当地的蜥脚类恐龙，如拉佩托龙。玛君龙的头部具有角状冠饰和很多褶皱状结构，使得古生物学家曾经把它的化石碎片误认为属于肿头龙类。玛君龙拥有较好的标本收藏，这使得它成为被研究的最详细的南半球恐龙。",
                    "src": "./static-2/玛君龙.jpg"
                },
                {
                    "name": "蜥脚下目、鸭嘴龙科、角龙科及兽脚亚目很多恐龙种类出现",
                    "time": "8000万年前",
                    "description": "蜥脚类恐龙是脊索动物门，脊椎动物亚门，蜥形纲，蜥臀目蜥脚形亚目的一群恐龙。如果时光倒流1.5亿年，那时陆地上的统治者就是巨大恐龙群，其中的主角则是有100多个种类的蜥脚类恐龙（属于蜥臀目）。蜥脚类恐龙中身长最大的超过30米，有很长的颈和尾，粗壮的四肢支撑着如大酒桶般的身躯。 当时，虽然陆地上的生命已出现了4亿年，但是除了蜥脚类恐龙之外，陆生动物中没有身长超过20米的。新蜥脚类恐龙——蜥脚类恐龙的晚期演化分支的起源区域可能为亚洲和北美地区，阔鼻龙类恐龙的起源区域可能也为亚洲和北美地区，时代为中侏罗世早期。同时，通过分支系统分析，也表明大山铺龙的分类位置不仅为最早分异的阔鼻龙类恐龙，也是最早分异的新蜥脚类恐龙，因此综合推测新蜥脚类恐龙的起源区域很可能为亚洲",
                    "src": "./static-2/蜥脚下目、鸭嘴龙科、角龙科及兽脚亚目很多恐龙种类出现.jpg"
                },
                {
                    "name": "伶盗龙",
                    "time": "7500万年前",
                    "description": "伶盗龙（学名：Velociraptor）是蜥臀目驰龙科伶盗龙属恐龙， 又名伶盗龙、速龙。 全身上下覆盖着羽毛； 身形不大，大小与火鸡类似；头部很长，脑袋占身体比重很大； 嘴狭长扁平； 牙齿锋利，边缘呈锯齿状；前肢较大，且灵活；后肢结实； 后足上有四根脚趾，内侧第二根脚趾上的利爪粗而弯曲， 呈镰刀状；尾长，长度占体长的一半以上，尾骨呈“S”状水平弯曲。迅猛龙生活在白垩纪晚期的亚洲的中国、蒙古。 [1] [7-8]喜群居。 [9]肉食性动物， [1]以猎食小型恐龙、恐龙蛋、恐龙幼仔和小型哺乳动物为主。 [10]迅猛龙因行动敏捷，被称为“快速的强盗”。 [11]1924年，著名古生物学家奥斯本在蒙古国发现了其化石，是第一种在亚洲发现的驰龙类恐龙。 [12]此外，1971年，化石标本“搏斗中的恐龙”被波兰探险队发现，此化石标本因此被蒙古视为国家级宝藏。",
                    "src": "./static-2/伶盗龙.jpg"
                },
                {
                    "name": "伤齿龙",
                    "time": "7500万年前",
                    "description": "大脑比例最大的恐龙 - 特征:伤齿龙是种小型恐龙，身长约2米，高度为1米，重达60公斤。伤齿龙拥有非常修长的四肢，显示它们可以快速奔跑。伤齿龙拥有长手臂，可以像鸟类一样往后折起，而手部拥有可作出相对动作的拇指。它们的第二脚趾上拥有大型、可缩回的镰刀状趾爪，这些趾爪在奔跑时可能会抬起。因为这些特征，科学家们认为伤齿龙属于手盗龙类。伤齿龙拥有大型眼睛，显示可能有夜间行动，可能以夜间行动的哺乳动物为食；而且眼睛的方向稍微往前，使伤齿龙拥有深度知觉。事实上伤齿龙的眼睛比其他大部分恐龙还要朝向前方，显示伤齿龙有比其他恐龙更好的深度知觉。它们轻型头颅骨的脑囊类似某些外表类似鸵鸟的恐龙的脑囊。与身体相比，伤齿龙的脑袋是恐龙中最大之一。因此伤齿龙被认为是最有智能的恐龙之一。曾经在蛋巢中发现过伤齿龙的恐龙蛋。 [3]-----分布:伤齿龙的化石被发现于蒙大拿州的朱迪斯河组与地狱溪组及双麦迪逊组、亚伯达省的马蹄峡谷组、以及阿拉斯加州的北坡（North Slope）地区。还有一些证据显示伤齿龙较常生活在寒冷的地区，它们似乎在北部地区特别繁盛，以及较寒冷的时期，例如早马斯特里赫特阶。 [4]这些化石来自于相隔数千公里远的地点，而且是在各大陆分隔数百万年之后出现，似乎不可能代表伤齿龙属的同一个种。然而，需要进一步的研究与更多化石才能理解伤齿龙到底有几个种。-----巢穴:1978至1984年间，约翰·霍纳(John Horner)和同事鲍勃·马凯拉(Bob Makela)在蒙大拿山区进行挖掘，发现了三处恐龙巢穴遗迹，包括一窝排列整齐的伤齿龙(Troodon)蛋。伤齿龙把卵产在刚干涸的湖底或沼泽地的湿润泥土里，靠输卵管向下蠕动的力量能轻松地把它们深深插入泥土中。而生活在中国的白垩纪伤齿龙则是选择水边的沙土地作为产卵地点，它们先用爪子在地上刨出一个坑，然后蹲坐下来使身子成直立或半直立状态，并把蛋产入蛋坑里松软的沙土中。之后再用沙土小心的把这些蛋埋起来。它们还会孵蛋。 [5]-----智慧:伤齿龙——最有智慧和最强壮的恐龙之一，是能将哺乳动物进化减慢百万年的食肉动物！在脑容量与体型相比较下，具有恐龙中最大的脑袋。这可能指示他们是白垩纪最晚期是最聪明的一群。有些科学家甚至认为它可能和鸵鸟智商相近，那将比现生的任何爬行动物都要聪明。袋鼠的IQ大约在0.7。而伤齿龙的IQ高达5.3！好家伙，真是高智力啊。伤齿龙可能和今天鸟类的智力相似。今天的鸟类极为聪明：最聪明的鸟能训练开一些玩笑甚至模仿人类的语言。加拿大古动物学家戴尔罗素就设想，如果6500万年前没有那场大灾难，迅猛龙的近亲奔龙，就完全可能进化成为代替人类的一种动物——“恐龙人”，成为地球的主宰。这就是曾经风行一时的“恐人学说”。 [6]-----关系:伤齿龙科恐龙在寻找鸟类起源上有重要的位置，因为他们于早期鸟类拥有许多共同生理特征。最近在晚侏罗纪的莫里逊组发现的WDCDML001完整标本，属于伤齿龙科，时间也接近始祖鸟的年代。这个重要的侏罗纪伤齿龙科化石，证实了较衍化的恐爪恐龙的出现时间非常接近鸟类的出现时间，而更基础的近鸟类应该在更早的时期演化出来。这项发现使得恐龙与鸟类演化上的时间矛盾无效，但少数人仍抱持者这个演化上的时间矛盾。",
                    "src": "./static-2/伤齿龙.jpg"
                },
                {
                    "name": "霍夫曼苍龙",
                    "time": "7500万年前",
                    "description": "沧龙属(Mosasaurus)主模式种是霍夫曼沧龙(Mosasaurus hoffmanni) , 于1780年被发现于荷兰 ，霍夫曼沧龙(Mosasaurus hoffmanni)根据俄罗斯出土的一块下颌CCMGE 10/2469可以得出最大体长可达15.2米 ,最大体重13.3吨。另有两块巨大的方骨（NHMM 003892和YPM 773）和一块巨大的肱骨的主人的大小超过CCMGE 10/2469，但小于那块巨大的方骨。NHMM009002、IRScNB R24和昵称“甜心”的霍夫曼沧龙也是10吨级别的巨大个体。它的牙齿长有切边，根据Lingham-Soliar (1995)的见解 , 沧龙属(Mosasaurus)有较大的眶部但是双眼视觉却相对较低 , 它们的嗅觉器官也不发达 , 他认为像霍夫曼沧龙(Mosasaurus hoffmanni)是生活于水表面掠食者 , 生活的环境还是沿岸水域。",
                    "src": "./static-2/霍夫曼苍龙.jpg"
                },
                {
                    "name": "人类及老鼠的最后共同祖先出现",
                    "time": "7500万年前",
                    "description": "据英国《自然》杂志网报道，科学家研究认为：鼠和人类都源于一个共同的祖先，“它便是一种与恐龙生活在同时期的小动物，身体大小犹如现在的小老鼠。 ”也许这仅仅是一家之言，但有趣的发现又确实让人值得深思。 科学家表示，真哺乳亚纲动物家族中迄今为止最早的代表动物――生活在1亿2500万年前的“古老的攀缘者”（ E omaia scansoria）孕育了各种各样的现代胎生哺乳动物。",
                    "src": "./static-2/人类及老鼠的最后共同祖先出现.jpg"
                },
                {
                    "name": "甲龙",
                    "time": "6800万年前",
                    "description": "甲龙，是脊索动物门 [2]爬行纲 [3]鸟臀目 [4]甲龙科 [5]装甲恐龙。体长为5-6.5米，体重约4吨；腿短、脖短、头颅宽阔；身体由几百片骨板覆盖，骨板表面光滑，呈横向排列；眼睛上方也具骨板，只有腹部无保护结构；体型较宽，尾巴较短且粗，尾巴末端有尾锤。 [6]甲龙是最早被发现的恐龙之一，最初被描述和命名为“森林蜥蜴”。 [7]因其身体笨重，只能用四肢在地上缓慢爬行，形似坦克车，又称“坦克龙”。 [5]甲龙曾分布于北美洲， [8]在美国、墨西哥、玻利维亚等国也有化石分布。 [4]甲龙栖息于树林， [9]在其生活的地区，气候温暖湿润，植物种类多样。 [10]在遇到危险时，甲龙会收拢四肢蜷在地上，或用尾锤攻击对方。 [11]甲龙是草食性恐龙， [5]以嫩枝叶或多汁的根茎为食。 [9]甲龙生活在距今约6800万-6550万年前的白垩纪晚期。 [12]1906年在北美蒙大拿州的地狱溪地层发现甲龙的化石，由美国古生物学家巴纳姆·布朗于1908年命名；化石包括头颅骨的顶部、脊骨、肋骨、部分肩胛骨及装甲， [13]虽然甲龙的骨骼没有完整地被发现，但它常被认为是甲龙的原型。 [8]甲龙家族有两个群体，一个是甲龙科，最早出现在距今大约1.7亿年前的侏罗纪中期；另一个是结节龙科，是最早出现在侏罗纪的甲龙群体。",
                    "src": "./static-2/甲龙.jpg"
                },
                {
                    "name": "风神翼龙",
                    "time": "6800万年前",
                    "description": "风神翼龙翼展可达11米长，重达500斤。它是人类已知最大的飞行动物。风神翼龙新陈代谢很快，需要定期进食。风神翼龙身躯为流线型，需要大量蛋白质作为能量。一只不到三百斤重的小霸王龙，便可被它当成一顿美食。风神翼龙拥有巨大的双翼，这使它非常适合长途滑翔。风神翼龙未成年的个体头骨长1米，翼展达5.5米；成年个体的头骨未曾发现，根据翅骨碎片来看，翼展至少有10~11米，这可是地球生命史来最大型飞翔的动物！风神翼龙的嘴巴又长又细，口中没有牙齿；喙前端不是尖锐的，而是钝的；它的眶前孔(位于眼眶前方的)巨大，差不多占了头骨全长的二分之一，这无疑对其大头减轻了相当多的重量；风神翼龙头上有脊冠，位于眼眶前上方，这区别于该属其他翼龙如至浙江翼龙,它们头上没有脊冠；风神翼龙的脖子非常长，达2米多，由肩与头之间有长型的肌腱和肌肉支撑；它的腿很长，有平衡大头的作用。远观之，风神翼龙呈现了类似鹤或鹳的外表。",
                    "src": "./static-2/风神翼龙.jpg"
                },
                {
                    "name": "角龙",
                    "time": "6800万年前",
                    "description": "角龙是白垩世晚期出现的鸟臀类恐龙。 [1]角龙的脖子两侧和后边长着一块厚厚的骨板，称做”颈盾”，颈盾上还有2只或3只形状不同的角。这些角是防敌害的有力武器。角龙的嘴形奇特，似鹦鹉嘴，有利于挖掘植物的根茎。角龙的种类很多，根据角和颈盾的形态，有原角龙、秀角龙、独角龙、三角龙、戟龙等。最原始的角龙起源于亚洲，以后迁徙到北美大陆。角龙在距今1亿年前~7千万年前都非常繁盛，它们也是恐龙中最后走向灭绝的一类-6550万年前的白垩纪晚期。",
                    "src": "./static-2/角龙.jpg"
                },
                {
                    "name": "霸王龙",
                    "time": "6700万年前",
                    "description": "地狱溪之王 - 霸王龙属于暴龙超科的暴龙属，为该属下的唯一种，于1905年由美国古生物学家，美国艺术与科学院院士亨利·奥斯本描述命名。如果参考其它恐龙种名的翻译格式，它的种名翻译为“君王暴龙”会更合适。成年霸王龙体长约12米，体重7吨左右，是地球上有史以来最大的陆地捕食者之一。霸王龙是久负盛名的恐龙，拥有海量的标本收藏，其中几十件标本都达到了非常高的完整度，使得古生物学家对于霸王龙的研究不仅仅局限于经典的形态描述，还可以对它的个体发育，生物力学，种群生物学等做出更详细的分析。如对于霸王龙头骨生物力学的研究表明它具有粉碎骨骼的咬合力，对它的脑颅三维重建表明霸王龙具有极佳的视觉和嗅觉，而对霸王龙个体发育序列的研究表明，霸王龙具有非常快的生长速度。很多在其它恐龙物种或是其它古生物身上无法落实的研究手段都可以用霸王龙尝试。在科学研究方面，霸王龙在国际顶级学术期刊《Science》上拥有属于自己的综述论文 [1]，并且与它相关的各种研究也会频繁登上《Nature》和《Science》这样的顶级学术期刊。虽然目前霸王龙的体型受到了大型异特龙类以及棘龙的挑战，但是综合研究深度以及文化影响力来看，它依然是名副其实的恐龙之王。",
                    "src": "./static-2/霸王龙.jpg"
                },
                {
                    "name": "白垩纪末大灭绝",
                    "time": "6600万年前",
                    "description": "第五次物种大灭绝, 又叫K-T灭绝事件, 白垩纪-古近纪灭绝事件, 约有75%的物种灭绝, 在这场末日中, 飞鸟恐龙, 翼龙, 苍龙, 蛇颈龙, 菊石亚纲全灭",
                    "children": [
                        {
                            "name": "希克苏鲁伯陨石坑",
                            "time": "6600万年前",
                            "description": "希克苏鲁伯陨石坑（Chicxulub Crater），位于墨西哥尤卡坦半岛发现的陨石坑撞击遗迹，曾经是地球最大的陨石坑（发现最大的陨石坑是在数百万年厚重的冰床下面发现的有史以来最大的陨石坑：威尔克斯地陨石坑，这个宽为483公里的陨石坑有2.5亿年的历史了）。希克苏鲁伯陨石坑体地表不可见。距推测，陨石坑整体略呈椭圆形，平均直径约有180公里；造成坑洞的陨石，直径推测约有10公里，撞击后完全蒸发，释出高达5.0×10^23焦耳的能量，相当于九十多万亿吨TNT炸药，足以引发大海啸、地震和火山爆发，并使大量灰尘进入大气层，完全遮盖阳光、改变全球气候，造成核子冬天。",
                            "src": "./static-2/希克苏鲁伯陨石坑.jpg"
                        },
                        {
                            "name": "非鸟恐龙灭绝",
                            "time": "6600万年前",
                            "description": "一项新研究发现，非鸟恐龙可能在小行星撞击地球导致的大灭绝事件之前约1000万年就已陷入衰退了。 这项近日发表于《自然—通讯》的研究进一步揭示了恐龙是如何灭绝的。 过去人们普遍认为，一颗小行星撞击墨西哥的希克苏鲁伯，导致非鸟恐龙在6600万年前灭绝。 但是恐龙是否在撞击之前就已经陷入衰退的问题尚无定论，并且根据现存化石记录也很难做出评估。",
                            "src": "./static-2/非鸟恐龙灭绝.jpg"
                        },
                        {
                            "name": "哺乳动物多样性增长",
                            "time": "6600万年前",
                            "description": "哺乳动物是动物世界中形态结构最高等、生理机能最完善的动物。与其他动物相比，哺乳动物最突出的特征在于胎生以及其幼崽由母体分泌的乳汁喂养长大。哺乳动物具有比较发达的大脑，因而能产生比其他动物更为复杂的行为，并能不断地改变自己的行为，以适应外界环境的变化。世界上现存的哺乳动物有4000多种，虽然它们都已经高度进化，但仍具有很多共性：几乎所有的哺乳动物都是温血动物，体温基本恒定，身上披有毛发，以保护身体、隔绝冷热等等。",
                            "src": "./static-2/哺乳动物多样性增长.jpg"
                        }
                    ],
                    "src": "./static-2/白垩纪末大灭绝.jpg"
                }
            ],
            "src": "./static-2/中生代.jpg"
        },
        {
            "name": "新生代",
            "time": "6600万年前-今天",
            "description": "新生代（Cenozoic） 是地球地质历史上显生宙的第三个、也是最晚的一个代，也是目前最年轻的一个地质时代，从6600万年前白垩纪—古近纪灭绝事件开始一直持续至今。新生代下分三个纪（古近纪、新近纪、第四纪，前两者曾被合称第三纪），共七个世。新生代是哺乳动物繁荣并占据各个生物圈的优势生态位的时期，因此也称哺乳动物时代。除此之外，鸟类、有鳞爬行类、滑体两栖类、辐鳍鱼和昆虫也有很大发展，被子植物彻底成为优势陆生植物，使得裸子植物和蕨类植物等逐渐衰落被边缘化。在新生代第四代晚期的全新世，属于灵长目哺乳动物的智人通过新石器革命形成以农业为基础的定居文明，并在之后的一万年间通过技术的不断进步成为地球有史以来唯一能够大规模改变地表生态环境并离开大气层、登陆其它天体并尝试探索宇宙的物种。-----地理 : 盘古大陆已经彻底分裂，地球上的各个大陆逐渐移动到今天的位置上：印度、澳洲向北移，前者更撞向亚洲而形成喜玛拉雅山脉和青藏高原；北美洲和南美洲也在此段时间连接起来。",
            "children": [
                {
                    "name": "古新世",
                    "time": "6600-5600万年前",
                    "description": "复苏 - 古新世（距今6500万年～距今5300万年）Paleocene Epoch第三纪5个世中的第一个世，约开始于6500万年前，结束于5300万年前。古新世形成的地层称古新统，位于中生界之上、始新统之下。1874年，W.P.夏姆珀根据巴黎盆地发现的植物化石，认为含这些化石的层位早于始新世，提出古新世。这一时期持续了约1200万年，最大特点是动物群中古老种类或土著类型占很大优势，与其后的动物群有着明显的区别。",
                    "src": "./static-2/古新世.jpg"
                },
                {
                    "name": "今鸟类幸存",
                    "time": "6600万年前",
                    "description": "研究表明，现代鸟类更像是经历长期缓慢而连续的演化,在自然选择导向下逐渐适应环境变化，并与被子植物、哺乳动物等协同演化而来。 躲避灾害，成功演化出新发育模式 事实上，在鸟类家族中，并非所有鸟类都幸存下来。 为什么只有今鸟类一枝独秀幸存至今？ 科学家提出了各种假设，如鸟类体型、个体发育模式、快速生长素率假说、高代谢率假说等。",
                    "src": "./static-2/今鸟类幸存.jpg"
                },
                {
                    "name": "冠恐鸟",
                    "time": "6200万年前",
                    "description": "冠恐鸟的平均身长有1.75m。冠恐鸟的喙特别大及呈钩状，腿大而强壮，脚掌大且有爪/它们生存的环境有大量的密赫，气候潮湿至半干旱。生活习性:因为身躯庞大需要大量的食物，所以冠恐鸟会划分各自的领地。聪明的它们会各霸一方，如果它们真是食肉动物，那么为了保护幼鸟当然不欢迎其他同类。根据它们的怖形，要填饱幼鸟的肚子也需要许多食物，因此估计它们每次产很少量的卵，可能是一敝巨卵。在浓密的森市市中，这般庞大的身躯要去追捕猎物肯定是事倍功半，因为它们多半会选择伏击。至于冠恐鸟的颜色，或许可以想一想食火鸡——生活在丛赫中一种庞大的不会飞的鸟类。它们有着令人惊艳的红蓝相间的皮肤，外面衬着光滑的黑色羽毛。食火鸡是吃素的，而且没有天敌。也就是说。它们完全有理由拥有光鲜的外表而不怕引人注目。恐冠鸟则不同，它们很可能靠伏击获取猎物，所以它们的颜色应该更加灰暗些。",
                    "src": "./static-2/冠恐鸟.jpg"
                },
                {
                    "name": "古食肉目出现",
                    "time": "6000万年前",
                    "description": "最原始的食肉目出现在5700多万年前的古新世晚期的北美大陆，剑齿虎头骨化石叫作细齿兽。 科学家对细齿兽的起源研究得还不是很透彻，推测可能起源于白垩纪晚期的食虫类动物。 在3000多万年前的晚始新世到早渐新世期间突然繁盛起来，并演化出了许多分支。 主要包括三大类：狗形类、猫形类和鳍脚类（海生食肉类）。 [12] 最早的狗类叫作指狗，生活在3400万年前的始新世末期和渐新世早期。",
                    "children": [
                        {
                            "name": "细齿兽类祖先",
                            "time": "6000万年前",
                            "description": "小古猫属 （学名： Miacis），又名 细齿兽，是一属已 灭绝 的 细齿兽类，生存于6500-4200万年前的 古新世 晚期。 它们代表了现今 食肉目 的祖先， 小古猫有五爪，大小像 鼬，生活在 北美洲 及 欧洲 大陆。 它们保有 肉齿目 的一些原始特征，如低的 头颅骨 、幼长的身体、长尾巴及脚短。 牙齿 数目仍保持在44颗，但在 演化 历程中这个数量有一些减少及一些牙齿亦缩小了。",
                            "src": "./static-2/细齿兽类祖先.jpg"
                        },
                        {
                            "name": "泰坦巨蟒",
                            "time": "6000万年前",
                            "description": "蛇类体型巅峰",
                            "src": "./static-2/泰坦巨蟒.jpg"
                        }
                    ],
                    "src": "./static-2/古食肉目出现.jpg"
                },
                {
                    "name": "始新世",
                    "time": "5600-3390万年前",
                    "description": "始新世（Eocene、Epoch）Eocene之名，字源来自希腊文εω（eo，黎明）和καινος（caenos，新），指的是现代哺乳动物群开始出现。始新世常被划分成早期（距今5780万～5200万年）、中期（距今5200万～4360万年）和晚期（距今4360万～3660万年）。始新世早期最令人受到注意的是，原始的现代哺乳动物开始出现。始新世结束于一个被称作Grande Coupure（the 'Great Break' in continuity）的生物大灭绝事件（extinction event），此一事件可能与一或数颗的大火流星（bolide）撞击西伯利亚及当今的契沙比克湾（Chesapeake Bay）相关。气候:由于地球地质历史现有记录中出现的一次最快、强度最大的全球变暖事件，被称为古新世-始新世极热事件（PETM或IETM）的发生，地球温度迅速升高，始新世就此开始。这次迅速而剧烈的升温（在高纬度地区温度上升了7°C之多）持续的时间少于10万年，但是导致了大量物种急剧灭绝，从而形成了古新世和始新世生态系统的分野。始新世的全球气候可能是新生代中变化幅度最小的；从赤道到极地的气温变化幅度只有今天的一半，而深海洋流则异常温暖。极地地区比当今温暖得多，接近于现今西北太平洋的温度；温带森林已经扩展到了极地地区，同时多雨的热带气候区则延伸至北纬45°地区。温带地区的气候与当今相比大有不同，而热带地区的气候则可能接近于当今。不过在哥伦比亚发现的一种可能生活于始新世的巨蛇残骸（约有校车大小）表明，可能相反的，当时的热带比现今温暖的多 [1-2]，这也与计算机模拟出的始新世气候相符 [3]。尽管始新世的全球气候仍然比较温暖，但也正是在始新世后期，开始了全球变冷的缓慢趋势，这可能是由发生于北冰洋的绿萍事件以及在冈瓦纳古陆最终破碎之后形成的南极洲环流共同造成的。这种变冷趋势最终导致了更新世冰期的出现。",
                    "src": "./static-2/始新世.jpg"
                },
                {
                    "name": "古新世-始新世极热事件",
                    "time": "5550万年前",
                    "description": "又称第一次始新世极热事件, PETM, 全球平均温度上升了5度到8度 - 古新世-始新世极热事件发生在距今约5600万年前，由于巨量的碳排放，地球上发生了一次变暖事件，全球平均温度快速升高了约5℃。这次事件标志着地球气候系统从暖室状态向热室状态的根本性转变，导致大气圈、水圈和生物圈发生了重大变化，如大洋酸化、海洋脱氧、底栖有孔虫灭绝、陆地上哺乳动物快速演化和普遍侏儒化。",
                    "src": "./static-2/古新世-始新世极热事件.jpg"
                },
                {
                    "name": "被子植物演化",
                    "time": "5500万年前",
                    "description": "被子植物起源于三叠纪晚期，早于确切的被子植物冠群最早化石年龄。被子植物的五大分支之间的关系仍未完全解析，被称为“达尔文之谜”。早白垩纪被子植物的崛起重塑了全球陆地植被和生态系统格局。被子植物的内部演化关系一直存在争议，被划分为无油樟目、睡莲目、木兰藤目和核心被子植物。",
                    "children": [
                        {
                            "name": "多肉水果",
                            "time": "5500万年前",
                            "description": "",
                            "src": "./static-2/多肉水果.jpg"
                        },
                        {
                            "name": "营养丰富的坚果和种子",
                            "time": "5500万年前",
                            "description": "坚果和种子类食品是一种营养价值很高的食物，可以为我们提供大量的蛋白质、脂肪和碳水化合物，同时它们还富含其他重要的营养物质。 这些食物中的营养成分可以帮助我们维持健康的体重、促进骨骼和牙齿健康、保持心血管健康并预防一些疾病。 在一项研究中，研究者对美国食品药品监督管理局（FDA）批准的30种常见坚果和种子类食品进行了分析，发现它们可以提供足够的能量、蛋白质、脂肪和碳水化合物。",
                            "src": "./static-2/营养丰富的坚果和种子.jpg"
                        }
                    ],
                    "src": "./static-2/被子植物演化.jpg"
                },
                {
                    "name": "哺乳动物重回海洋",
                    "time": "5500万年前",
                    "description": "鲸目动物的基因组有助于讲述哺乳动物重返水生生活的故事。 大约4亿年前，所有四肢生物的祖先第一次踏上了陆地。 快进到大约3.5亿年前，这些早期陆栖动物的后代却做了一个180度大转弯：它又返回到了水中。 随着时间的推移，回归海洋的生物，产生了与陆地上的同类截然不同的动物：它们变成了今天在海洋中滑行的宏伟的鲸鱼、海豚和鼠海豚。 在大约1000万年的时间里，回归水生是一个剧烈的转变，它将从内到外改变动物。",
                    "children": [
                        {
                            "name": "鲸鱼及海豚的祖先",
                            "time": "5500万年前",
                            "description": "古生物学家在秘鲁找到历来最完整的鲸豚类祖先化石，证实它们有四只脚，是水陆两栖动物。 专家相信，它们在多年前游过大西洋，终到达南美。 比利时皇家自然科学研究所的专家兰伯特（Olivier Lambert）及其团队，在秘鲁南部离海边1公里的沙漠挖出被命名为Peregocetus pacificus的鲸豚类祖先化石。 该化石约有4260万年历史，长约4米。",
                            "src": "./static-2/鲸鱼及海豚的祖先.jpg"
                        }
                    ],
                    "src": "./static-2/哺乳动物重回海洋.jpg"
                },
                {
                    "name": "灵长总目分化",
                    "time": "5500万年前",
                    "description": "灵长总目 （学名： Euarchontoglires）是 胎盘类 哺乳动物 中的一个 总目，基于 DNA测序 分析和 反转录转座子 生物标记 存在/消失的数据，以 啮形大目 （啮齿目 和 兔形目）和 真灵长大目 （树鼩目 、 灵长目 和 皮翼目）所组成。 灵长总目可能是在九千五百万至八千五百万年前的 白垩纪 时由 姐妹群 劳亚兽总目 分出的。 这个假设有分子钟证据的充分支持。",
                    "children": [
                        {
                            "name": "灵长目",
                            "time": "5500万年前",
                            "description": "灵长总目 （学名： Euarchontoglires）是 胎盘类 哺乳动物 中的一个 总目，基于 DNA测序 分析和 反转录转座子 生物标记 存在/消失的数据，以 啮形大目 （啮齿目 和 兔形目）和 真灵长大目 （树鼩目 、 灵长目 和 皮翼目）所组成。 灵长总目可能是在九千五百万至八千五百万年前的 白垩纪 时由 姐妹群 劳亚兽总目 分出的。 这个假设有分子钟证据的充分支持。",
                            "src": "./static-2/灵长目.jpg"
                        },
                        {
                            "name": "树鼩",
                            "time": "5500万年前",
                            "description": "树鼩（学名：Tupaia belangeri）是树鼩科树鼩属动物。体长26-41厘米，体重50-270克，头部到身体的长度为12-21厘米，尾长约14-20厘米， [1]体背毛以橄榄褐色为主，颈侧有淡黄色条纹，腹毛由灰色至污白色，背腹之间毛色界线分明，尾毛与体色相同。前后足均具有五趾，每趾都有发达而尖锐的爪、吻部尖长，耳较短，头骨的眶后突发达，形成一骨质眼球，脑室较大。善攀登，跳跃，行动敏捷，胆小易惊，有较强的领地意识。能发出8种不同的声音用于警报、注意、接触和防御。食物以虫类为主，也可食用幼鸟、鸟蛋、谷类、果类、树叶等。主要分布在克拉地峡以北的东南亚地区。",
                            "src": "./static-2/树鼩.jpg"
                        }
                    ],
                    "src": "./static-2/灵长总目分化.jpg"
                },
                {
                    "name": "澳洲与南极洲分裂",
                    "time": "5500万年前",
                    "description": "澳大利亚板块（Australian Plate）是南半球一个主要板块，原为冈瓦那大陆的一部分，直到大约1亿年前，因印度板块开始向北移动，澳大利亚板块才与印度板块、南极洲板块相连。8500万年前，澳大利亚板块开始与南极洲板块分开，到大约4500万年前才完全分离。[2]随后，澳大利亚板块与印度板块在印度洋下方相互接合，形成印度-澳大利亚板块。然而，最近的研究表明这两个板块将会再次分裂，预估完全分离至少需300万年或更长的时间。[3]目前，澳大利亚板块包括整个澳大利亚洲与塔斯马尼亚岛，以及一部分的新几内亚、新西兰、印度洋。-----地理位置 : 澳大利亚板块的北边及东边与太平洋板块相聚合著，太平洋板块隐没到澳大利亚板块下方的区域形成汤加海沟和克马德克海沟，以及平行于海沟的汤加及克马德克群岛两岛弧。[4] 同时，两版块相交也对新西兰北岛的东部地区造成地形起伏上升。西兰大陆自8500万年前与澳大利亚板块分离，目前已经有94%的区域已被海水淹没，只有新西兰亚南极群岛、新喀里多尼亚及一些其余岛屿还浮于水面上[5]，此处同时为澳大利亚板块与太平洋板块相错移而形成阿尔卑斯断层。[6]位于新西兰以南的澳大利亚板块与太平洋板块形成一过渡相错移收敛边界，形成麦夸里断层带。接着，澳大利亚板块开始沿着普伊斯哥海沟隐没到太平洋板块下。 向普伊斯哥海沟西南方延伸为麦觉理洋脊（Macquarie Ridge）。[7]澳大利亚板块南边与南极洲板块分离的边界为印度洋东南海岭。[8]澳大利亚板块与欧亚板块隐没缓冲带区域，于印度尼西亚一带以华莱士线分隔亚洲与澳大利亚的生物相。尽管以东的印度尼西亚岛与虽然仍属于欧亚板块的一部分，但在生物相上属澳大利亚生物相。[9] 华莱士线以西区域为巽他陆棚东南端。",
                    "src": "./static-2/澳洲与南极洲分裂.jpg"
                },
                {
                    "name": "真灵长类出现",
                    "time": "5500-5250万年前",
                    "description": "最早的真灵长类有在大约5000万年前同时出现的兔猴和始镜猴两类，在欧洲和北美都曾经发现过。 由于一直没有在欧洲和北美发现更早的真灵长类的祖先，非洲和亚洲被学术界认为最有可能是真灵长类动物的起源地。 但是，长期以来，在亚洲和非洲5000万年前的早始新世地层中并没有发现可靠的真灵长类化石证据，因此真灵长类起源问题一直是困惑着科学家的难解之谜。",
                    "children": [
                        {
                            "name": "辛普森氏果猴",
                            "time": "5250万年前",
                            "description": "辛普森氏果猴重约100克，应该是在树上生活。它的其中一趾较大并且有趾甲，与其他的趾相对，这使它们可以很有力的抓住树枝并在树上爬上爬下。它长着锯齿状的前臼齿，牙齿的形态使它们适合食用生果、种子及无脊椎动物。",
                            "src": "./static-2/辛普森氏果猴.jpg"
                        },
                        {
                            "name": "亚洲德氏猴",
                            "time": "5250万年前",
                            "description": "发现于湖南衡东的真灵长类化石是一个保存基本完好的头骨，属于始镜猴类，代表一个新种，被命名为亚洲德氏猴（teilhardina asiatica），是人类和猴子的远古近亲。这具迄今为止最早的真灵长类头骨所保存的特征说明现生真灵长类的显著的头骨特征早在5500万年前就已经出现。德氏猴是一种已灭绝的体型似狐猴的小型古灵长目动物，曾广泛分布于亚洲、欧洲和北美森林中，被认为最终演化为现代猴子、猿和人类。属于已知的人类始祖。",
                            "src": "./static-2/亚洲德氏猴.jpg"
                        }
                    ],
                    "src": "./static-2/最早的真灵长类出现.jpg"
                },
                {
                    "name": "奇蹄类与偶蹄类出现",
                    "time": "5400万年前",
                    "description": "偶蹄目动物蹄子成对，适应于草地和森林环境，生态角色多样；奇蹄目动物蹄子单独，适应于奔跑和硬地移动，生态角色显著。 两者均起源于古近纪，但演化路径不同，偶蹄目多样化，奇蹄目较保守。",
                    "src": "./static-2/奇蹄类与偶蹄类分化.jpg"
                },
                {
                    "name": "翼手目出现",
                    "time": "5250万年前",
                    "description": "翼手目1200多种，占哺乳纲总数的23%，为 仅次于啮齿目（老鼠）的第二大目，这证明了蝙蝠演化的成功。 最早的哺乳动物出现于距今2.25亿年前的晚三叠纪，由合弓类爬行动物的犬齿兽类进化而来。 由于恐龙的生态钳制，哺乳动物在整个中生代都没有很大发展。 为了避开与恐龙的竞争，早期哺乳动物体型都很小，只有今天的蝙蝠或老鼠大小。 它们选择了在夜间活动，以昆虫为主食，不少种类都会爬树。",
                    "children": [
                        {
                            "name": "芬尼氏爪蝠",
                            "time": "5250万年前",
                            "description": "芬尼氏爪蝠的发现，解决了多年来蝙蝠回声定位的发展是否早于飞行能力的争议。芬尼氏爪蝠具有完整发展的翅膀，明显具有飞行的能力；然而它们却缺乏现存可回声定位蝙蝠所具有的膨大耳蜗，而比较像是不可回声定位的狐蝠[1]。这代表，早期的蝙蝠是先发展出飞行能力后才演化出回声定位的能力[3]。  然而于2010年，对芬尼氏爪蝠化石骨架结构的重新检视，发现它们仍然可能有能力透过喉部发声进行回声定位[4]。不过由于化石有受到挤压变形，因此研究者也指出他们其实无法完全肯定芬尼氏爪蝠的喉部构造，这代表着爪蝠是否能进行回声定位仍有变数[5]。由于化石并为保存完整的眼窝，因此目前仍不清楚爪蝠是否具有和其他夜行性动物一样的大眼睛[1]。缺乏大眼睛代表爪蝠可能为昼行性，不需要仰赖回声定位来探索环境及寻找猎物。爪蝠与伊神蝠的生存年代相近，这此之前伊神蝠被认为是唯一已知最早的蝙蝠物种[6]。",
                            "src": "./static-2/芬尼氏爪蝠.jpg"
                        }
                    ],
                    "src": "./static-2/翼手目出现.jpg"
                },
                {
                    "name": "马由始祖马开始演化",
                    "time": "5000万年前",
                    "description": "马的祖先可以追溯到50万年前。 始祖马是最早的 马，生活在北美的森林里。 进化导致了 Merychippus 的出现，它在 20 万年前适应了草原生活。 与现代马相似的马种 Equus Simplicidens 出现于 3.5 万年前。 塔尔潘（Tarpan）是一种史前马，是家马的祖先。 驯化始于公元前 4000 至 3500 年左右的欧亚草原。 早期的家马用于产奶、产肉和运输。",
                    "children": [
                        {
                            "name": "始祖马",
                            "time": "5000万年前",
                            "description": "始祖马（学名Hyracotherium），又名始新马或始马，曾被认为是马科中最早的品种。[1]现时它被认为是属于古兽马科，这是与马及雷兽有关的科。始祖马的大小如狗一般，生存于北半球，分布在始新世早期至中期（距今约6千万至4千5百万年前）的亚洲、欧洲及北美洲。[2]始祖马的第一个化石标本是由古生物学家理查·欧文于1841年在英格兰发现，他基于牙齿的缘故而怀疑这是一头蹄兔目。他并没有发现完整的骨骼，故将它命名为“似蹄兔兽”（Hyracotherium），即始祖马的学名。于1876年，奥塞内尔·查利斯·马什在美国发现了一个完整的骨骼，并命名为曙马（Eohippus）。后来发现这两个发现非常接近时，始祖马因最先被发表，故曙马则成为了异名。始祖马平均只有60厘米长及肩高20厘米。它的前肢有四趾，而后肢则有三趾。头颅骨很长，有44颗低冠的牙齿。据信始祖马是草食性的，主要以树叶、水果及坚果为食物。[3]有些科学家相信始祖马不只是马的祖先，也有可能是其他奇蹄目，如犀牛及貘的祖先。[4]始祖马被认为是一类古兽马，而非严格意义上的马（horse proper），但这情形仅见于模式种的H. leporinum。[5][6]大部分其他的古兽马物种都被认为是属于马科，且都被分类在其他的属中，如Arenahippus、Minippus、Pliolophus、Protorohippus、Sifrhippus、Xenicohippus、甚至曙马属。[6]Xenicohippus曾一度被认为是早期的雷兽科。",
                            "src": "./static-2/始祖马.jpg"
                        },
                        {
                            "name": "游走鲸",
                            "time": "5000万年前",
                            "description": "鲸类开始下海",
                            "src": "./static-2/游走鲸.jpg"
                        }
                    ],
                    "src": "./static-2/马由始祖马开始演化.jpg"
                },
                {
                    "name": "细齿兽类演化",
                    "time": "5000万年前",
                    "description": "细齿兽类 演化 至现今肉食性的 哺乳动物。 细齿兽类是细小像 貂鼠 的动物，身体及尾巴都很长。 一些 物种 是栖息树上的，其他的则生活在陆地。 它们可能吃 无脊椎动物 、 蜥蜴 、 鸟类 及细小的哺乳动物，如 鼩鼱科 及 负鼠目 等。 它们的 牙齿 及 头颅骨 比现今的 食肉目 较少发育。 它们有 裂齿，但没有成骨的鼓泡。",
                    "children": [
                        {
                            "name": "小古猫属",
                            "time": "5000万年前",
                            "description": "小古猫属 （学名： Miacis），又名 细齿兽，是一属已 灭绝 的 细齿兽类，生存于6500-4200万年前的 古新世 晚期。 它们代表了现今 食肉目 的祖先， 小古猫有五爪，大小像 鼬，生活在 北美洲 及 欧洲 大陆。 它们保有 肉齿目 的一些原始特征，如低的 头颅骨 、幼长的身体、长尾巴及脚短。 牙齿 数目仍保持在44颗，但在 演化 历程中这个数量有一些减少及一些牙齿亦缩小了。",
                            "src": "./static-2/小古猫属.jpg"
                        }
                    ],
                    "src": "./static-2/细齿兽类演化.jpg"
                },
                {
                    "name": "现代银杏出现",
                    "time": "5000万年前",
                    "description": "“这种在早白垩世银杏属内出现的新类型，也就是‘现代型’的银杏，一直延续至今。 晚白垩世和古近纪发现的银杏都是这种类型。 ”周志炎继续说，“现生的银杏除了种子较大、数目减少，营养叶形有一些改变以外，经过了1.2亿年漫长的岁月，其他特征几乎没有改变。 这种在地质历史时期里十分缓慢的进化过程，应该是一种典型的‘迟滞’现象。",
                    "src": "./static-2/现代银杏出现.jpg"
                },
                {
                    "name": "安氏兽",
                    "time": "4800万年前",
                    "description": "特征 :极度延长的面部，颧骨宽阔膨大，颅长83.4厘米，颧宽56厘米；具较为完整的真兽齿型，因此不同于m3缺失的强中兽；p4呈三角状并臼齿化，有突出的第三尖。其m3后尖缺失，外嵴（ectoloph）主要由前尖（paracone）构成。从沿海出土的化石判断，蒙古安德鲁斯中兽 拥有陆地哺乳动物最强的下颌，能咬住大骨头，安氏中兽可以捕杀原始鲸鱼、贝类，拥有坚硬外壳的乌龟和大哺乳动物。由于食物要求，认为安氏中兽是存在中亚在始新世期间。当印度次大陆与亚洲在始新世晚期或渐新世早期碰撞时，形成了喜玛拉雅山及隔离了特提斯洋，继而影响了气候，使中亚洲干涸，最终令动物群灭绝。而安氏中兽亦相信是因此而灭绝的。-----头骨 : 安氏中兽的头骨化石长83厘米，宽56厘米。头颅骨很像较为细小的中爪兽目，故推测安氏中兽有着与狼差不多的大小。 安氏中兽可能是最大型的陆上哺乳类肉食性动物。若安氏中兽按照中爪兽的体型来比例，从鼻端到盆骨就可长达12尺，而肩高则达6尺。故此安氏中兽约有Synoplotherium (Dromocyon) vorax或中爪兽的三倍。安氏中兽像其他的史前动物般，有着与身体不成比例的大头。安氏中兽的面部长度约为头盖骨的150%，而中爪兽就只有92%，可见安氏中兽的面部相对较长。安氏中兽的头盖骨约有阿拉斯加棕熊的两倍，但较为窄身，并且是马更歇狼的三倍。由于平均棕熊都轻于1000磅，而最极端的狼亦只重170磅，故相信安氏中兽约重400-1000磅之间。围绕颅骨标本，科学家们作了详尽的描述和分析，并且与巨大的强中兽（Harpagolestes）进行了对比：H.uintensis A. mongoliensis头骨总长 429 834（面长+颅区）颧弓宽 270 560面长 206 500（下第1门齿i1到下第3臼齿m3的跨度）颅区长 223 334 （单位：毫米） （m3往后到骨节髁）这些数据表明安氏中兽几乎是强中兽H.uintensis的两倍，而从面区占颅骨整体比例来看，其吻部所占比例甚大，而颅区比例不大，可能它的智力不是太高。-----牙齿 : I2极大，I3很小；上犬齿没有保存下来，但从着生位置的痕迹来看尺寸应该很大；Pl很小，只有单一齿根和齿尖；P2双齿根，只有一尖；P3有未发育完全的第三齿根，双齿尖，具突出的原尖，而无第二尖；P4大而臼齿化，具突出的第三尖、三齿根；M1尺寸稍小，具三齿根；M2宽大呈三角状，中尖大，具突出的原尖和第三尖，第二尖磨损；M3原尖与第三尖突出，具未发育完全的第二尖。中兽类在齿型上的改变表明其已经适应食肉习性，但它们尚未具备正宗食肉哺乳动物的标志——裂齿，而最先具备原始裂齿的是其后与中兽共享一片蒙古蓝天的肉齿目动物。中兽科动物的体型差异很大，小的如豺狗，大的可达数米。安氏中兽属于最晚期的踝节类，人们对于这种神秘的巨兽还知之甚少，原因是化石证据不足，除1923年找到的这具头骨外，尚未有新化石被发现。其种属的确定也完全是以头骨的化石形态特征为依据的。其体长是借鉴了强中兽的头骨与身体其它部位的比例计算的。而体重和整体复原图也是在此基础上得出的。之所以将安氏中兽头骨与全身比例以强中兽作比较是因为它们同属压骨型中兽，具更为近似的身体构造。就身体的综合素质来讲，安氏中兽无疑是曾出现过的最强大的陆生哺乳类食肉兽，当之无愧地与其后在蒙古崛起的肉齿目牛鬣兽科的裂肉兽、鬣齿兽科的伟鬣兽、巨鬣齿兽并称“老第三纪四强”。而单从体型比较，只有裂肉兽堪与其相提并论。安氏中兽所在的踝节目也拥有着显赫的地位，与后来的有蹄类和其他诸多门类动物在系统发育上有着重大渊源。北半球的踝节类与南方奇特的有蹄类是最重要的古有蹄类，比起钝脚目和恐脚目有着更为深远的影响。人们相信鲸类与中兽类有着相当紧密的亲缘关系，但究竟是中兽演化出鲸类还是二者有一共同祖先尚未有十分明确的答案。值得一提的是，海象等鳍脚类的祖先也出自踝节目的熊狗科（Arctccyonidae）。安氏中兽在科普作品中的名气远超它的所有亲戚，可以说是大多数动物进化类与古生物类读物哺乳动物进化阶段一个不可绕过的话题，这可能就是由于它的神秘身世和硕大体型以及所在门类重要的历史地位吧。不管怎样，以安氏中兽为代表的中兽科动物在自己倒下的同时已经成功地与肉齿目完成了食物链顶端权位的交接。这之后的食肉动物变得更加专业化了，具备了裂齿的肉齿目对食肉习性更为适应，而中兽类也完成了大自然赋予它们的进化使命。-----生活习性 : 它是一种原始、身体粗壮的哺乳动物，类似于有蹄类的鬣狗，生存于4500-3600万年前的始新世。它的四肢很短，而身体很长，有长的尾巴，脚上有蹄。它的鼻端很长，有锋利的牙齿及扁平的颊齿，可以用来咬碎骨头。不过由于只有头颅骨被发现，故究竟安氏中兽是掠食者，或是食腐肉不清楚。安氏中兽属有蹄哺乳动物，在亲缘关系上其实更接近于偶蹄目动物，因此在某种意义上被戏称作“披着狼皮的羊”。新的理论表明安氏中兽是不典型的掠食性动物。它是无所不吃，比如肉食、腐尸、骨头、植物或者软体动物而不是捕食动物。安氏中兽可以把刚被捕杀的动物尸体进行存储，并且由于它体型强大，其他更小的掠食性动物被吓跑。安氏中兽没有适合撕开食物的裂齿。从它的撕开食物的力量估计，安氏中兽最有可能是吃已灭绝的雷兽，不论是猎食或是吃其尸体的腐肉。蒙古安氏中兽是一种奇怪的肉食有蹄动物，对它所知不多。拥有小型蹄趾，而非爪子，但这种动物却发展出极长的有力双颚，并配有强劲的牙齿。它们会猎食与其相近的草食有蹄动物。对中爪兽的了解仅来自一个头颅与一些化石骨头碎片，但是，它的长相被认为和一种知名的有蹄草食动物，即中爪兽，非常相像。由于这种动物拥有小型蹄趾而非锋利爪子，却同时具有如此有力的双颚，意指它们就像部分人士所曾提出的一样，是以腐肉为食的大自然清洁队，或是食用龟肉。它们的牙齿出现严重的磨损痕迹，并且不像其它多数的肉食动物，只是单纯用来撕裂肉类。中爪兽（mesonychids）在亚洲、欧洲与美洲都有发现，蒙古中爪兽的骨骸则在蒙古找到。中爪兽属于肉食性的有蹄动物。其中最大的是蒙古中爪兽，仅由一只头颅而闻名。该族群的特质是拥有犬科般强有力的双颚。中爪兽的化石通常在水边寻获，而且只有单个，所以这些动物可能是沿河岸与潮汐线而居的腐食独居动物。",
                    "src": "./static-2/安氏兽.jpg"
                },
                {
                    "name": "罗德侯鲸演化",
                    "time": "4650万年前",
                    "description": "罗德侯鲸，是原鲸科其中的一属，第一个化石是于2001年在巴基斯坦的俾路支省发现，估计生存于4700万年前。 罗德侯鲸的盆骨已与脊骨及后肢融合，并有分化的牙齿。 它的踝骨支持了罗德侯鲸是偶蹄目演化的直接连结，并推翻了很多指鲸鱼是由中兽目衍生而成的理论。 罗德侯鲸踝骨结构中的滑车是双轴式的，在哺乳动物中只有偶蹄目有这个特性。 罗德侯鲸肯定是半水中动物，后肢大而有蹼，用以在水中推进。",
                    "src": "./static-2/罗德侯鲸演化.jpg"
                },
                {
                    "name": "始祖象出现",
                    "time": "4300万年前",
                    "description": "始祖象 (Moeritherium)，于一百年前发现于非洲北部,，生活在距今约 3 千至 3 千 8 百万年的始新世晚期至渐新世早期。 大量的化石及详细的形态学研究表明，始祖象仅有现代的猪那样大，生活方式可能与河马相近。 它的身体较长，四肢粗壮，脚掌宽阔，脚趾的末端有扁平的蹄甲，尾巴短而细。",
                    "src": "./static-2/始祖象出现.jpg"
                },
                {
                    "name": "大角雷兽",
                    "time": "4300万年前",
                    "description": "大角雷兽（学名Embolotherium），又名锤鼻雷兽或雷犀，哺乳纲、真兽亚纲、奇蹄目的一属。是雷兽科下一属已灭绝的哺乳动物，生存於始新世晚期的蒙古。它的特征是那在头颅骨前端上的突出物。这个骨突就像是一个破城锤。大角雷兽的化石包括有12个头颅骨、几个颚骨及其他骨骼部份，都是在内蒙古的古脑木根地区及外蒙古发现。",
                    "src": "./static-2/大角雷兽.jpg"
                },
                {
                    "name": "鬣(liè)齿兽",
                    "time": "4100万年前",
                    "description": "鬣齿兽（Hyaenodon），又名肉齿兽，是鬣齿兽科已灭绝的一类。其下的巨鬣齿兽是大型陆上肉食性哺乳动物的一员。鬣齿兽是高度专化的掠食者，于4100万年前的始新世晚期出现，已知最早的种类为我国山西发现的垣曲鬣齿兽（Hyaenodon yuanchuensis）直至1600万年前的中新世仍然存在。[1]它们窄长的颚部强而有力，很适合咬紧及咬碎东西。它们的头颅骨很巨型，但脑部却很细小。它的长头颅骨上有很窄的吻，比较犬科的吻算是较大。它的颈部较头颅骨短，身体则长及粗壮，有很长的尾巴。前脚及后脚上都有五趾，第一趾比其他的脚趾较短。鬣齿兽属中最大的是巨鬣齿兽（Hyaenodon gigas），肩高达1-1.4米及长3米以上，重250-400公斤（在我国内蒙二连浩特地区发现过更大的未定种化石）。小型的种如北美的鼬鬣齿兽（Hyaenodon mustelinus）肩高只有30厘米。-----生活习性:从鬣齿兽的头颅骨可知它们有敏锐的嗅觉。一些物种可能专门是吃腐肉的，但其他的明显是主动的掠食者。鬣齿兽外观有些像现今的鬣狗，但有更长而有力的颌骨，尖锐的牙齿及良好发长的裂齿，故可见它们有不同的食性。鬣齿兽是否具备群居习性，目前还不能确定，它们更可能多数为独居动物或成对居住，没有固定的群体组织。相比于其他肉齿目动物，鬣齿兽四肢较为修长，更适应在开阔地区活动-----发展历史:在三千万年的发展历程中，鬣齿兽家族兴旺，种类繁多。就在肉齿目于晚古新不断发展的同时，从古新世的一种古食肉类--古猫兽类当中，分化出了一支进步的类型，它们的裂齿由第四上前臼齿和第一下臼齿组成。从此，一种新型的食肉动物--食肉目哺乳动物出现了。这种前移的裂齿构造使撕裂肉食的工作更有效率，再加上其它一系列进步的体制结构，食肉目哺乳动物开始发展起来，当大多数肉齿目在始新世末灭绝以后，它们从渐新世晚期开始完全取代了肉齿目的地位。直到中新世中期，鬣齿兽属宣告灭绝，肉齿目也在中新世末最终灭绝。鬣齿兽属出现在始新世，体型差距较大，小型种类如狐狸般大小，也有大型的麦氏鬣齿兽，巨鬣齿兽，游荡鬣齿兽，蒙古鬣齿兽，兰州鬣齿兽等几个种类。鬣齿兽是非常成功及多样化的动物，但随着环境和猎物的改变和食肉目的兴起。它们约于早新近纪灭绝。",
                    "src": "./static-2/鬣齿兽.jpg"
                },
                {
                    "name": "灵长目分支",
                    "time": "4000万年前",
                    "description": "灵长总目现在被认为是真兽分支 (即胎盘哺乳动物)的四个主要亚分支之一（其他三个为：劳亚兽总目、非洲兽总目和贫齿总目），通常不进行分类等级的讨论，但被称为队列、大目或超目。 四个类群之间的关系和胎盘结构的标志仍有争议。 八千五百万到九千五百万年前，在白垩纪时期，灵长总目很可能从劳亚兽的姊妹群中分离出来，并在后来成为欧洲的劳亚古陆的岛群中发展。",
                    "children": [
                        {
                            "name": "原猴亚目",
                            "time": "4000万年前",
                            "description": "原猴亚目 （学名： Strepsirrhini[1]）是 哺乳纲 灵长目 的一个 亚目，通称为 原猴，是灵长目的 基群，主要分布于 非洲 的 马达加斯加 以及 东亚 和 南亚。 新的分类方法中原猴已不包括 跗猴科 （Tarsiidae）。 本亚目包括 [1]： 原猴大多像小型的 啮齿动物 和食虫动物。 尾巴比较长。 四肢行走。",
                            "src": "./static-2/原猴亚目.jpg"
                        },
                        {
                            "name": "简鼻亚目",
                            "time": "4000万年前",
                            "description": "简鼻亚目，包含眼镜猴以及所有类人猿和人类，是灵长目的一个分支。 始镜猴科，已灭绝的原猴亚目，与眼镜猴较为接近，被认为是简鼻亚目中最原始的物种。 简鼻亚目相较于原猴，其上唇并非直接连接鼻子或牙床，因此能够做出更多面部表情。 它们的脑部与身体比例较大，主要感官是视觉，拥有眼后板。 简鼻亚目物种通常在白天活动，具有三色视觉。 它们的手和脚适合运动，如长臂猿科和猩猩的钩状手，或人类的双足。",
                            "src": "./static-2/简鼻亚目.jpg"
                        }
                    ],
                    "src": "./static-2/灵长目分支.jpg"
                },
                {
                    "name": "龙王鲸演化",
                    "time": "4000-3700万年前",
                    "description": "龙王鲸是鲸目龙王鲸科龙王鲸属哺乳动物 [4]，是现代鲸的近亲 [5]。龙王鲸身躯庞大，光滑且呈流线型，颌前部长有尖尖的牙齿，颌后部长有锯齿状的牙齿。龙王鲸又称为“帝王蜥蜴”，因为最早将它误认为海生爬行动物。 [6]龙王鲸生活在4000万年前远古海洋里，19世纪早期在美国的阿拉巴马州第一次发现了它的骨骼化石 [7]。龙王鲸终日悠游在浅海地区 [8]，像鳗鱼一样游泳，游泳能力差，必须通过把鼻子伸出水面的方式来换气 [9]。龙王鲸为肉食性 [10]，主要以海中的鱼类、乌贼、海龟和其他海洋哺乳动物等为食 [11]。距今3400万年前，全球气候发生了巨变，平均气温下降了8℃，极地海洋开始结冰，导致海平面下降。龙王鲸生活的大片浅海消失，变化的洋流、变冷的海水使它们饥寒交迫，逐渐走向灭绝。",
                    "src": "./static-2/龙王鲸演化.jpg"
                },
                {
                    "name": "矛齿鲸",
                    "time": "4000万年前",
                    "description": "矛齿鲸(Dorudon atrox)矛齿鲸(Dorudon atrox)学名意为拥有矛状牙齿的鲸鱼，是龙王鲸科中的一个属，泛指矛齿鲸亚科的所有生物。体长5米左右，重约600公斤，生活在约3800万年前的始新世。肉食性，以鱼类、乌贼为主食。矛齿鲸生活于温暖的海域，北美洲与埃及都有发现它们的化石。由于矛齿鲸的外观与龙王鲸极为相似，所以矛齿鲸原先被认为是未成年的龙王鲸，但是后来矛齿鲸的幼鲸化石被发现，古生物学家才发现它们是不同种。虽然矛齿鲸看起来相当类似现代鲸类，不过它们没有办法像现代鲸类那样有效率的使用超音波。它们的鼻孔位在嘴与头顶的中间，就跟其他的龙王鲸类一样。",
                    "src": "./static-2/矛齿鲸.jpg"
                },
                {
                    "name": "爪兽",
                    "time": "4000万年前",
                    "description": "爪兽是一种很奇怪的动物，它身高有3米，常用指关节行走以保护长长的爪子。它那强有力的四肢是非常有效的防卫武器。但是更多时候，爪兽用它们的爪子钩下树枝，以便吃到最鲜嫩树叶。爪兽像大猩猩一样行走，像熊猫一样吃东西，但是现代动物中和它们亲缘关系最近的种类却是马。几千万年前，爪兽曾在北美、欧亚和非洲等大陆地区广泛生活过，并在大约一百万年前从地球上消失。爪兽是一种比较“边缘”的物种，从来没有真正繁盛过，保留下来的化石非常稀少、零散。爪兽是最令人费解的史前怪兽之一:在它生活的时代,它的足迹遍布亚洲、欧洲、北非和北美洲;爪兽有长的前肢、短的后肢和奇怪的长头—现代动物中和它亲缘关系最近的种类竟然是马。爪兽的体型介于山羊和猩猩之间,最大的爪兽站立时大约3米高。又大又长的头骨是爪兽和马最像的特征。爪兽的嘴里只长着用于咀嚼的后牙,而没有前牙。长的前肢能为爪兽提供一个好的攻击距离,但是这种爪子的构造是用来挖掘树根及扳掉树枝的,所以它的前肢在战斗时不能起到太大的作用",
                    "src": "./static-2/爪兽.jpg"
                },
                {
                    "name": "禾本科演化",
                    "time": "3500万年前",
                    "description": "禾本科植物从类似Joinvillea的植物演化来的可能性较大。 由类似Joinvillea的植物演化而来的最原始的禾本科植物是草质，必生或具短根茎，具相对短的叶，茎具若干节，相对简单的总状或圆锥花序，小穂具若干小花，苞叶（颖片）未分化，花为3基数，花被3或6，雄蕊6，二组子房1室，单胚珠，花柱3，风媒花植物。",
                    "src": "./static-2/禾本科演化.jpg"
                },
                {
                    "name": "始新世-渐新世灭绝事件",
                    "time": "3400万年前",
                    "description": "始新世-渐新世灭绝事件 是指 始新世 结束至 渐新世 开始之间的过渡時期，許多動植物滅絕的事件 [1]。 此時許多海洋以及水生生物遭到滅絕， 有蹄類 踝節目 動物就是其中之一。 另外，某种γ逆转病毒感染了当时几乎所有真兽类，并遗留下了 ERV-Fc，并一直持续到 中新世中期灭绝事件。",
                    "src": "./static-2/始新世-渐新世灭绝事件.jpg"
                },
                {
                    "name": "渐新世",
                    "time": "3400-2300万年前",
                    "description": "生物发展史上称从六千五百万年前到现代时间段为新生代，这包括地史上的第三纪和第四纪，第三纪又分为古新世、始新世、渐新世、中新世和上新世五个时期。渐新世是第三纪的第三个世，约开始于3650万年前，结束于2330万年前。渐新世时形成的地层称渐新统，位于始新统之上、中新统之下。1833年，英国C.莱伊尔把第三纪分成始新世、中新世和上新世。1854年，E.von贝利希在德国发现早于中新世、晚于始新世的沉积物，从而提出渐新世。当时特提斯海周围热带植物繁茂，德国的大部分地区温暖潮湿，因此 ，形成大规模的褐煤。在渐新世时海生动物有孔虫和货币虫占优势，陆生无脊椎动物丰富多样。在波罗的海区有许多昆虫，如蝴蝶、蜜蜂、蚂蚁和蜘蛛。陆生脊椎动物也丰富多样，分布于北美、欧洲、非洲和亚洲。渐新世被认为是一个重要的过渡时期，是一条连接“炎热的始新世时期的古老世界和生态系统更具有现代特征的中新世”的纽带。渐新世时期生态系统发生的一个重要改变是草原在全球的扩张，而热带阔叶林则萎缩至赤道一带。标志渐新世开始的事件是一起被称为大置换的大规模物种灭绝事件，当时欧洲的动物群，除了区域性的啮齿类动物和有袋类动物之外，都被来自亚洲的动物群所取代。渐新世和中新世则没有显著的全球性事件为其分野，而是各个地区相继从较温暖的渐新世晚期（2,600-2,300万年前）进入较寒冷的中新世。",
                    "src": "./static-2/渐新世.jpg"
                },
                {
                    "name": "简鼻亚目分支",
                    "time": "3000万年前",
                    "description": "简鼻亚目包括了眼镜猴、猴子、猿类和人类，它们主要是昼间活动的，有较大的大脑和眼睛，有较短的鼻子和嘴巴。 - 约 4000 万年前，简鼻亚目分化为两个下目：跗猴型下目和类人猿下目。 跗猴型下目只包括了眼镜猴，它们是一种非常原始的灵长类动物，有着特殊的跗骨，可以在树上跳跃。 类人猿下目包括了猴子、猿类和人类，它们是一种较为进化的灵长类动物，有着更复杂的社会行为和认知能力。",
                    "children": [
                        {
                            "name": "阔鼻小目",
                            "time": "3000万年前",
                            "description": "阔鼻小目（又称新世界猴；学名：Platyrrhini）是产于中美与南美的四科灵长目动物。 新世界猴与旧世界猴合称为猴。",
                            "src": "./static-2/阔鼻小目.jpg"
                        },
                        {
                            "name": "狭鼻小目",
                            "time": "3000万年前",
                            "description": "狭鼻小目（Halicmetus ruber），脊索动物门类人猿下目动物，鼻孔都是狭窄及向下的。 狭鼻小目大部份 物种 都是 两性异形 的，且大都不是一夫一妻的。 很多但不是全部物种都以群族方式生活。 它们是 非洲 及 亚洲 的原住民。 狭鼻小目（Catarrhini）是 灵长目 简鼻亚目 中三个 小目 之一，包含了 旧世界猴 （猴总科）及 猿 （人猿总科）。 后者再细分为 长臂猿科 及 人科。",
                            "src": "./static-2/狭鼻小目.jpg"
                        }
                    ],
                    "src": "./static-2/简鼻亚目分支.jpg"
                },
                {
                    "name": "巨犀",
                    "time": "2700万年前",
                    "description": "外形特征巨犀类的特征除了身材向巨大方向发展外, 它的颈部和四肢伸长更加后缩[ 从第三上前臼齿( P3)上方进一步后缩到第四上前臼齿( P4)之上] , 前颌骨前部逐渐往下弯, 第一上、下门齿变得越来越粗大, 第二、三对门齿、犬齿和第一对前臼齿逐渐退化, 进而消失。因此, 巨犀家族的后期种属演变得如此巨大是有一个过程的, 是逐渐的。 [1]头上无角，头、颈和四肢都很长，站起来肩部高可达5—6米，体全长12—13米，体长9米，体重15.吨，为已知最大的陆生哺乳动物。头骨长而低，长1米左右，但与其庞大的身躯相比，显得细小。额部隆起但无角；鼻骨光滑，向下弯曲。颈很长，肢长柱状。头上无角。牙齿结构简单，牙沟距椒子沟很近， [2]有一对钝门齿；颊齿低冠，前臼近长方形，第一前臼齿原尖特殊，具有很大的第四尖及发育不好的后尖；第二前臼原尖形成一长钩状脊与第四尖相连，后尖细而不与第四尖相连；第三前臼齿的后尖细而突出，弯曲于第四尖之内；臼齿简单；上第一臼齿具不发育的反前刺；上第三臼齿梯形，构造原始。估计主要以高层树枝上的嫩叶为食。-----生活环境:生存于亚欧大陆的第三纪中期（始新世——中新世），中国是这类动物的起源区和进化发展的中心。最早和比较原始类型的化石发现于我国始新世地层中 [3]。现生犀牛仅生活在南亚、东南亚、撒哈拉沙漠以南的非洲大部分地区和北非的部分地区。它们生活在热带和亚热带的稀疏草原和灌木丛生的地区。 它们吃各种植物, 并以多汁的植物为主。 现生的犀牛中仅非洲白犀( Ceratotherium simum)居住在草原上, 以食草为主。 亚洲犀牛主要吃与它的身高差不多的, 或 [1]较低处的植物, 如果子、树叶、嫩树枝、树皮、草和芦苇等。它们是喜欢潮湿温暖的动物。 根据现生的犀牛的生态来推断, 很可能巨犀也是喜欢潮湿温暖的动物。-----分布范围:产于亚洲、欧洲。蒙古、中国、土耳其、哈萨克斯坦、巴基斯坦都有发现。中国在内蒙、宁夏、云南始新世地层中发现较原始的化石，是最早的化石,被取名为小巨犀.巨犀家族是亚洲土生土长的土著居民, 也就是说, 它们起源于亚洲, 主要分布在亚洲, 后期可能稍往西扩展到东欧的高加索、罗马尼亚和南斯拉夫等地, 从未到过北美、西欧和非洲。 在亚洲的中国、蒙古、哈萨克斯坦、格鲁吉亚、巴基斯坦等地都发现过它们的踪迹。 其中以我国发现的化石最为丰富, 种类最多。巨犀家族最早、最原始的成员为在我国内蒙古二连盆地中始新统沙拉木仑组中发现的沙拉木仑小巨犀(Juxia sharamurunensis),最晚的代表为在我国新疆准噶尔盆地上渐新统中发现的霍尔果斯准噶尔巨犀(Dzungariotherium orgosensis)和巴基斯坦布格提( Bugti)地区的 布格提副巨 犀(Paraceratherium bugtiense)。 这样巨犀家族的地质历史的分布为从中始新世到晚渐新世",
                    "src": "./static-2/巨犀.jpg"
                },
                {
                    "name": "须鲸逐渐分化",
                    "time": "2500万年前",
                    "description": "研究小组的发现表明，鲸须实际上从牙龈演化而来，而不是牙齿本身。 经过一段演化时间后，这些柔软的组织逐渐变得更加复杂并最终发展成为鲸须。 这些转变发生在鲸类牙齿消失之后，它们也从咬食更大的动物变为啜食大量较小的动物。 Marx和Fordyce相信，鲸须的进化是为了更有效地把猎物含在嘴里。 “通过捕食较小的猎物，须鲸移到了食物链的低处，相比位于食物链的顶端，它们可以拥有更多的资源。",
                    "src": "./static-2/须鲸逐渐分化.jpg"
                },
                {
                    "name": "剑齿虎亚科",
                    "time": "2500万年前",
                    "description": "形态特征:巨大的上犬齿长达20厘米，可能是用来刺击乳齿象之类的大型草食动物。斯剑虎属的下述几种身体适应性变化使人推想到可能存在这样的狩猎技能：颅骨能以附着强健的颈目肌调节以利低头动作；下犬齿退化；腭能张开到约90°角，使上犬齿能不受限制地活动。臼齿形成剪刀状，而无磨研表面的痕迹。这一属许多成员的骨头曾在加利福尼亚、洛杉矶拉布雷亚（La Brea）大牧场的沥青坑里找到，显然是剑齿动物捕食大型草食动物时两者同时陷入沥青。刃齿虎属的祖先巨颏虎属，是上新世到中更新世时的中等大小剑齿猫科动物。狭义科学上真正的剑齿虎指的是短剑剑齿虎属（Machairodus），可以直接被称作剑齿虎。是一类剑齿较短的剑齿虎亚科成员，体型较刃齿虎小，不是很有名气。-----简介:剑齿虎亚科Machairodontinae，哺乳纲、真兽亚纲、食肉目的一亚科，与虎近似。上、下颁骨张开可达90°，上犬齿特别发达，扁平而尖锐，有的边缘呈锯齿状，齿冠高，可达5-6厘米。中新世至更新世，广泛分布于亚洲、欧洲、非洲及北美。我国河北、河南、山西、云南等地上新统及下更新统中化石很多 [1]。-----栖息地:普遍认为剑齿虎亚科都是生活在因冰河时期造成的寒冷地区。当中一些更确定它们生活在下雪的地方，而剑齿虎亚科的历史可追溯至温暖气候的渐新世，它们的多样化一同与生物体系成长。它们最终于1万年前才灭绝。-----猎食技巧:剑齿虎亚科怎样猎食一直备受争议。原先认为它们是以其犬齿直接咬死猎物，但是其牙齿却很易碎，对于大型的猎物会很易破坏牙齿，并影响猎食。一些科学家认为它们是以其牙齿割开大型动物的腹部，待猎物失血而死亡。当剑齿虎亚科猎食大型的有蹄动物时，它们的牙齿可以同时咬破动脉及静脉。它们的猎食方法却仍然会伤害牙齿，但却比前者有较低的风险。若剑齿虎亚科会表现自己，它们可能会征服该猎物才施以致命的一击。-----植物:在植物界中，高等植物区系与现代的几乎没有什么差别，低等植物中淡水硅藻较为常见。植物地理区已与现代近似。在古地理方面，在大陆边缘地区发生了小规模的海侵。在地壳运动方面，到了上新世，许多古近纪时形成的新山系继续隆起，山势基本与现代相近，如欧洲的阿尔卑斯山、亚洲的喜马拉雅山、南美的安底斯山等等。-----动物:哺乳动物又有新的发展，以形体增大为其特征。在海生无脊椎动物中，有孔虫类中的大型货币虫已经消失，为小型的有孔虫类所代替；六射珊瑚大量发展，形成大型珊瑚礁。淡水介形虫等大量繁育。在植物界中，高等植物区系与现代的几乎没有什么差别，低等植物中淡水硅藻较为常见，植物地理区已与现代近似。在古地理方面，新近纪只在大陆边缘地区发生小规模海侵，最后一次海退导致了第四纪的开始。在地壳运动方面，到了新近纪上新世，许多古近纪形成的新山系继续隆起，山势基本上与现代相近，如欧洲的阿尔卑斯山、亚洲的喜马拉雅山、南美洲的安第斯山等等。中国西部隆起成为山地，东部继续下降成为范围很广的凹陷平原，在隆起区沿断裂带发生连续的玄武岩喷发。",
                    "src": "./static-2/剑齿虎亚科.jpg"
                },
                {
                    "name": "雕齿兽",
                    "time": "2500万年前",
                    "description": "雕齿兽(Glyptodon) 是一种从化石中发现的犰狳状食草哺乳动物，生活在上新世、更新世期间的南美洲包括从阿根廷的彭巴斯草原、乌拉圭到巴西一带。存活直到更新世晚期（距今约30,000-8,500年前）。并在2千5百万年前北美洲及南美洲因巴拿马地峡的出现而连结时首次出现在美国西南部。它们在约于一万年前灭绝。相信住在它们附近的原住人类猎杀它们及以它们的壳来作为遮蔽。属于贫齿类动物，雕齿兽属，除下部外整个躯体包在由骨片形成的甲壳内。这个目下包括有食蚁兽、树懒、已灭绝的地懒及犰狳。",
                    "src": "./static-2/雕齿兽.jpg"
                },
                {
                    "name": "新近纪",
                    "time": "2300-260万年前",
                    "description": "海洋和大陆的植物群和动物群与现代相当。哺乳动物和鸟类仍然是占主导地位的陆生脊椎动物，并发展出多种形式来适应不同环境。第一个原始人，人类的祖先，出现在非洲并扩散到欧亚大陆。因为较冷的气候，许多热带植物物种被落叶森林和草地的取代。草因此多样化，大大地促进食草哺乳动物的进化，创造了许多食草动物如马，羚羊，和野牛。-----植物:在植物界中，高等植物区系与现代的几乎没有什么差别，低等植物中淡水硅藻较为常见。植物地理区已与现代近似。在古地理方面，在大陆边缘地区发生了小规模的海侵。在地壳运动方面，到了上新世，许多古近纪时形成的新山系继续隆起，山势基本与现代相近，如欧洲的阿尔卑斯山、亚洲的喜马拉雅山、南美的安底斯山等等。-----动物:哺乳动物又有新的发展，以形体增大为其特征。在海生无脊椎动物中，有孔虫类中的大型货币虫已经消失，为小型的有孔虫类所代替；六射珊瑚大量发展，形成大型珊瑚礁。淡水介形虫等大量繁育。在植物界中，高等植物区系与现代的几乎没有什么差别，低等植物中淡水硅藻较为常见，植物地理区已与现代近似。在古地理方面，新近纪只在大陆边缘地区发生小规模海侵，最后一次海退导致了第四纪的开始。在地壳运动方面，到了新近纪上新世，许多古近纪形成的新山系继续隆起，山势基本上与现代相近，如欧洲的阿尔卑斯山、亚洲的喜马拉雅山、南美洲的安第斯山等等。中国西部隆起成为山地，东部继续下降成为范围很广的凹陷平原，在隆起区沿断裂带发生连续的玄武岩喷发。",
                    "src": "./static-2/新近纪.jpg"
                },
                {
                    "name": "印度与亚洲碰撞",
                    "time": "2200万年前",
                    "description": "印度-亚洲大陆碰撞是地质历史时期最重大的构造事件之一，形成“世界屋脊”青藏高原和雄伟的喜马拉雅山脉(图1)，对亚洲乃至全球的海陆分布格局、气候环境和生物多样性都产生了深远的影响。 青藏高原作为研究陆-陆碰撞最为理想的天然实验室，对印度-亚洲大陆初始碰撞时间和碰撞动力学过程的研究长期以来一直是固体地球科学领域的前沿和热点。",
                    "children": [
                        {
                            "name": "喜马拉雅山及青藏高原形成",
                            "time": "2200万年前",
                            "description": "自始新世以来，印度洋板块向北俯冲，产生强大的南北向挤压力，致使青藏高原快速隆起，形成喜马拉雅山地，这次构造运动称为喜马拉雅运动。 喜马拉雅运动分早、晚两期，早喜马拉雅运动，印度洋板块与亚洲大陆之间沿雅鲁藏布江缝合线发生强烈碰撞。 喜马拉雅地槽封闭褶皱成陆，使印度大陆与亚洲大陆合并相连。 与此同时中国东部与太平洋板块之间则发生张裂，海盆下沉，使中国大陆东部边缘开始进入边缘海-岛屿发展阶段。",
                            "src": "./static-2/喜马拉雅山及青藏高原形成.jpg"
                        }
                    ],
                    "src": "./static-2/印度与亚洲碰撞.jpg"
                },
                {
                    "name": "非洲板块与亚洲碰撞",
                    "time": "2000万年前",
                    "description": "",
                    "src": "./static-2/非洲板块与亚洲碰撞.jpg"
                },
                {
                    "name": "大地懒",
                    "time": "1700万年前",
                    "description": "大地懒（学名：Megatherium）是大地懒属哺乳动物的统称，又名大懒兽，是一种奇特的贫齿类动物， [6]大地懒可以长到五、六米长，三、四吨重，完全可以和亚洲象媲美。它们的头部比现存的树懒更显狭长，身躯则有些像熊，浑身长着又粗又长的毛，前后肢都长着三个巨大的爪子，后面还拖着条一米多长的粗壮有力的尾巴，脚上还长有长长的爪子，这些爪子意味它们无法把脚平放在地面上，所以跟食蚁兽一样，它必须用脚侧行走。 [1]大地懒是生活在南美洲大陆的最大型哺乳动物之一。 [6]根据它的化石研究，大地懒居住在数万年前更新世的阿根廷彭巴斯大草原，也可见于北美洲、中美洲和南美洲的其他地方。 [6]大地懒栖息在南美洲的林地、草地和荒野地带，主要在地面上活动，行动比较迟钝、笨重，能像大食蚁兽一样能用后肢脚侧直立行走，以足外缘着地，脚印呈逗号的形状。它们主要以树的枝叶为食，偶尔它们也会捕捉动物性食物，用巨爪将猎物抓伤，然后用强有力的前臂使猎物就范，而更多的情况可能是吃腐肉或从其他食肉动物的口中夺食。 [2]大地懒灭绝的时间相对较近，这意味着科学家能找到几种地懒的毛样本，因为毛是DNA非常好的来源。科学家们可能使用二趾树懒的卵合成大地懒的胚晶，但是，胎儿将很快大得大过它的“代孕妈妈”，当然，这些动物并非一科，成功复原的可能性极低",
                    "src": "./static-2/大地懒.jpg"
                },
                {
                    "name": "巨齿鲨",
                    "time": "1600万年前",
                    "description": "巨齿鲨（学名：Carcharocles megalodon），又名巨齿耳齿鲨， [20] [31]是耳齿鲨科拟噬人鲨属已灭绝的史前鲨鱼，也是已知体积最大、咬合力最大的顶级海洋掠食者。 [10-11] [17]成熟的成年巨齿鲨平均长度为10.2米，最长或可达25米；体重在30'000~65'000千克之间。其身体呈鱼雷形，有圆锥形的鼻子，巨大的胸鳍和背鳍，以及强有力的新月形尾巴。 [17]该物种拥有强大的咬合力，其下颌力量足以压碎一辆小型汽车。 [25]巨齿鲨分布极广，在欧洲、非洲、北美和南美洲的大部分地区均能发现其化石； [2]该物种主要栖息在温带和亚热带的近岸温暖海水中，同时也能够适应较高纬度的冷水环境， [2]这主要是因为它们拥有温血动物的一种特征，即能通过游泳肌肉的收缩来产生热量，从而实现体温调节功能。 [17]巨齿鲨为肉食性动物， [17]主要捕食鱼类和海洋哺乳动物； [17]猎食方式随猎物而异。 [30]巨齿鲨起源于渐新世晚期（约2800万年前）， [21-22]到中新世晚期，其分布范围已扩展到最大覆盖范围， [6] [18]但随着上新世全球气温转寒， [30]该物种种群数量逐渐减少， [17]最终灭绝于上新世末期（约260万年前）",
                    "src": "./static-2/巨齿鲨.jpg"
                },
                {
                    "name": "猿类迁徙",
                    "time": "1600万年前",
                    "description": "这一切都促使了非洲的早期古猿类向欧亚大陆辐射迁徙，去寻找新的生存环境。 而在这个时期，欧亚大陆的气候四季分明，冬季也比现在温暖，森林和林地分布广泛，这恰好为非洲古猿类的迁入捉供了有利的生活环境。 于是，非洲的古猿类群向西扩散到西欧沿海，向东经南亚一直迁徙到东亚地区，形成了中新世古猿大辐射的壮观图景。",
                    "src": "./static-2/猿类迁徙.jpg"
                },
                {
                    "name": "人类祖先形成",
                    "time": "1300万年前",
                    "description": "科学家们估计，人类大约在距今500万到700万年之间，从他们与 黑猩猩 的共同祖先分支出来。 其后发展的若干人属物种和亚种，已告 灭绝。 这些包括栖息在 亚洲 的 直立人 、栖息在 欧洲 的 尼安德塔人。 古智人（早期智人）大约在距今25万年到40万年间演变出来。 关于 解剖学上的现代人类 的起源，科学家所持的主流观点是“ 现代人类晚近非洲起源说 ”或称“源出非洲”假说。",
                    "src": "./static-2/人类祖先形成.jpg"
                },
                {
                    "name": "气候变冷",
                    "time": "1000万年前",
                    "description": "变冷原因 : 热核反应多半是因为太阳内部发生猛烈的热核反应，其光照不均衡可能与这有关。当太阳内部的温度升高和压力增大时，太阳就会“膨胀”，地球便会得到更多的光和热。最好到太空去研究这些细节，那样会方便得多。阿布杜萨马托夫还有一个依据：火星也是定期地变暖和变冷，而且时间同地球上一模一样。这是NASA不久前的研究成果。但红色星球上既没有火星人，更不可能有工厂、汽车和别的温室气体产生源。这就意味着，不管地球上的气候，还是火星上的气候，都是由太阳来左右。普尔科夫天文台的工作人员已经设计出一种特别的仪器，宇航员将在2008年将它带到国际空间站，从“天体测量学”的角度去测定太阳形状和直径的变化情况，这些数据会有助于更精确地预测出全球变冷的具体时间和强度。",
                    "src": "./static-2/气候变冷.jpg"
                },
                {
                    "name": "梅尔维尔利维坦鲸",
                    "time": "990万年前",
                    "description": "梅尔维尔利维坦鲸（学名：Livyatan 梅尔维尔鲸是新近纪最强大的海洋哺乳动物。梅尔维尔鲸体长18米，重65吨，体型与现在的雌性抹香鲸相当；牙齿长达35厘米，比巨齿鲨的牙齿长。 [6]梅尔维尔鲸因符合经典小说 《白鲸》（Moby Dick） [11]的描述，被研究者以小说作者梅尔维尔（Herman Melville）命名。 [7]梅尔维尔鲸的化石发现于距今1300万-1200万年的中新世岩层中。 [8]梅尔维尔鲸因受其巨大的头部和庞大体型的影响，游泳速度并不快， [9]咬合力惊人，它的脑油器可以对猎物进行声音定位；头部可以用作攻击猎物的武器。 [10]有研究表明梅尔维尔鲸的灭绝和气候变冷有一定的关系，气候变冷导致梅尔维尔鲸的食物减少，捕食越来越困难，同时，和巨齿鲨的竞争关系也加快了其灭亡的进程",
                    "src": "./static-2/梅尔维尔利维坦鲸.jpg"
                },
                {
                    "name": "巨猿出现",
                    "time": "700万年前",
                    "description": "作为生活在地球上体型最大的一种灵长类动物，巨猿在200万年前出现，大约30万年前绝灭。 史前动物方面的专家道格尔·狄克逊在《恐龙时代：恐龙时代的故事》一书中这样描述巨猿：勇猛的巨猿能够用后腿站立，站立后能达到非常高的高度，它咆哮起来震耳欲聋，生活在中国树木丛生的山区。 上世纪30年代，美国科幻电影《金刚》塑造了一个非常经典的巨猿形象，也就是电影的主角——金刚。",
                    "src": "./static-2/巨猿出现.jpg"
                },
                {
                    "name": "地中海干涸",
                    "time": "560万年前",
                    "description": "在距今500万-600万年前，连接大西洋和地中海的海洋通道关闭，地中海的大部分地区干涸，巨大的盐湖覆盖着曾经为海床的其他部分。 这就是所谓的“Messinian Salinity Crisis”，是新生代地球上最剧烈的地质事件之一。 多年来，地质学家一直在辩论该海洋通道最初闭合的原因，其中的两个假设是：全球海平面的下降和构造隆起。",
                    "src": "./static-2/地中海干涸.jpg"
                },
                {
                    "name": "人类祖先的出现",
                    "time": "500万年前",
                    "description": "科学家们估计，人类大约在距今500万到700万年之间，从他们与 黑猩猩 的共同祖先分支出来。 其后发展的若干人属物种和亚种，已告 灭绝。 这些包括栖息在 亚洲 的 直立人 、栖息在 欧洲 的 尼安德特人。 古智人（早期智人）大约在距今25万年到40万年间演变出来。 关于 解剖学上的现代人类 的起源，科学家所持的主流观点是“ 现代人类晚近非洲起源说 ”或称“源出非洲”假说。",
                    "children": [
                        {
                            "name": "乍得人猿",
                            "time": "500万年前",
                            "description": "化石 : 乍得沙赫人的化石是一个比较细小的头颅骨、5块颚骨及一些牙齿。组成的头部同时有进化及原始的特征。脑腔为340-360立方厘米大，与现存黑猩猩的差不多，而比人类的1350立方厘米则小很多。乍得沙赫人的牙齿、眉骨及面部结构都与人类有明显的分别。由于头颅骨的失真，故进行了一个三维的电脑重组。单从其枕骨大孔推论，它确是双足行走的。然而因为始终未发现它的颅后遗骸，这仍然是未知之数。它的犬齿与其他中新世猿相似。乍得沙赫人的化石是在乍得被发现，介乎于2001年7月至2002年3月间出土。发现者声称乍得沙赫人是人类从黑猩猩分支出来后最古老的祖先。但是其骨骼的发现地却与其他已发现的人族化石的地方，如东非及南部非洲相距甚远。不过在乍得亦曾于1993年发现了一个羚羊和南方古猿的颌骨。-----影响 : 乍得沙赫人的化石头颅骨（编号TM 266），花名为“图迈”（Touma&iuml;，当地语言意指“生命的希望”），可能是人类与黑猩猩的共同祖先。大部份分子钟指人类及黑猩猩于乍得沙赫人之后的100-200万年间（即500万年前）分支开来，但这说法却不被广泛接受。而最初将乍得沙赫人分类为人类祖先的物种中，亦将人类演化问题复杂化。 若图迈真的是人类的直系祖先，它的面部特征则会令南方古猿的分类出现问题。因为它的眉骨与一些后期的人科（如直立人）相似，但其形态却与南方古猿类、大部份人科化石及现今人类的不同。另一个可能性是图迈与人类及黑猩猩都有关系，但都并非两者的祖先。图根原人的发现者瑞吉特·森努特（Brigitte Senut）及马丁·匹克福特（Martin Pickford）指乍得沙赫人的特征与雌性的原始大猩猩一致。虽然此说法得到支持，但就使得其发现失去重要性，因为在非洲亦有发现一些黑猩猩或大猩猩的祖先。若乍得沙赫人是黑猩猩的祖先近亲，则它的演化历程会蒙上阴影。再者，从乍得沙赫人可知人类及黑猩猩的最后共同祖先并不很像黑猩猩。",
                            "src": "./static-2/乍得人猿.jpg"
                        },
                        {
                            "name": "千年人",
                            "time": "500万年前",
                            "description": "图根原人（Orrorin tugenensis），又名千年人、千禧猿或土根猿，是已知最古老与人类有关的人族祖先，是原人属（或称千年人属）中的唯一种。种小名是以其化石发现地肯尼亚的图根山区命名，也因为第一组化石于2000年被发现，也被叫做千年人或者千禧猿。图根原人是世界第一个已知原始人。利用放射性测年技术、凝灰岩与动物群的关系及磁性地层学，估计出发现化石的地层是属于610-580万年前的中新世。这个发现成为了最古老人科是双足行走的证据。",
                            "src": "./static-2/千年人.jpg"
                        }
                    ],
                    "src": "./static-2/人类祖先的出现.jpg"
                },
                {
                    "name": "地猿出现",
                    "time": "480万年前",
                    "description": "地猿（Ardipithecus）是人科中非常早期的一属，生存在440万年的上新世早期。由于它与非洲的类人猿有很多相似的地方，故它被认为是属于黑猩猩分支而非人类分支。但因其牙齿像南方古猿的牙齿，故大部份认为它是原始人。-----物种 :地猿现有两个物种已被描述，即始祖地猿（A. ramidus）及卡达巴地猿（A. kadabba）。两个物种的遗骸都是在衣索匹亚中部阿瓦什发现。物种简介 : 始祖地猿，又译拉米达地猿或拉密达地猿，又称地猿始祖种或地猿祖先种，是于1994年命名的。它的首个发现的化石估计属于440万年前。后期由约翰尼斯·海利-瑟拉解（Yohannes Haile-Selassie）及沃德盖布瑞尔（Giday WoldeGabriel）所发现的化石，如果是属于始祖地猿的话，则可推前至580万年前。于1992年至1993年期间，由蒂莫西·怀特（Dr. Timothy White）所带领的研究队发现了首个始祖地猿的化石，即17个骨骼碎片，包括头颅骨、颚骨、牙齿及肢骨等，都是从衣索匹亚中部阿瓦什河谷的阿法尔洼地发现。更多的碎片于1994年发现，是完整骨骼的45%。枕骨大孔及脚骨的特征显示它是双足行走的。卡达巴地猿 : 卡达巴地猿估计属于580-520万年前。它的犬齿有原始的特征，与现今人族有所不同。卡达巴地猿相信是人类分支从现今黑猩猩分支分裂后的最早动物。它原先被描述为始祖地猿的亚种，但基于在衣索匹亚发现的牙齿而被提升为独立的物种。生活方式 : 基于地猿的骨头大小，估计它们的体型接近现今的黑猩猩。从始祖地猿的趾骨结构，可见它是可以站立行走。这却引起了人科双足行走起源的问题。因为一般相信双足行走在大草原是最为节能的，但地猿却是生活在森林中而非大草原。词条图册",
                    "src": "./static-2/地猿出现.jpg"
                },
                {
                    "name": "南方古猿出现与演化",
                    "time": "390-370万年前",
                    "description": "南方古猿，是灵长目人科的一属； [3]其体长约为1.5米，体重约为65千克，约有现代人1/3大小的大脑，皮肤上长有长毛，并且能直立行走； [4]牙齿大，下颌宽，面部宽长，颧骨前突非常明显，并有粗大的咀嚼肌。 [5]南方古猿生活在大约450万一250万年前的非洲地区， [6]会在森林里活动，也常常到开阔的草原散步觅食，所以在选择栖息地时，大多会选择既有森林又临近草原的地方。 [4]南方古猿喜群居生活，一个群体往往由一只雄性和数只雌性组成，以雄性古猿为群体的首领，食物主要以植物为主， [4]多为块茎、种子、植物茎杆，以及其他坚硬有韧性的食物。 [5]南方古猿进入成年期需要大约12年时间，女性每5~6年生育一次。 [5]南方古猿是两足的类人猿先驱，其大脑的脑容量与现代黑猩猩差不多，约400毫升。 [6]人类至今仍然保留着一组高效行走的适应性改变，这种改变在许多南方古猿下肢的化石中表现非常明显，脚踝方向与人类的方向一致。",
                    "src": "./static-2/南方古猿演化.jpg"
                },
                {
                    "name": "南北美洲生物大迁徙",
                    "time": "300万年前",
                    "description": "南北美洲生物大迁徙 是 动物地理学 上的一次重要事件， 北美洲 及 南美洲 陆地及淡水的 动物群 因 巴拿马地峡 的形成，而经 中美洲 互相迁徙交换。 这次迁徙的最高峰是于约3百万年前的 上新世 中期 皮亚琴察阶。 这是事件在 新热带界 及 新北界 的结合，最后形成 美洲 时发生。 这次迁徙可以从 地层学 及 新生物学 中观察得知。",
                    "src": "./static-2/南北美洲生物大迁徙.jpg"
                }
            ],
            "src": "./static-2/新生代.jpg"
        },
        {
            "name": "第四纪",
            "time": "258万年前",
            "description": "第四纪（英语：Quaternary Period，符號：Q）是新生代的一个纪，也是地质时代中的最新的一个纪，包括更新世和全新世两个世。第四纪前是新近纪。它从约260万年前开始，一直延续至今-----研究史 : 第四纪这个名称最早是意大利地质学家乔瓦尼·阿尔杜伊诺于1759年研究波河河谷沉积情况时提出的。1829年，法国地质学家儒勒·迪斯努瓦耶引用了这个定义。他在研究塞纳河低地的沉积层时发现了一层比新近纪更新的岩层。这个岩层一直延伸到地表。第四纪的时期基本上与最近的冰河期（包括现在的冰川回退期）相符。另一种分法是将300万年前北极结冰的开始作为第四纪的开始，这样的话上新世的最新的一部分也算作第四纪了。也有人不承认第四纪的存在，而将它看作第三纪的一部分。-----生物 : 第四纪的260万年中人类的存在已被确证。在这段时间里板块运动小于100千米，因此大陆运动的差异可以被忽略。不过海岸线变化很大，因为在这段时间里气候不断变化，冰河期与间冰期交换。在冰川期中冰川可以一直延伸到纬度40度的地方。在这段时间里只有很少新的动物种类产生（可能因为这段时间还比较短），在更新世末期，在北半球有不少哺乳动物（如剑齿虎、猛犸象、乳齿象、雕齿兽等）灭绝。马科、骆驼科、北美猎豹等在北美洲灭绝[5][6]。-----气候 : 中国地理学家竺可桢指出，第四纪欧洲和北美洲北部经历了四个冰河期和四个间冰期：第一冰河期距今30万年至27万年；第二冰河期距今20万年至18万年；第三冰河期距今13万年至10万年；第四冰河期距今6万5千年至1万5千年。",
            "children": [
                {
                    "name": "能人尝试使用石器",
                    "time": "240万年前",
                    "description": "世界上第一个人 - 能人，是灵长目人科人属， [1]能人（Homo habilis），拉丁文的意思是“能干的人”，他们是工具制造者。与南方古猿之间的区别很小，有相似的身高和体重，大约高1.3米、重40公斤，双足直立。能人的头骨和面部看起来已不大像猿了，头比较高和圆一些，面部也不太突出。最明显的解剖上的区别是牙齿，臼齿更窄、前齿更小，同时门齿变大而更像铲形。 [2]能人出现于200多万年前的东非地区，生活在如今的肯尼亚、埃塞俄比亚和坦桑尼亚。他们出现的时期正是非洲大草原变得干涸和草木稀疏的时期。早期的能人过着小群体式的聚居生活，会到不同的地方寻找食物，常常住在湖边或河边，用石头把兽皮或树枝固定在地面上，搭建简陋的类似窝棚的住所。能人最初出现的时候，只以采集的水果为食。当他们学会了打制石器后，就可以狩猎并共同享用。 [3]能人是最早的真人，一般认为是南方古猿的后代，比南方古猿进步。能人的脸比南方古猿的脸更加扁平，额头更高，脑容量更大，大约有700毫升，也比南方古猿聪明。 [3]能人是匠人的祖先，而匠人则是更后期的直立人的祖先。 [4]能人已经会用石头或骨头打制工具，用于狩猎或切割猎物的皮肉，但他们还不会制作木头工具，只会使用比较简单的石器",
                    "src": "./static-2/能人尝试使用石器.jpg"
                },
                {
                    "name": "直立人出现",
                    "time": "180万年前",
                    "description": "直立人，是人科 [2]人属直立人种，是猿人到智人的中间环节 [3]。直立人因直立行走，其腿骨与现代人基本相似。脑容量逐渐增加，早期直立人脑容量为700-900毫升，后期直立人的脑容量为900-1200毫升。早期直立人身高为1.10-1.30米，后期直立人为1.30-1.50米。早期直立人牙齿较大，后期直立人牙齿变小，主要是后部牙齿。此外，面部也发生一些变化，如下颌更加突出等 [4]。直立人起源于东非，经非洲进入中东地区，然后到亚洲，再到欧洲。生活年代在大约190万年前至2.7万年前，正好是更新世，是冰川活动高峰期，共发生过5次较大规模的冰川，气温降低，海平面下降，有利于迁移活动。直立人在人类发展史上属于旧石器时代，以使用打制石器为标志的人类物质文化发展阶段。主要靠摔击、锤击、砸击打制石器，还不会磨制。所以生产力低下，很难猎取大型动物。杂食性，以采集为主，或吃食肉动物剩下的猎物，群聚、巢居、穴居或在树上建屋。有猎食同类的习惯。从早期开始即会使用火 [4]。直立人化石最初是1891年在印度尼西亚的爪哇发现的，当时引起了所发现的这批化石是人还是猿的争论，直到20世纪20年代在中国北京周口店陆续发现了北京猿人的化石和石器，才确立了直立人在人类演化史上的地位",
                    "children": [
                        {
                            "name": "格鲁及亚人",
                            "time": "175万年前",
                            "description": "格鲁及亚人有直立人及能人的特征。",
                            "src": "./static-2/格鲁及亚人.jpg"
                        },
                    ],
                    "src": "./static-2/直立人出现.jpg"
                },
                {
                    "name": "人类学会用火",
                    "time": "170万年前",
                    "description": "与人类演进道路上的其他里程碑，例如完善石斧工具或掌握先进狩猎方法一样，制造、使用和控制火所需的技术也是渐进发展的，这得益于人类的聪明才智，以及反复试验。创新非朝夕之功，生火技术随时间不断完善，并在社会中传播，而不同人类群体则探索了控制火所带来的多方面应用潜力。在完全掌握生火前，早期人类可能经历了一个先行阶段：他们被动地使用火，收集、保存甚至运输由自然原因（闪电或自燃等）生发的火，然后才慢慢学会主动制造和控制火。与此同时，好奇心驱使他们探索火的神秘特性，尝试搞清楚生火原理。确定祖先何时开始掌握生火技术是艰巨的挑战。因为通过考古学证据来识别故意点燃和持续燃烧的火源太难了——仅凭烧焦的骨头和石头或局部烧焦的土壤不足以证明古人类曾主动生火。此前发掘于非洲大陆某些遗址的零星证据显示，100万年前的古人类只是赶巧从自然产生的火焰中获取到火源，而非自己完成了有效生火。不过有考古团队在南非奇迹洞穴（Wonderwerk Cave）的阿舍利（Acheulean）地层中找到令人信服的证据，证明100万年前该区域古人类曾主动生火。很多学者推断，任意生火的能力起始于旧石器时代早期的直立人（Homo erectus）谱系。直立人曾创制一系列惊艳的工具，它们构成了所谓阿舍利石器工业（Acheulean industry）；后来阿舍利文化的早期人类又发明并掌握各种高度复杂的技术。考古记录中的石器和骨器足以证明其成就。先进技术帮助直立人谱系向欧亚大陆扩张，并在新居所继续完善和多样化工具包，更好地适应环境，繁衍、壮大、兴盛。目前学界认为直立人最早出现于200万年前，一直存续至10万年前，尼安德特人和智人的共同祖先海德堡人（Homo heidelbergensis，约78万~13万年前）似乎由直立人演化而来。“阿舍利”得名于法国北部的圣阿舍尔（Saint-Acheul）遗址，指代广泛存在于非洲-欧亚大陆的一系列旧石器时代早期工具制作传统，以阿舍利手斧为代表。阿舍利石器工具通常与直立人遗骸一起被发现，学界认为这些技术起源于约200万年前的非洲，与直立人密切相关，并在150万~80万年前传播到亚洲、中东和欧洲地区。后来海德堡人也广泛使用阿舍利工具。阿舍利文化范围不断扩张，社会持续发展（考古记录难以揭示这些内容），在非洲和欧亚大陆的人口快速增长，这必然引起更频繁的跨族群接触，为各个层面的文化传播提供机会。阿舍利文化的早期人类相互组织，形成功能性集体单位，从而能更有效地分享和交流新技能。如前文所述，100万年前南非的阿舍利遗址显露了古人任意生火的绝技。而在另一些时空，更精细、花哨的“玩火”证据表明不断成熟的生火用火技术引起了全球性变革。例如，科学家在位于约旦河谷的一处阿舍利文化遗址找到确凿证据，证明约78万年前的早期人类不仅任意生火，还用火烹鱼。又例如，在北京周口店的阿舍利洞穴遗址中，80万~60万年前的亚洲直立人个体成功控制了燃烧。当然，上述事件比较罕见，从考古证据来看，直到40万年前的阿舍利文化末期，古人类积极用火并控制火的情况才更加普遍；进入欧亚旧石器时代中期和非洲中石器时代后，用火就越发频繁了，史前人类的技术和行为多样性也呈指数级增长，工具包不断丰富。至关重要的是，以洞穴为主的史前住所成为可久居的“老家”，数代原始人都以此为大本营，会定期（或季节性）回家，大本营呈现出有组织的生活空间，以及一个对考古学者而言容易辨认的“中心”——用于生火用火的结构，或者说，炉灶。大约35万年前，也就是祖先们从旧石器时代早期向中期进发的前夕，炉灶在史前居所中的普遍存在，标志着人类生活方式正发生重大变革。生火与许多社会、技术和行为发展相互交织，一起塑造人类，推动文明。虽然生火技术似乎不是古人类向高纬度地区扩张所必需的条件，但它有助于祖先扎根气候条件恶劣或不稳定的地区。在狩猎方面，善于用火的猎人拥有巨大优势。火也保证了社区的安全。除了利用火，古人类还广泛、持续地试验火，并认识到火能改变自然界其他材料的特性。他们最终学会了用火改进武器，比如加热燧石以提高其打制质量，也学会了借助火来组装成复合工具，比如用加热制备的黏合剂（如焦油和赭石）将尖头石器装到树枝上。此外，烹饪食物必定从根本上改变了古人类饮食——大大降低从肉类等食物中感染细菌和寄生虫的风险，同时为扩展食品加工工艺（煮沸、熏制、风干等）奠定基础。学会用火所带来的社会影响或许最为关键，却也最难以科学评估。有了火，人类得以摆脱黑暗，满怀信心地度过漫漫长夜，能够围聚炉边，感受温暖、光明和舒适。有理由推测，火光催化了人类讲故事的天赋，催生了各种公共仪式，让我们祖先拥有多样的社会活动和多元的文化。在旧石器时代中期和晚期，人类利用火光深入洞穴，开展仪式活动，并在洞穴墙壁上创作艺术。到了旧石器时代末尾，人类继续探索火的强大转化特性，学会了怎样获得并维持将黏土转化为陶器所需的高温，怎样将金属矿石熔化成可用物品——这使人类文明再次步入新纪元。",
                    "src": "./static-2/人类学会用火.jpg"
                },
                {
                    "name": "人类走出非洲",
                    "time": "80万年前",
                    "description": "美国学者利用基因技术挑战人类进化史，中科院院士接受本报专访对此观点表示欢迎从440万年前最早的人类化石算起，人类谱系的演化经历了一个相当曲折的过程。通常认为，人类起源，有两个关键节点———人科的起源和现代人的起源，科学界对此有多种理论假说。学者大多赞同，最初的人类出现于600万到700万年前的非洲，非洲是否是全球现代人的共同起源地，这一点争议严重。2月9日美国“每日科学”网站报道，美国圣路易斯华盛顿大学的坦普莱顿教授(AlanTempleton)利用基因技术的发现提出，古人类曾经三次“走出非洲”，而不是两次；非洲人种与欧亚人种互相交融，繁衍后代。中国科学院古脊椎动物与古人类研究所吴新智院士在接受本报专访时表示，这一新的研究成果能为“多地区进化说”提供佐证。人类都起源自非洲？地球上所有生物都是同一起源的，人类这个群体也是其中一部分，属于动物界─脊索动物门(脊椎动物亚门)─哺乳纲─灵长目(类人猿亚目)─人科。早在19世纪中叶，英国学者达尔文认为非洲的大猿与人类最为接近，从而推测人类起源于非洲。而此后的一个半世纪里，通过各地的考古发掘及研究，古人类学家已经就人类起源问题，为我们描绘出大致这样一幅图景：第一阶段大约出现在600万-700万年前；第二阶段是能人(Ho鄄mohabilis)阶段，大约生活在160万-250万年前；第三阶段是直立人阶段(Homoerectus)，大约从180万年或160万年前持续到20多万年前；最后一个阶段是智人(Homosapiens)阶段，从早期智人一直到约10万年前进化到晚期智人。晚期智人的形态与现代人类基本一致。由于目前第一和第二阶段的化石仅发现于非洲，因此在科学界，人们比较赞同最初的人类可能出现于600万到700万年前的非洲，但是争议较多的却是现代人的起源问题。对此，学术界形成了两种主要看法———“走出非洲学说”(OutofAfrica)和“多地区进化学说”。两种假说都认为直立人起源于非洲直立人，然后大致在200万年前走出非洲，迁移到欧亚大陆。但非洲起源学说认为现代人类起源于20万-15万年前的非洲，然后在大约10万年前走出非洲，并完全取代了其他地区的古人种。该学说自1987年首次提出后，得到许多分子生物学证据的支持。然而在包括中国在内的东亚地区陆续出土的大量人类化石，在存在形态的延续性等方面都不支持这个假说。作为“多地区进化说”代表人物之一的吴新智院士，于1984年和美国密歇根大学的沃尔波夫(Milford Wolpoff)和澳大利亚国立大学的索恩(AlanThorne)共同撰文，提出“多地区进化说”，主张现代人是在4个地区出现并连续进化，而且在各个地区之间都有基因交流。基因显示非洲原始人三次出走直到现在，学界对现代人起源问题还是争论不休。美国华盛顿大学的生物学家坦普莱顿将DNA分析方法指向了比晚期智人更早的直立人，希望从另一面揭开现有人种的整个进化历史。在发表于美国《2005体制人类学年鉴》上的最新研究成果中，坦普莱顿便提出大约在直立人阶段，非洲古人类就曾三次走出非洲，其中最早的一次在190万年前。四年前，坦普莱顿就曾提出其关于人类起源的新理论，该论文《一次次走出非洲》(OutofAfricaagainand again)发表在2002年3月8日出版的《自然》杂志上。坦普莱顿于1995年设计了一套电脑程序GEODIS，以此分析了全球各地人口的DNA序列，并试图找出人群之间的基因关系。坦普莱顿及其他研究人员重点比较了10个根据遗传特征划分的区域的人的普通染色体、性染色体、线粒体DNA.分析结果显示，人类在42万―84万年前曾走出非洲，之后又于8万―15万年前再次大规模向外迁徙。2005年，坦普莱顿将10个区域扩大到25个区域，结果发现在上述两次迁徙外，在190万年前人类就已经有了“走出非洲”的经历，称得上是最早的一次。他表示人类走出非洲的这一时间框架正好与化石记录相吻合，因为目前所挖掘出的直立人就是在那时由非洲向外扩展的。不是取代而是交融 在流行的理论假说中，非洲古人类走出后便取代了欧亚的原住民。但此次，坦普莱顿却通过基因分析发现，走出非洲的直立人与当地人群之间有着无所不在的基因交流，应该说他们相融的时间比目前科学界所认可的时间还要早。 以线粒体及Y染色体估算，现代人类走出非洲的时间是15万年到8万年前，之后又发生了几次人群的回流和进一步扩张。与现代人完全取代古人类学说不同的是，坦普莱顿主张，一批批走出非洲的现代人相互融合，构成现代的世界人群，他表示自己的新发现将推翻最近20年国际上广为流行的观点。 “现代人主要起源于非洲，但也并非绝对。当我们检测了更多区域的人类DNA后，对人类进化更深入的见识肯定会随之而来。人群是一次又一次地扩张，走出非洲，但是这些扩张的结果是杂交，而不是毁灭性的完全替代，这种杂交的结果加强了全世界人群之间的遗传联系。”坦普莱顿指出人类进化并非呈现树形，也非简单的格架状，而是互相交融、交织在一起的。他的小组曾检测过10个DNA区域中的8个，均显示没有取代的现象，每一人种身上都还遗留有更古老的基因特征。 至于为何在190万年前与70万年前会出现两次“走出非洲”的现象，坦普莱顿等人解释，可能与当时的气候有关。古气候数据显示190万年前和70万年前这两个阶段非洲东部有丰富的降水，今日的撒哈拉沙漠在当时便是稀树草原，也正是这一气候条件使得非洲人从东部走出，进而走向欧亚。 吴新智院士在接受本报记者采访时表示，坦普莱顿的研究成果已经比过去其他人前进了一大步，但人类进化是极为复杂的，如果想真正揭开人类进化之谜，那么还需要更多的材料、更深入的研究才行。“不过，坦普莱顿的三次‘走出非洲’的研究，以及亚非欧人种之间互相交融的结论，恰能为多地区起源学说提供更新的证据。” 院士指点 有“走出”，也有“走进” “亚非欧三洲在地中海东南地区(现今的西奈地区)相邻相通。在第四纪冰期，海面下降，直布罗陀海峡可能形成浅水地势，使人类能够在非洲与欧洲之间来来往往。“吴新智院士在地形上解释了”走出非洲“的可能，表示考古发现总是不断有新的探索，亚非欧之间的交流，在有历史记载后便屡见不鲜。对于非洲来说，人种之间的交流，不光有走出，也有走进。 吴新智院士指出，农业史显示在更新世末期和全新世早期，亚洲西部和非洲东北部就已经有栽培植物的历史记载。非洲从亚洲不仅得到了近东栽培的大麦和小麦，还得到了从东南亚热带地区传入的各种植物品种。“这些新事物的输入和输出肯定会伴随人类基因的流动。” 为此，吴新智院士指出了历史上几次有名的交融史。公元前10世纪，欧洲的腓尼基人入侵非洲，征服北非土著柏柏尔人，几百年后罗马帝国的人接替腓尼基人继续奴役柏柏尔人，公元7世纪起阿拉伯帝国侵占埃及，10世纪时北非的法提玛王朝征服叙利亚等亚洲地方，11世纪阿拉伯人又入侵突尼斯地区。 “在非洲兴起的旧石器第二模式和第三模式的制造技术传入欧洲和亚洲，应该伴随着人群的流动，既然有来，就没有理由说没有往。所有这些来往肯定会在非洲人的遗传物质中打上无以计数的烙印。这些烙印中可能一部分已经丢失，没有丢失的还有待今后的研究。” 吴新智院士指出坦普莱顿关于三次“走出非洲”的研究尽管还有待更多具体考古资料的确证，但它却为一些谜底的揭开开启了另一通道，比如说现在从非洲人身上发现的某些基因变异是否是早先时候从欧洲或亚洲输入的。",
                    "src": "./static-2/人类走出非洲.jpg"
                },
                {
                    "name": "尼安德特人进入欧洲",
                    "time": "40万年前",
                    "description": "尼安德特人（拉丁文学名homo neanderthalens，又译尼安德塔人）是一种在大约12万到3万年前居住在欧洲及西亚的古人类，属于早期智人的一种 [14]。尼安德特人头骨化石最初在1829年发现于比利时，但是直到1856年在德国的尼安德Neander山谷中的一个山洞发现了头盖骨和其他骨骼，并被命名为尼安德特人（Homo neanderthalensis）后才广为人知（Wolpoff，1996）。化石证据显示，其比早期现代人稍矮但身体和四肢粗壮，平均脑量稍大，晚更新世广布于欧洲，在西亚和中亚也有分布；至少在23万年前就已经出现，由于冰期的兴盛，约在3万年前灭绝（Hublin，2009）。发现尼安德特人化石的那个山洞里没有发现动物化石和石器，当时不能判断人骨的年代，世人对于这个研究结论也是疑信参半。时间过了二十几年后，1886年在比利时的斯彼地方又发现了两个头骨，形态与30年前在尼安德山谷出土的很接近，与现代人显然不同。与尼安德的发现不同的是，这次还出土了大量动物化石与人骨相伴。动物化石中有属于洞熊、驯鹿、披毛犀和古象等的骨骼和牙齿。由于当时古生物学已经认识到其中有许多动物早已绝灭，斯彼这些人骨代表古老的与现代人显然不同的人类的看法得到大家的认同。而尼安德特人的形态特征与之相同，尼安德特人在人类进化史中的位置也就站住了。1908年在法国的圣沙拜尔村附近一个山洞里发现了一副基本完整的男人骨架化石。其头骨与已经发现的那些尼安德特人头骨大同小异，所以科学家把这副骨架当作尼安德特人的典型代表，开始对尼安德特人身体各部分骨骼的构造和形态有了比较全面的了解。尼安德特人与现代人在同一时空内共存了很长一段时间。对于尼安德特人是否是单独物种还是智人的一个亚种，在20世纪和21世纪初长期存在争议。虽然基于化石的形态学研究早已表明尼安德特人与智人进行过杂交（Duarte et al.，1999；Trinkaus et al.，2003），但直至Green等（2010）利用古DNA信息证实尼安德特人与智人存在基因交流后，科学家们才达成尼安德特人是智人的一个亚种的共识。-----起源进化:尼安德特人的祖先可以推溯至约40~60万年以前的海德堡人。在德国、法国、比利时和意大利的许多地方都发现了确定是尼安德特人的下腭、牙齿和头盖骨部分。尼安德特人的进化问题仍在争论之中。一些人主张尼安德特人中的一些种群在玉木冰期时被隔离于西欧，发展成为适应于寒冷气候的、特化了的所谓典型尼安德特人（Typical neanderthals），例如圣沙拜尔人、费拉西人和尼安德特人等。而另有一些种群被称为进步尼安德特人（Progressive neanderthals）或一般化尼安德特人（Generalized neanderthals），如塔邦人、施泰因汉人和斯旺斯柯姆人等发展了现代人的特征，成为现代智人类型的祖先，此即所谓“前尼安德特人说”（Preneanderthal hypothesis）。但提倡“前智人说”（Presapiens hypothesis）的法国学者H.瓦卢瓦则主张，现代智人和欧洲尼安德特人的祖先可以早到民德-利斯（Mindel-Riss）间冰期。这两种学说虽然在追溯玉木时期的尼安德特人和现代智人类型的共同祖先的时间上有早晚之异，但都认为欧洲尼安德特人没有后代。与之对立的学说是“单系说”（Unilinear hypothesis），它主张直立人之后只有一个系统，它是连续进化的，经过尼安德特人“尼安德特人阶段”进化到现代人，换言之，尼安德特人是现代人的直接祖先。单系说的传统观点为G.施瓦尔贝、H.赫尔德利奇卡、F.魏敦瑞等人所持，为C.布雷斯和M.H.沃尔波夫等人所极力推崇。至于典型尼安德特人的消失问题有两种意见：一种说法认为尼安德特人受到气候恶化的因素和进入其居住地区的现代人拥有人口数量、社会整体性、文明程度的优势，使现代人在族群纷争中取胜，代替了此前更加原始的文明。另外一种说法认为，尼安德特人被毁灭于快速的气候变化。",
                    "src": "./static-2/尼安德特人进入欧洲.jpg"
                },
                {
                    "name": "智人出现和演化",
                    "time": "25-4万年前",
                    "description": "智人（学名：Homo sapiens），是人属下的唯一现存物种。形态特征比直立人更为进步。分为早期智人和晚期智人。早期智人过去曾叫古人，生活在距今25万～4万年前，主要特征是脑容量大，在1300毫升以上；眉嵴发达，前额较倾斜，枕部突出，鼻部宽扁，颌部前突。一般认为是由直立人进化来的，但有争议 [1]，认为直立人在后来崛起的智人（现代人）走出非洲后灭绝或在此之前就灭绝了。晚期智人（新人）是解剖结构上的现代人。大约从距今四五万年前开始出现。两者形态上的主要差别在于前部牙齿和面部减小，眉嵴减弱，颅高增大，到现代人则更加明显。晚期智人臂不过膝，体毛退化，有语言和劳动，有社会性和阶级性。",
                    "children": [
                        {
                            "name": "奥莫化石遗存",
                            "time": "19.5万年前",
                            "description": "埃塞俄比亚奥莫河的奥莫化石遗存是最早的人类。",
                            "src": "./static-2/奥莫化石遗存.jpg"
                        },
                        {
                            "name": "长者智人",
                            "time": "16万年前",
                            "description": "长者智人练习礼仪及宰杀河马。",
                            "src": "./static-2/长者智人.jpg"
                        },
                        {
                            "name": "线粒体夏娃",
                            "time": "15万年前",
                            "description": "线粒体夏娃在非洲生活，她是所有现今人类的最后女性祖先。",
                            "src": "./static-2/线粒体夏娃.jpg"
                        },
                        {
                            "name": "人类演化",
                            "time": "公元前10万年前",
                            "description": "第一个人类从海德堡人演化及在非洲出现。人类生活在南非及以色列。",
                            "src": "./static-2/人类演化.jpg"
                        },
                        {
                            "name": "人类文化发展",
                            "time": "公元前8.25万年前",
                            "description": "人类在萨伊使用锋利的动物骨头捕鱼。",
                            "src": "./static-2/人类文化发展.jpg"
                        },
                        {
                            "name": "人类技术进步",
                            "time": "公元前8万年前",
                            "description": "人类在刚果制造鱼叉。",
                            "src": "./static-2/人类技术进步.jpg"
                        },
                        {
                            "name": "多峇巨灾理论",
                            "time": "公元前7.4万年前",
                            "description": "多峇湖的超级火山爆发，人类人口只剩2000。",
                            "src": "./static-2/多峇巨灾理论.jpg"
                        },
                        {
                            "name": "末次冰期",
                            "time": "7-1.15万年前",
                            "description": "最后的冰河时期-",
                            "children": [
                                {
                                    "name": "威斯康辛冰期",
                                    "time": "7万年前",
                                    "description": "最近的冰河时期，威斯康辛冰期开始。",
                                    "src": "./static-2/威斯康辛冰期.jpg"
                                },
                                {
                                    "name": "人类文化发展",
                                    "time": "公元前7万年前",
                                    "description": "人类在南非布隆伯斯洞穴以骨头制造工具，及画壁画。",
                                    "src": "./static-2/人类文化发展.jpg"
                                }
                            ],
                            "src": "./static-2/最后的冰河时期.jpg"
                        },
                        {
                            "name": "Y染色体亚当",
                            "time": "公元前6万年前",
                            "description": "Y染色体亚当在非洲生活，是人类男性Y染色体的最后祖先。",
                            "src": "./static-2/Y染色体亚当.jpg"
                        },
                        {
                            "name": "人类扩散",
                            "time": "公元前5万年前",
                            "description": "人类由亚洲延伸至澳洲及欧洲。",
                            "src": "./static-2/人类扩散.jpg"
                        },
                        {
                            "name": "克罗马侬人",
                            "time": "公元前4万年前",
                            "description": "克罗马侬人在法国绘画及捕猎猛犸象。",
                            "src": "./static-2/克罗马侬人.jpg"
                        }
                    ],
                    "src": "./static-2/智人出现.jpg"
                },
                {
                    "name": "人类艺术",
                    "time": "公元前3.2万年前",
                    "description": "德国福格海德有第一个雕塑史前狮子人雕像。",
                    "src": "./static-2/人类艺术.jpg"
                },
                {
                    "name": "人类迁徙",
                    "time": "公元前3万年前",
                    "description": "人类从西伯利亚分几波进入北美洲。",
                    "src": "./static-2/人类迁徙.jpg"
                },
                {
                    "name": "尼安德特人消失",
                    "time": "公元前2.2万年前",
                    "description": "尼安德特人消失，人属只余下人类及佛罗勒斯人。",
                    "src": "./static-2/尼安德特人消失.jpg"
                },
                {
                    "name": "人类文明发展",
                    "time": "公元前2万年前",
                    "description": "人类在青藏高原留下脚印及手印。",
                    "src": "./static-2/人类文明发展.jpg"
                },
                {
                    "name": "农业起源",
                    "time": "公元前1.5万年前",
                    "description": "最后的冰河时期完结，海水漫过全球，造成多个近岸地区水浸。",
                    "src": "./static-2/农业起源.jpg"
                },
                {
                    "name": "全新世灭绝事件",
                    "time": "公元前1.4万年前",
                    "description": "超过100种大型哺乳动物消失。",
                    "src": "./static-2/全新世灭绝事件.jpg"
                },
                {
                    "name": "新仙女木事件",
                    "time": "公元前1.28万年前",
                    "description": "“新仙女木”事件是末次冰消期持续升温过程中的一次突然降温的典型非轨道事件，对于研究古气候、古环境的快速突变事件和短周期现象，合理评估现今气候一环境条件并做出气候变化的预测有着重要的意义。它是一个全球性的事件，中国东部陆架海也普遍发现了“新仙女木”事件的沉积记录。由于中国东部陆架位于欧亚大陆和太平洋之间，受季风的强烈影响，因此有着独特的响应。科学家认为，爆炸产生的热量和压力可能融化了格陵兰冰层，改变了气流并对气候产生影响，并引起灰尘的出现，而这些灰尘遮蔽了太阳，降低了气温，最后危及到植物和动物。该发现对近几十年来争议最大的3个问题做出了解释。这3个问题是：克劳维斯人的突然消失、巨兽的灭绝以及地球温度的骤降之谜。以前，人们一致认为是气温骤降导致了克劳维斯人的灭绝。凯内特说：“这些发现提供了强有力的证据，表明大约1.29万年前发生的彗星撞地球事件影响了北美的植物、动物和人类。”公元前8200年也有一次降温事件，在温暖的冰后期气候背景下，气温忽然下降。它发生在公元前8490年-公元前8200年之间，持续不过两百多年，且气温下降的幅度、涉及的范围远远不及新仙女木事件。仙女木事件发生非常突然，但是至今仍未有足够的证据证明其发生的原因。比较流行的假说是彗星撞击地球导致温度下降。-----证据:美国科学家称，他们对北美纳米钻石的研究表明，大约1.29万年前，一大团彗星袭击了地球，造成地球的气温骤降，导致了长毛猛犸象和其他生物的灭绝，也让美国印第安克劳维斯人从此消失。该研究成果发表在1月2日出版的《科学》杂志上。美国俄勒冈州立大学考古学家东·凯内特领导的团队在1.29万年前的沉积物中发现了这些肉眼几乎看不见的钻石，并进行了研究，这些钻石散落于北美很多地方的泥土中，其中一处更是位于亚利桑那州梅利泉的克劳维斯遗址之上。-----疑问:新仙女木撞击假说认为，1.28万年前的新仙女木变冷期是由于一颗小行星撞击形成的，这是建立在多个地点发现的一场撞击的证据的基础之上的，但是对其中29个这类地点的撞击证据的一项研究发现，只有3个地点显示出了类似于新仙女木事件起始的年龄，而且由于这些地点的撞击指示物的残骸的年龄跨度很大，这些发现提示，或者有比此前认为的更多的小行星撞击在历史上发生，或者新仙女木时期不是一次地外撞击的结果。",
                    "src": "./static-2/新仙女木事件.jpg"
                },
                {
                    "name": "人类的农业发展",
                    "time": "公元前1万年前",
                    "children": [
                        {
                            "name": "农业起源",
                            "time": "公元前1.04万年前",
                            "description": "开始种植植物，在近东耕种。",
                            "src": "./static-2/农业起源.jpg"
                        },
                        {
                            "name": "农业扩展",
                            "time": "公元前6千年前",
                            "description": "亚洲西南部、叙利亚、约旦、土耳其及伊拉克种植麦。",
                            "src": "./static-2/农业扩展.jpg"
                        },
                        {
                            "name": "稻作农业",
                            "time": "公元前4500年前",
                            "description": "种植亚洲型稻及非洲型稻。",
                            "src": "./static-2/稻作农业.jpg"
                        }
                    ],
                    "src": "./static-2/人类的农业发展.jpg"
                },
                {
                    "name": "人类文明发展",
                    "time": "公元前7000年前-现在",
                    "description": "人类的文明史，开始于文字的发明，在时间上最早不过七八千年，这几千年只占人类史的百分之一而已。人类文化的发展，从人文地理学的研究方面讲，可有以下三种共识。第一，人类文化的发展，不是突然的，而是人类在生存竞争中学到许多经验，逐渐积累而流传下来的。换句话说，有史时代的许多文化，都渊源于史前时代的人类活动，举例来说，中国的历史有五千年，可是我们知道中国史前时代，就有许多不同的民族，散居各地，如北京人、蓝田人，他们的年代距今约有四五十万年，中国有史时代的文化，与史前人类活动是分不开的。第二，各种人类的文化，因为环境的变迁，时代的更换，进退不一。史前有许多强盛的民族，早已灭亡，人类史上，也就没有独霸一方的民族。人文学家公认人类的身体、智力和道德，根本是相同的，如果有理想的环境，任何民族都可逐步推进，创造高尚的文化。第三，人类有共同进取的合作力量，可是也有互相残杀的卑劣天性。人类残酷成性，个人之间杀戮不够，还会结合亲族，进行械斗，甚至国族之间，建立攻守同盟，造成大规模的战争。人类文化应该是相互提携，合作发展，为何会互相残杀呢？有位学者曾加以分析：人类是柔弱动物，从小要父母保护，成年后也无自卫力量，体力不够，指甲不硬，牙齿又受口小的限制，不会爬树，也不会飞，可是从经验中，他知道团结就是力量，只有成群结队，才有生存希望，人类对家族、乡团、国家有热烈的忠心，就是这个原因。可是集团防卫，还不保险，更要利用脑力，制造武器，因此养成残酷杀戮的本领，有了杀人的武器，个人可以放胆劫杀，集团可以横行天下。人类历史的演进，体力越来越弱，而杀人武器却愈来愈凶，人弱器利，互为因果。更加上种族、语言、宗教的分歧，以及民族主义和交通的发展，使人类的战争，越来越残酷。不过有识之士和开明的人都相信，人类要和平共处，互相合作，才有光明的前途。一般科学界将文字的出现作为界定文明的重要标志，通常人们把文字出现以后的历史称之为人类文明史，而把文字出现以前的历史算为史前史。从上一个世纪，世界各国开始对上古文化进行大规模的考古挖掘，集一个世纪以来的考古成果，人们发现文字出现的时间并不长，最多不超过6000年。按照文明发展的程度，学术界将中国、印度、埃及、巴比伦四国排在首位，号称'四大文明古国'。在埃及发现的最早文字大约起源于公元前4000年，距今6000年；古印度的年代大约在公元前2500年左右，距今4500年；古巴比伦文化年代大约在公元前3500年，距今5500年。文明起源 : 人类来源 : 人们对人类来源的真正答案，只是100多年的事。因为化石提供了事实根据，化石是古代生物遗留下来的部分遗体或活动的痕迹。找到人类骨骼化石和石器，可以了解古代人类的体质、智力和用具的发展水平。由化石发现的地点，可以知道古人类的地理分布及其所处的地质时代和生活环境。在各种化石中，头骨化石是最重要的。一般动物的面颅比脑颅大得多；人类则相反，脑颅要比面颅大得多。原始人和现代人比较，差别可以说主要就集中在头骨上。如原始人的头盖骨比现代人厚得多。正因为研究人类的头骨化石最能了解古人类的形态特点和体质发展水平，因而人类学工作者，对于寻找完整的人头骨化石特别重视。完整人头骨化石的发现，被认为是人类学研究中的一项重大成就。100多年以前，科学家已经注意到用人类化石为证据，来探讨人类进化的历史。第四纪时代出现了人类的祖先。最初亚非大陆温暖湿润，古猿在这种环境中演变成能制造工具和进行劳动的人类。劳动使肢骨发达，双手更能创造万物，口腔发展了语言，也就推动了脑的发达。人类始祖直立猿人的出现，与别的哺乳动物尚用四肢爬行不能用手更无语言迥然不同，而变成支配世界的主人翁。按人类的体质和其文化发展的顺序，可分为“猿人”、“古人”和“新人”阶段。近数十年来，世界上屡屡发现人类化石，使人类科学家从而了解人类体质特征和文化发展。可是仍有不少疑问，如猿人变古人的过程如何？古人变成新人的过程又如何？如今发现尚没有足够的资料可作完满的解说，这需要更多发现的事实继续补充。世界上常发现的人类化石，几乎都是“古人”或是“新人”（也称“真人”），其中最著名并为科学界所公认的是1865年在德国发现的尼安得特尔人属于“古人”，1868年在法国克罗马尼翁人属于“新人”。因此一般人就认为人类的祖先只有十几万年的历史，直到1929年，中国在周口店发现了北京猿人的第一个头盖骨，从而使人们相信人类的祖先40万年以前就有了。地球的地壳，无时不在变动。从山地侵蚀下来的泥土和砂砾，最后沉积到大洋湖海里，形成深厚广大的岩层。大海上升为陆地，高山侵蚀成平原，大地上有生命的动植物，随时可被埋没在沉积层中，经过若干万年，变成化石。地质学家，根据这些动植物的遗骸，可以辨认地球各区域各时代生物演变的情形。地质时代，可分为太古代、元古代、古生代、中生代和新生代5个时期。太古代所知的地质史实最少，不像有生命存在。到古生代开始，才发现有生物遗迹，不过完全是下等动物和初级植物。下等动物最多的是三叶虫，珊瑚、海绵、水母也不少。中生代是爬虫最主要的时期，体形高大，且有铠甲作为保护。新生代是近代地质史上生物进化的重要时期；大爬虫已一去不返，留下来的只有鳄鱼、龟、蛇和蜥蜴等，此时是哺乳类大为活跃的时代。第四纪大约在二三百万年内的地球史上，出现了直立猿人。因此有人称第四纪为“灵生代”，因为这是人类的时代。同时第四纪也大大改变了自然环境，尤其明显地改变了动植物界。其次，第四纪有强大的冰川作用，并在地球表面，留下了很多痕迹。冰川的进退也影响了动植物的分布。 地面上突然冰期来临，靠采取果实生活的猿人，在冰天雪地中无处觅食，常为饥饿所迫，不得不剥兽皮，以作衣服；寻觅洞穴，找栖息之地；钻木取火，可煮食也可驱逐野兽。人类经过数度冰期的淘汰，智力益见进步。远古人类的文化遗物，主要是一些自制的工具，这些工具基本上是石制的。古老时期的原始人类没有生产经验，所以石制工具简单而粗陋。但在实践过程中他们制作工具的技能不断改进，所以说劳动是创造文化的原动力。石器又可分为旧石器时代和新石器时代。旧石器时代的人们大都是猎人和采集者。他们使用的工具多是河床圆砾，初用打制法，后用磨制法。到了冰期终结时，就开始了新石器时代。这时期完全用磨制的方法来制造石器，多凿有孔眼及环形的石器，种类繁多，有大斧、石刀、石凿等。这时期的陶器已很发达，农业工具也已开始，并有了原始的畜牧业。 新石器时代结束后，大约公元前4000～1000年，人类进入金属文化。先是铜器时代，到了公元前2000年就进入铁器时代，已开始用铁作犁了。铜器时代和铁器时代是交替而不是截然分开的。古代的人类，究竟发源于何处？这是争议多年的问题。有的说是起源于亚洲中部，像著名的考古学家安德鲁斯（R.C.Andrews）和地理学家泰勒（Griffit Taglei），就认为人类起源于亚洲中部，然后移向各洲。其理由是，中亚是人类牧养的家畜，如骆驼、犬、牛、羊、马等的起源地。既然适于高等动物的生存，依动植物为生的人类，也必发源于此。同时，中亚位置为各大洲之中，地势也最高。世界其他各洲平均海拔高度均在700米以下，独亚洲大陆海拔平均在1000米以上，居高临下，可与各洲相连。故谓人类起源于中亚，分散在各洲，其势最顺，其理至当。可是也有人认为人类的起源应在副热带潮湿之区，对农业起源研究卓著的索尔教授（Carl Sauer）就认为东南亚沿海地区，可能是人类最先发迹的地方。像泰国的考古发现及中国杭州湾河姆渡遗迹的发现可以佐证。这类讨论，尚需更多的地下发现，才能有完满的解释。我们所了解的原始祖先，人数不多，疏落分散在一片土地上，以后人口增加，就向四周迁移发展。就地理学和考古学的知识，地球表面有许多海峡，阻断大陆间的交通。可是假如海平面降低90米，许多海峡就可变成陆桥，便利人类的交往。最著名的陆桥，包括沟通北美和亚洲的白令海峡，沟通英国和欧洲的多佛海峡，沟通亚洲和欧洲的达达尼尔海峡和沟通马来西亚与苏门答腊的马六甲海峡。其他的还有沟通非洲的西西里海峡，沟通朝鲜和日本的对马海峡，沟通苏门答腊和爪哇的巽他海峡，沟通新几内亚和澳洲的托雷斯海峡以及沟通南部澳洲和塔斯马尼亚的巴斯海峡。假如在第四纪，此类海峡在冰期后退，海平面降低而成为陆桥，使陆地相连，则有利于人类祖先的四方迁移。这是无可置疑的。 人类祖先经过陆桥向各方移动而扩大了分布范围。由于地面上各处自然环境不同，在温度、雨量、阳光等的差异，又随着人类社会和人类本身体型的发展，分化出来了世界上各色各样的人种。如黑色素有吸收紫外线的功能，可以保护皮下的血管、神经和肌肉免受紫外线的直接侵袭。长期居住在非洲赤道的人种变成黑种人，他们头发鬈曲、覆盖头部，是有隔热作用。而长期居住在高纬寒冷地区的人群，鼻子高而狭窄，使冷空气较慢进入气管和肺部。他们的体型比热带居民要粗壮，肤色也较热带的人为浅白。古代人类，交通不易，受到自然环境的束缚，各个人群长期生活在各个隔离的地理区域内，在体质上形成了各不相同的适应性的特征。这些特征，代代遗传，以致人类在地面上分衍成各种有明显体质差异的种族。",
                    "src": "./static-2/人类文明发展.jpg"
                }
            ],
            "src": "./static-2/第四纪.jpg"
        }
    ]
}

