treeData = {
    "name": "生命起源史",
    "time": "137.98亿年前",
    "src": "./static-2/生命起源.jpg",
    "children": [
        {
            "name": "冥古宙",
            "time": "45.4亿年前",
            "children": [
                {
                    "name": "宇宙诞生",
                    "time": "137.98亿年前",
                    "children": [
                        {
                            "name": "宇宙背景",
                            "time": "137.98亿年前",
                            "description": "宇宙诞生标志着时间、空间和物质的起源。",
                            "src": "./static-2/宇宙背景.jpg"
                        }
                    ],
                    "src": "./static-2/宇宙诞生.jpg"
                },
                {
                    "name": "银河系诞生",
                    "time": "136亿年前",
                    "children": [
                        {
                            "name": "银河系形成",
                            "time": "130-80亿年前",
                            "description": "银河系在一个巨大的气体和尘埃云中逐渐形成。",
                            "src": "./static-2/银河系形成.jpg"
                        }
                    ],
                    "src": "./static-2/银河系诞生.jpg"
                },
                {
                    "name": "太阳形成",
                    "time": "45.7亿年前",
                    "children": [
                        {
                            "name": "太阳系形成",
                            "time": "45.7亿年前",
                            "description": "太阳在一个坍缩的氢分子云内形成，标志着太阳系的诞生。",
                            "src": "./static-2/太阳系形成.jpg"
                        }
                    ],
                    "src": "./static-2/太阳形成.jpg"
                },
                {
                    "name": "地球形成",
                    "time": "45.7亿年前",
                    "children": [
                        {
                            "name": "地球诞生",
                            "time": "45.7亿年前",
                            "description": "地球从环绕早期太阳旋转的吸积盘中形成。",
                            "src": "./static-2/地球诞生.jpg"
                        }
                    ],
                    "src": "./static-2/地球形成.jpg"
                },
                {
                    "name": "月球形成",
                    "time": "45.33亿年前",
                    "children": [
                        {
                            "name": "大碰撞假说",
                            "time": "45.33亿年前",
                            "description": "原始地球与忒伊亚相撞，产生月球，同时导致地球自转轴倾斜。",
                            "src": "./static-2/大碰撞假说.jpg"
                        }
                    ],
                    "src": "./static-2/月球形成.jpg"
                },
                {
                    "name": "地壳形成",
                    "time": "44亿年前",
                    "children": [
                        {
                            "name": "地壳形成过程",
                            "time": "44亿年前",
                            "description": "地球表面温度降低，地壳开始凝固形成。",
                            "src": "./static-2/地壳形成过程.jpg"
                        }
                    ],
                    "src": "./static-2/地壳形成.jpg"
                },
                {
                    "name": "大气与海洋形成",
                    "time": "42-40亿年前",
                    "children": [
                        {
                            "name": "大气圈与海洋",
                            "time": "42亿年前",
                            "description": "地球表面温度进一步降低，大气与海洋形成, 撞击带来的水分形成最初的海洋",
                            "src": "./static-2/大气圈与海洋.jpg"
                        }
                    ],
                    "src": "./static-2/大气与海洋形成.jpg"
                },
                {
                    "name": "最早生命的出现",
                    "time": "40-38亿年前",
                    "src": "./static-2/最早生命的出现.jpg"
                },
                {
                    "name": "后期重轰炸期",
                    "time": "39亿年前",
                    "children": [
                        {
                            "name": "重轰炸事件",
                            "time": "39亿年前",
                            "description": "地球、月球、火星及金星受到小行星及彗星（微行星）撞击的高峰期。",
                            "src": "./static-2/重轰炸事件.jpg"
                        }
                    ],
                    "src": "./static-2/后期重轰炸期.jpg"
                }
            ],
            "src": "./static-2/冥古宙.jpg"
        },
        {
            "name": "太古宙",
            "time": "40亿年前",
            "children": [
                {
                    "name": "共同祖先",
                    "time": "38-35亿年前",
                    "children": [
                        {
                            "name": "原核生物出现",
                            "time": "35亿年前",
                            "description": "最后共同祖先（原核生物）在古太古代出现，属于单细胞生物，分化出细菌及古细菌。",
                            "src": "./static-2/原核生物出现.jpg"
                        },
                        {
                            "name": "细胞结构出现",
                            "time": "35-30亿年前",
                            "description": "早期原核生物都是化能生物，以二氧化碳为碳源及氧化无机物来抽取能量。",
                            "src": "./static-2/细胞结构出现.jpg"
                        },
                        {
                            "name": "蓝菌出现",
                            "time": "35亿年前",
                            "children": [
                                {
                                    "name": "光合作用蓝菌",
                                    "time": "34亿年前",
                                    "description": "能进行光合作用的蓝菌出现，以水为还原剂，并排出氧，导致海洋中铁氧化，产生铁矿石。",
                                    "src": "./static-2/光合作用蓝菌.jpg"
                                }
                            ],
                            "src": "./static-2/蓝菌出现.jpg"
                        }
                    ],
                    "src": "./static-2/最后共同祖先.jpg"
                },
                {
                    "name": "细菌演化光合作用",
                    "time": "34-29亿年前",
                    "children": [
                        {
                            "name": "光合作用原始模式",
                            "time": "33亿年前",
                            "description": "细菌发展了光合作用的原始模式，最初不会产生氧，通过电化学梯度产生三磷酸腺苷（ATP）。",
                            "src": "./static-2/光合作用原始模式.jpg"
                        },
                        {
                            "name": "能量转换过程",
                            "time": "33亿年前",
                            "description": "原核生物演化了糖酵解，从如葡萄糖的有机物释出能量，产生了现今所有生物都用到的ATP分子。",
                            "src": "./static-2/能量转换过程.jpg"
                        }
                    ],
                    "src": "./static-2/细菌演化光合作用.jpg"
                },
                {
                    "name": "微生物造岩",
                    "time": "32-30亿年前",
                    "children": [
                        {
                            "name": "叠层岩出现",
                            "time": "28-25亿年前",
                            "description": "微生物开始造岩，叠层岩出现，这是由微生物活动形成的特定类型的沉积岩。",
                            "src": "./static-2/叠层岩出现.jpg"
                        }
                    ],
                    "src": "./static-2/微生物造岩.jpg"
                },

                {
                    "name": "大氧化事件",
                    "time": "26-25亿年前",
                    "children": [
                        {
                            "name": "大气氧浓度上升",
                            "time": "25-23亿年前",
                            "description": "大氧化事件导致大气中氧气浓度上升，对厌氧细菌有毒，促进了生物演化。",
                            "src": "./static-2/大气氧浓度上升.jpg"
                        },
                        {
                            "name": "海洋氧化",
                            "time": "25-23亿年前",
                            "description": "海洋中的铁被氧化，形成大规模的条带状铁建造（BIF）。",
                            "src": "./static-2/海洋氧化.jpg"
                        }
                    ],
                    "src": "./static-2/大氧化事件.jpg"
                }
            ],
            "src": "./static-2/太古宙.jpg"
        },
        {
            "name": "元古宙",
            "time": "25亿年前",
            "children": [
                {
                    "name": "好氧细菌出现",
                    "time": "25-23亿年前",
                    "children": [
                        {
                            "name": "细菌演化",
                            "time": "25-23亿年前",
                            "description": "一些细菌演化到有能力去使用氧来有效地从有机物中抽取能量。",
                            "src": "./static-2/细菌演化.jpg"
                        },
                        {
                            "name": "能量代谢",
                            "time": "25-23亿年前",
                            "description": "几乎所有好氧细菌都用相同的三羧酸循环及氧化磷酸化来使用氧；厌氧细菌大量灭绝。",
                            "src": "./static-2/能量代谢.jpg"
                        }
                    ],
                    "src": "./static-2/好氧细菌出现.jpg"
                },
                {
                    "name": "大氧化事件影响",
                    "time": "25-23亿年前",
                    "children": [
                        {
                            "name": "大气变化",
                            "time": "25-23亿年前",
                            "description": "由于大氧化事件，大气中的还原性气体基本耗尽，海洋和地壳中的铁元素与氧气反应，形成大量红色的石英砂岩和赤铁矿。",
                            "src": "./static-2/大气变化.jpg"
                        }
                    ],
                    "src": "./static-2/大氧化事件影响.jpg"
                },
                {
                    "name": "休伦冰河期",
                    "time": "24-21亿年前",
                    "children": [
                        {
                            "name": "气候变化",
                            "time": "23-20.5亿年前",
                            "description": "由于大氧化事件，甲烷被氧气消耗殆尽，地表热量以长波辐射形式散逸到太空，造成地表温度骤降，地球表面第一次被冰雪覆盖。",
                            "src": "./static-2/气候变化.jpg"
                        }
                    ],
                    "src": "./static-2/休伦冰河期.jpg"
                },
                {
                    "name": "复杂细胞出现",
                    "time": "18.5亿年前",
                    "children": [
                        {
                            "name": "真核生物起源",
                            "time": "16.5-12亿年前",
                            "description": "复杂的细胞出现，包括有细胞器的真核生物，最接近的可能源自古细菌。大部分有细胞器的可能从共生细菌衍生而来。",
                            "src": "./static-2/真核生物起源.jpg"
                        }
                    ],
                    "src": "./static-2/复杂细胞出现.jpg"
                },
                {
                    "name": "多细胞生物出现",
                    "time": "15亿年前",
                    "children": [
                        {
                            "name": "真核藻类",
                            "time": "15-14亿年前",
                            "description": "多细胞生物出现，首先是生活在海洋中的真核藻类。",
                            "src": "./static-2/真核藻类.jpg"
                        }
                    ],
                    "src": "./static-2/多细胞生物出现.jpg"
                },
                {
                    "name": "有性生殖出现",
                    "time": "12亿年前",
                    "children": [
                        {
                            "name": "演化加速",
                            "time": "12亿年前",
                            "description": "有性生殖的出现引发更快的演化，大部分生命在海洋及湖中出现，一些蓝菌已经生活在湿润的泥土中。",
                            "src": "./static-2/演化加速.jpg"
                        }
                    ],
                    "src": "./static-2/有性生殖出现.jpg"
                },
                {
                    "name": "叠层岩达到高峰",
                    "time": "12-10亿年前",
                    "children": [
                        {
                            "name": "沉积作用",
                            "time": "12-10亿年前",
                            "description": "叠层岩达到高峰，这是由微生物活动形成的特定类型的沉积岩。",
                            "src": "./static-2/沉积作用.jpg"
                        }
                    ],
                    "src": "./static-2/叠层岩达到高峰.jpg"
                },
                {
                    "name": "罗迪尼亚大陆形成",
                    "time": "11亿年前",
                    "description": "罗迪尼亚大陆(Rodinia，来自俄语родина，祖国)是古代地球曾经存在的超大陆。根据板块重构，罗迪尼亚大陆存在于新元古代(11.5亿到7亿年前)。相对于三亿年前的盘古大陆，对罗迪尼亚大陆的地球动力状态所知甚少。可以从古地磁所提供的线索得知个别板块在罗迪尼亚大陆时代的纬度，但当时所在的经度则要靠现已散布在世界各地的相似地质特征来推测。大约七亿年前成冰纪的时候，地球进入雪球地球状态，全球温度急速下降。埃迪卡拉纪和寒武纪的生物快速演进一般认为是因为罗迪尼亚大陆的分裂引发。",
                    "src": "./static-2/罗迪尼亚大陆形成.jpg"
                },
                {
                    "name": "大型具刺疑源类出现",
                    "time": "10-7.2亿年前",
                    "children": [
                        {
                            "name": "氧气累积",
                            "time": "10-7.2亿年前",
                            "description": "氧气的累积使臭氧层可以形成，臭氧层可阻挡太阳的有害辐射，使生命可以在陆地上发展。",
                            "src": "./static-2/氧气累积.jpg"
                        }
                    ],
                    "src": "./static-2/大型具刺疑源类出现.jpg"
                },
                {
                    "name": "雪球地球事件",
                    "time": "8-5.5亿年前",
                    "children": [
                        {
                            "name": "极端冰期",
                            "time": "7.2-6.35亿年前",
                            "description": "根据雪球地球假说，成冰纪的冰河时期非常严重，连海洋亦完全结冰，只有在热带的海水仍保持是液态。",
                            "src": "./static-2/极端冰期.jpg"
                        }
                    ],
                    "src": "./static-2/雪球地球假说.jpg"
                },
                {
                    "name": "多细胞动物出现",
                    "time": "6.65亿年前",
                    "children": [
                        {
                            "name": "动物演化",
                            "time": "6.65亿年前",
                            "description": "多细胞动物在海洋出现，有研究显示最早的动物生活在湖泊的环境中。",
                            "src": "./static-2/动物演化.jpg"
                        }
                    ],
                    "src": "./static-2/多细胞动物出现.jpg"
                },
                {
                    "name": "超级大陆形成",
                    "time": "6.35-5.41亿年前",
                    "children": [
                        {
                            "name": "潘诺西亚大陆",
                            "time": "6亿年前",
                            "description": "第二个超级大陆潘诺西亚形成于6亿年前并于5.4亿年前分裂。",
                            "src": "./static-2/潘诺西亚大陆.jpg"
                        }
                    ],
                    "src": "./static-2/超级大陆形成.jpg"
                },
                {
                    "name": "埃迪卡拉纪",
                    "time": "6.35-5.41亿年前",
                    "description": "埃迪卡拉纪(英语:Ediacaran)，又称艾迪卡拉纪、震旦纪，是元古宙最后的一段时期。一般指6.35-5.41亿年前。学者曾用这个名字指称不同阶段，直到2004年5月13日，国际地质科学联合会(英语:International Union of Geological Sciences，IUGS)明确定义其年代，这是这个组织120年来首次对其加时期定义。最古老的动物遗迹可追溯至十亿年前，但最早的动物化石出现于约六亿年前的埃迪卡拉纪。埃迪卡拉动物群因为发现于南澳大利亚的埃迪卡拉山而得名。1946年，一位澳洲地质学家(Reg Sprigg)在古代的沙岩板中留意到一曾在这里发现显生宙以前的化石。研究这些化石的科学家(Martin Glaessner)认为这是珊瑚、水母和蠕虫的先驱。以下几十年，南澳大利亚还找到很多的隐生宙化石，其他各大洲也找到一些。这些化石都叫作埃迪卡拉动物。一开始，人们认为埃迪卡拉动物是寒武纪的动物，但经过仔细的观察，埃迪卡拉化石比寒武纪还久远，应属于埃迪卡拉纪。",
                    "children": [
                        {
                            "name": "阿瓦隆大爆发",
                            "time": "5.75亿年前",
                            "description": "从形态学上，埃迪卡拉纪生物与此前的生命形式以及埃迪卡拉纪生物之间都存在着很大区别，以至于它们必须被划分成新的不同物种类别。其中的许多生物都很像植物的叶片，它们在阿瓦隆纪（Avalon period）的2500万年里突然出现",
                            "src": "./static-2/阿瓦隆大爆发.jpg"
                        },
                        {
                            "name": "狄更逊水母",
                            "time": "5.71-5.41亿年前",
                            "description": "狄更逊水母（Dickinsonia）是一种复杂的动物，形状类似餐盘、浴室垫或者扁平的硬币，生活在约为5.71到5.41亿年前。 该水母呈柔软的椭圆形，身体分为多个部分，有一个肋状的凸面层。它们的正面和背面区别明显，身长可达一米，但厚度只有几毫米 。这种生物的化石最初由澳大利亚地质学家 斯普里格（Reg Sprigg）发现于澳大利亚南部，后来在 乌克兰的波多利亚省、俄罗斯的白海地区和乌拉尔山 以及中国安徽寿县均有发现。狄更逊水母是埃迪卡拉生物群的一部分",
                            "src": "./static-2/狄更逊水母.jpg"
                        },
                        {
                            "name": "斯普里格蠕虫",
                            "time": "5.5亿年前",
                            "description": "头部呈新月形的蠕虫状动物。没有人知道它是直立在海底还是像蠕虫一样爬行。分布区域:澳大利亚、非洲、俄罗斯. 体长3-5厘米. 身体很长，后部不断变小呈锥状，像尾巴。宽的前端呈圆形，由窄小、呈月牙状弧形物构成。身体被一条与身体同长的中线分开，横切面为低矮、宽大的V形体节。化石考古表明这种生物可能是地球上最早的对称性生物。",
                            "src": "./static-2/斯普里格蠕虫.jpg"
                        },
                        {
                            "name": "埃迪卡拉纪末期灭绝",
                            "time": "5.41亿年前",
                            "description": "埃迪卡拉纪末期，发生了广泛的海洋缺氧事件，在此期间缺氧覆盖了超过 21% 的海底，这也是5.5 亿年来最严重的海洋缺氧事件。结合之前西伯利亚的发现，可以这样推测，在埃迪卡拉纪的末期，寒武纪的生命已经出现，并凭借自己的优势，占据了有利地位，夺走了埃迪卡拉生物的生态位。独立于其他环境和生态因素的海洋缺氧和氧化还原异质性的扩大可能进一步打击了本就弱势的埃迪卡拉生物群，同时刺激了动物的运动性。小型贝壳类族群等寒武纪两侧对称动物的“新成员”凭借优势，挺过了这次灾难，扩大了自己的生存空间，并在远古海洋中发展出了生命的第一个高峰-寒武纪大爆发。",
                            "src": "./static-2/埃迪卡拉纪末期灭绝.jpg"
                        },
                        {
                            "name": "生物群落更迭",
                            "time": "5.41亿年前",
                            "description": "5.41亿年前发生埃迪卡拉纪末期灭绝事件，复杂的多细胞动物埃迪卡拉生物群出现，主要是刺胞动物，其次是多孔动物等。",
                            "src": "./static-2/生物群落更迭.jpg"
                        }
                    ],
                    "src": "./static-2/埃迪卡拉纪.jpg"
                },

            ],
            "src": "./static-2/元古宙.jpg"
        },
        {
            "name": "显生宙",
            "time": "5.7亿年前",
            "children": [
                {
                    "name": "寒武纪",
                    "time": "5.42-4.85亿年前",
                    "description": "寒武纪（Cambrian）是显生宙的开始，距今约5.42亿年前—4.85亿年。前一个纪是新元古代埃迪卡拉纪，后一个纪是奥陶纪。 [9]在传统理论上它可区分为三个时期：早寒武纪（5.41-5.13亿年前）、中寒武纪（5.13-5.00亿年前）、以及晚寒武纪（5.00-4.90亿年前）。2005年之后，国际地层委员会将下寒武统拆分，使得寒武系（即寒武纪时期形成的地层）由原来的三分变为四分，起始年代也有进一步修正。寒武纪动物以捕食型主导。",
                    "src": "./static-2/寒武纪.jpg"
                },
                {
                    "name": "寒武纪大爆发",
                    "time": "5.4-5.2亿年前",
                    "description": "突然出现大量无脊椎动物",
                    "src": "./static-2/寒武纪大爆发.jpg"
                },
                {
                    "name": "三叶虫",
                    "time": "5.5-2.5亿年前",
                    "classification": "节肢动物",
                    "description": "寒武纪时期种类最多的门，以三叶虫为主的节肢动物。寒武纪最成功的类群",
                    "src": "./static-2/三叶虫.jpg"
                },
                {
                    "name": "恐虾纲",
                    "time": "5.3-4.4亿年前",
                    "description": "恐虾纲（学名：Dinocaridida）是节肢动物门下的一个基干化石类群，旧时也被归为叶足动物门。此类动物均为海生，于寒武纪时最为繁盛，偶有奥陶纪的记录，还有一类名为申德汉斯虾（Schinderhannes）的成员生活在泥盆纪中早期。",
                    "src": "./static-2/恐虾纲.jpg"
                },
                {
                    "name": "海口鱼",
                    "time": "5.3亿年前",
                    "description": "海口鱼是一种原始的似鱼类生物，只有拇指般的大小，但却是生命进化史上的巨人，虽然没有坚实的外壳，但身体非常独特，拥有一根原始脊椎, 是如今所有脊椎动物的祖先。1997年8月，罗慧麟、胡世学、陈良忠在昆明海口地区首次发现首次发现了第一块脊椎动物化石——海口鱼。",
                    "src": "./static-2/海口鱼.jpg"
                },
                {
                    "name": "最早脊椎动物出现",
                    "time": "5.2亿年前",
                    "children": [
                        {
                            "name": "无颌鱼类",
                            "time": "5.2亿年前",
                            "description": "最早的脊椎动物，没有下腭且骨架由软骨构成。",
                            "src": "./static-2/无颌鱼类.jpg"
                        }
                    ],
                    "src": "./static-2/最早脊椎动物出现.jpg"
                },
                {
                    "name": "古杯动物灭绝",
                    "time": "5.0亿年前",
                    "children": [
                        {
                            "name": "古杯动物门",
                            "time": "5.0亿年前",
                            "description": "古杯动物是已知地球上最早的造礁动物，外形和化石形态多呈杯状。",
                            "src": "./static-2/古杯动物门.jpg"
                        }
                    ],
                    "src": "./static-2/古杯动物灭绝.jpg"
                },
                {
                    "name": "寒武纪-奥陶纪灭绝事件",
                    "time": "4.85亿年前",
                    "children": [
                        {
                            "name": "生物集群灭绝",
                            "time": "4.85亿年前",
                            "description": "约49%的属在这次事件中消失。",
                            "src": "./static-2/生物集群灭绝.jpg"
                        }
                    ],
                    "src": "./static-2/寒武纪-奥陶纪灭绝事件.jpg"
                },
                {
                    "name": "奥陶纪生命大辐射",
                    "time": "4.85亿年前",
                    "children": [
                        {
                            "name": "属级分类单元动物",
                            "time": "4.85亿年前",
                            "description": "动物增长了超过3倍，古生代演化动物群开始逐渐替代寒武纪演化动物群。",
                            "src": "./static-2/属级分类单元动物.jpg"
                        },
                        {
                            "name": "钙藻",
                            "time": "4.85亿年前",
                            "description": "导致浮游生物出现了爆发式的增长，浮游生态系统建立。",
                            "src": "./static-2/钙藻.jpg"
                        }
                    ],
                    "src": "./static-2/奥陶纪生命大辐射.jpg"
                },
                {
                    "name": "甲胄鱼类出现",
                    "time": "4.8亿年前",
                    "children": [
                        {
                            "name": "甲胄鱼类",
                            "time": "4.8亿年前",
                            "description": "有颌下门的祖先。",
                            "src": "./static-2/甲胄鱼类.jpg"
                        }
                    ],
                    "src": "./static-2/甲胄鱼类出现.jpg"
                },
                {
                    "name": "低等植物登陆",
                    "time": "4.8亿年前",
                    "description": "低等植物登陆",
                    "src": "./static-2/低等植物登陆.jpg"
                },
                {
                    "name": "角石",
                    "time": "4.7亿年前",
                    "description": "角石，古无脊椎动物， 鹦鹉螺亚纲 除杆石目外动物及 直角石亚纲 动物的总称。 角石具有坚硬的外壳，顾名思义，角石外壳的形状象牛或羊的角，一般是直的，也可以是弯的或盘卷的。 角石从开始发育到最终长成，壳的直径逐渐变大，肉体生长时不断前移并分泌钙质的壳，最后着生在壳体最前部，形成住室。 住室后面向壳的尖端一方则形成一系列的气室，气室对角石的升降和平衡具有重要的作用。",
                    "src": "./static-2/角石.jpg"
                },
                {
                    "name": "第一批原始植物出现",
                    "time": "4.72亿年前",
                    "children": [
                        {
                            "name": "绿藻演化",
                            "time": "4.72亿年前",
                            "description": "第一批原始植物从绿藻演化而来，开始向陆地迁移。",
                            "src": "./static-2/绿藻演化.jpg"
                        },
                        {
                            "name": "真菌",
                            "time": "4亿年前",
                            "description": "可能与植物共生，地衣是共生的例证。",
                            "src": "./static-2/真菌.jpg"
                        }
                    ],
                    "src": "./static-2/第一批原始植物出现.jpg"
                },
                {
                    "name": "螯肢动物崛起",
                    "time": "4.6亿年前",
                    "description": "以板足鲎为代表，螯肢动物崛起。",
                    "src": "./static-2/螯肢动物崛起.jpg"
                },
                {
                    "name": "星甲鱼等早期鱼类出现",
                    "time": "4.6亿年前",
                    "description": "脊椎动物的时代即将开始",
                    "src": "./static-2/星甲鱼等早期鱼类出现.jpg"
                },
                {
                    "name": "有颌下门出现",
                    "time": "4.6-4.5亿年前",
                    "children": [
                        {
                            "name": "有颌鱼类",
                            "time": "4亿年前",
                            "description": "标志着鱼类的进一步演化和发展。",
                            "src": "./static-2/有颌鱼类.jpg"
                        }
                    ],
                    "src": "./static-2/有颌下门出现.jpg"
                },
                {
                    "name": "奥陶纪生物大辐射",
                    "time": "4.4亿年前",
                    "description": "海洋生物变得枝繁叶茂",
                    "src": "./static-2/奥陶纪生物大辐射.jpg"
                },
                {
                    "name": "伽马射线暴",
                    "time": "4.4亿年前",
                    "description": "伽马射线暴是已知宇宙中最强的爆射现象，理论上是巨大恒星在燃料耗尽时塌缩爆炸或者两颗邻近的致密星体（黑洞或中子星）合并而产生的。伽马射线暴短至千分之一秒，长则数小时，会在短时间内释放出巨大能量。如果与太阳相比，它在几分钟内释放的能量相当于万亿年太阳光的总和，其发射的单个光子能量通常是典型太阳光的几十万倍。",
                    "src": "./static-2/伽马射线暴.jpg"
                },
                {
                    "name": "螯肢动物登陆",
                    "time": "4.4亿年前",
                    "description": "动物的首次登陆",
                    "src": "./static-2/螯肢动物登陆.jpg"
                },
                {
                    "name": "奥陶纪-志留纪灭绝事件",
                    "time": "4.45-4.43亿年前",
                    "description": "也称奥陶纪末大灭绝, 第一次物种大灭绝, 约85%的物种从地球上永远消失。",
                    "src": "./static-2/奥陶纪-志留纪灭绝事件.jpg"
                },
                {
                    "name": "志留纪",
                    "time": "4.44-4.19亿年前",
                    "description": "志留纪（Silurian Period）（笔石的时代，陆生植物和有颌类出现）是早古生代的最后一个纪，也是古生代第三个纪。约开始于4.4亿年前，结束于4.1亿年前。日本学者音译（日语志留读作siru，音近Silu），中文借用。由于志留系在波罗的海哥德兰岛上发育较好，因此曾一度被称为哥德兰系。志留纪可分早、中、晚三个世。志留系三分性质比较显著。一般说来，早志留世到处形成海侵，中志留世海侵达到顶峰，晚志留世各地有不同程度的海退和陆地上升，表现了一个巨大的海侵旋回。志留纪晚期，地壳运动强烈，古大西洋闭合，一些板块间发生碰撞，导致一些地槽褶皱升起，古地理面貌巨变，大陆面积显著扩大，生物界也发生了巨大的演变，这一切都标志着地壳历史发展到了转折时期。",
                    "src": "./static-2/志留纪.jpg"
                },

                {
                    "name": "维管植物出现",
                    "time": "4.3-4.28亿年前",
                    "children": [
                        {
                            "name": "裸蕨植物",
                            "time": "4.4-4亿年前",
                            "description": "标志着植物开始在陆地上占据主导地位。",
                            "src": "./static-2/裸蕨植物.jpg"
                        }
                    ],
                    "src": "./static-2/维管植物出现.jpg"
                },
                {
                    "name": "节肢动物外骨骼出现",
                    "time": "4.3-4.2亿年前",
                    "children": [
                        {
                            "name": "多足亚门",
                            "time": "4.3-4.2亿年前",
                            "description": "最早的有多足亚门（马陆及蜈蚣），及后有蝎子。",
                            "src": "./static-2/多足亚门.jpg"
                        }
                    ],
                    "src": "./static-2/节肢动物外骨骼出现.jpg"
                },
                {
                    "name": "肉鳍鱼类",
                    "time": "4.23亿年前",
                    "description": "肉鳍鱼最早出现在距今4.23亿年前的 志留纪 晚期，在 石炭纪 和 二叠纪 时期兴盛并成为 淡水生态系统 的 顶级物种，但在 二叠纪末大灭绝 中受到重创，大部分于距今6500万年前的 晚白垩纪 绝种。",
                    "src": "./static-2/肉鳍鱼类.jpg"
                },
                {
                    "name": "菊石出现",
                    "time": "4.23亿年前",
                    "description": "菊石，是软体动物门 [5]头足纲 [6]菊石目海洋动物， [7]有600多种，从四亿年前的泥盆纪早期的鹦鹉螺目进化而来。 [8]其壳体、壳形变化多样，小至几毫米，大至2米以上；大多沿平面旋卷，少数呈直形、弓形或塔形；壳饰从表面光滑至具有瘤、肋、刺、沟、棱、脊等各种形式； [9]因其表面通常有类似菊花的线纹，故名。 [7]菊石始见于早泥盆世，中生代最为繁盛， [9]广泛分布于世界各地的三叠纪海洋中，白垩纪末全部灭绝。 [10]菊石幼年期大多营漂浮或游泳生活，成年后有的在浅海底栖，有的在深水大陆架区游泳生活； [9]游速不快、运动连贯很差。 [11]菊石以一些浮游生物为食，如小的甲壳类幼虫。 [12]菊石会在水中产出成千上万枚小卵，生长速度慢。 [13]菊石壳体、壳形、壳饰及缝合线类型，是鉴定菊石类的重要依据。 [9]菊石的演化非常快，在浅海繁盛了3亿多年，所以菊石不但深受古生物学家的欢迎，而且被地质学家当作测定岩石年代的“标准”化石。",
                    "src": "./static-2/菊石出现.jpg"
                },
                {
                    "name": "脊椎动物崛起",
                    "time": "4.2亿年前",
                    "description": "以盾皮鱼类为首的鱼类凭借着下颌, 髓鞘还有最简单粗暴的体型等因素打败了螯肢动物, 从此登上王座, 生生不息",
                    "src": "./static-2/脊椎动物崛起.jpg"
                },
                {
                    "name": "邓氏鱼",
                    "time": "4.15-3.6亿年前",
                    "description": "盾皮鱼类中的佼佼者---邓氏鱼是节甲鱼目恐鱼科的一属，又名胴壳鱼。 是已知最大的盾皮鱼类，体长可达11米。 身型是类似于鲨鱼的纺锤形；头部与颈部覆盖着厚重且坚硬的甲壳；背部皮肤颜色深暗；腹部呈银色。 邓氏鱼是生活在约3.6亿至4.15亿年前的泥盆纪古生物，栖息于较浅海域。 能捕食当时海洋中任何一种生物，很可能是地球上第一个百兽之王，比陆地上第一只恐龙的诞生还要早1亿多年。",
                    "src": "./static-2/邓氏鱼.jpg"
                },
                {
                    "name": "野火现象出现",
                    "time": "4.05亿年前",
                    "children": [
                        {
                            "name": "野火",
                            "time": "4.05亿年前",
                            "description": "标志着地球大气中氧气浓度的增加，足以支持野火的发生。",
                            "src": "./static-2/野火.jpg"
                        }
                    ],
                    "src": "./static-2/野火现象出现.jpg"
                },
                {
                    "name": "泥盆纪",
                    "time": "4.05-3.5亿年前",
                    "description": "泥盆纪（Devonian Period），鱼类时代, 是地质时代古生代中的第四个纪，泥盆纪属于显生宙古生代，开始于同位素年龄416±2.8Ma，结束于359.2±2.5Ma。泥盆纪晚期，两栖动物出现。2022年9月，澳大利亚研究人员在4.192亿年前至3.589亿年前的泥盆纪一条古老的有颌鱼化石身上发现了一颗有3.8亿年历史的心脏——这是迄今为止发现的最古老的心脏。 ",
                    "src": "./static-2/泥盆纪.jpg"
                },
                {
                    "name": "首类无翅膀昆虫出现",
                    "time": "4亿年前",
                    "children": [
                        {
                            "name": "无翅膀昆虫",
                            "time": "4亿年前",
                            "description": "包括蠹鱼、跳虫及缨尾虫。",
                            "src": "./static-2/无翅膀昆虫.jpg"
                        }
                    ],
                    "src": "./static-2/首类无翅膀昆虫出现.jpg"
                },
                {
                    "name": "木本植物演化",
                    "time": "3.87亿年前",
                    "children": [
                        {
                            "name": "木质素和根系",
                            "time": "3.87亿年前",
                            "description": "植物演化出木本植物，具有木质素和发达的根系。",
                            "src": "./static-2/木质素和根系.jpg"
                        }
                    ],
                    "src": "./static-2/木本植物演化.jpg"
                },
                {
                    "name": "软骨鱼开始崛起",
                    "time": "3.82亿年前",
                    "description": "西莫利鲨目等软骨鱼类崛起, 王朝拉开序幕",
                    "src": "./static-2/软骨鱼开始崛起.jpg"
                },
                {
                    "name": "种子植物出现",
                    "time": "3.76亿年前",
                    "children": [
                        {
                            "name": "种子蕨门",
                            "time": "3.76亿年前",
                            "description": "最原始的种子植物，叶片类似真蕨类，种子生长在叶片上。",
                            "src": "./static-2/种子蕨门.jpg"
                        }
                    ],
                    "src": "./static-2/种子植物出现.jpg"
                },
                {
                    "name": "泥盆纪后期灭绝事件",
                    "time": "3.76-3.59亿年前",
                    "children": [
                        {
                            "name": "Kellwasser灭绝事件",
                            "time": "3.76-3.59亿年前",
                            "description": "严重影响了海洋生态系统。",
                            "src": "./static-2/Kellwasser灭绝事件.jpg"
                        }
                    ],
                    "src": "./static-2/泥盆纪后期灭绝事件.jpg"
                },
                {
                    "name": "小行星撞击",
                    "time": "3.75亿年前",
                    "description": "地狱序章",
                    "src": "./static-2/小行星撞击.jpg"
                },
                {
                    "name": "喷发",
                    "time": "3.75亿年前",
                    "description": "小行星撞击导致海底火山和地幔柱喷发",
                    "src": "./static-2/喷发.jpg"
                },
                {
                    "name": "提塔利克鱼出现",
                    "time": "3.75亿年前",
                    "description": "第一只会四足爬行的脊椎动物---提塔利克鱼被认为是鱼类及两栖类之间的物种。与过去许多更类似鱼类的化石不同，它的“鳍”拥有原始的腕骨及单纯的趾头，表示它们可以承受重量。仔细观察这些接合处显示提塔利克鱼虽然很可能无法使用它们来行走，但是它们可能可以用来支撑身体，就像伏地挺身一样。前鳍的骨骼显示出它们可能拥有许多肌肉组织，这表示它们拥有发达的肌肉，而且有能力像手腕一样弯曲。这些类似手腕的特征可以帮助提塔利克鱼在快速移动时稳定身体的底部。位于头顶上方的气孔也是值得注意的特征，这显示它们拥有功能跟腮一样好的肺脏。提塔利克鱼可以在浅海地区使用这个构造，因为这里温度较高，导致氧气含量较低。这种比较进化的构造也促进肋骨朝向更强壮的方向来演化，这是一个陆生生物的关键构造。更强壮的肋骨可以让提塔利克鱼的身体在任何时间冒险离开水域。提塔利克鱼也趋乏许多鱼类拥有的特征－位于腮附近的骨盘限制头部的转动，这也让它们成为最早拥有颈部的鱼类。这也让它们在狩猎时拥有更多的自由，不论是在陆地上或是浅水中。",
                    "src": "./static-2/提塔利克鱼出现.jpg"
                },
                {
                    "name": "四足总纲出现",
                    "time": "3.75-3.65亿年前",
                    "children": [
                        {
                            "name": "肉鳍鱼类演化",
                            "time": "3.75-3.65亿年前",
                            "description": "一些淡水的肉鳍鱼类发展了支撑结构并成为四足总纲。",
                            "src": "./static-2/肉鳍鱼类.jpg"
                        }
                    ],
                    "src": "./static-2/四足总纲出现.jpg"
                },
                {
                    "name": "泥盆纪末大灭绝",
                    "time": "3.74-3.5亿年前",
                    "description": "泥盆纪后期灭绝-第二次物种大灭绝（又称晚泥盆纪灭绝事件或泥盆纪晚期灭绝事件、泥盆纪大灭绝），是地球生物史上五次主要的大规模物种灭绝事件之中的第四大物种灭绝事件，发生于古生代泥盆纪晚期。本次灭绝事件又可被细分为许多个别的小事件，而其中发生在3.74亿年前的凯尔瓦塞事件是本次灭绝事件中最严重的，并标志着泥盆纪最后一个时期法门阶动物群阶的开始，即弗拉斯阶-法门阶的边界。 [1]另外第二大的罕根堡事件则终结了泥盆纪时期。总体而言，约19％的科和50％的属在泥盆纪后期灭绝事件中消失。",
                    "src": "./static-2/泥盆纪末大灭绝.jpg"
                },
                {
                    "name": "罕根堡事件",
                    "time": "3.72亿年前",
                    "description": "植物的蓬勃发展导致陆地氧气过剩, 严重破坏了氮磷循环还导致大规模赤潮现象, 造成海洋大缺氧",
                    "src": "./static-2/罕根堡事件.jpg"
                },
                {
                    "name": "脊椎动物登陆",
                    "time": "3.7亿年前",
                    "description": "提塔利克鱼等肉鳍鱼类开始了登陆的壮举",
                    "src": "./static-2/脊椎动物登陆.jpg"
                },
                {
                    "name": "含肺鱼",
                    "time": "3.6亿年前",
                    "description": "肉鳍鱼战力巅峰---含肺鱼为大型鱼类，体长约2.5—3.7米（8.2—12.1英尺）[2][7]。头颅上覆盖着一层厚重的皮骨，口内具有牙齿且位于前上颌骨上的尖牙长度可达 5 cm（2英寸）[2][8]。含肺鱼体表由圆鳞覆盖[8][7]。它们也具有巨大的感觉管来帮助感测周遭猎物的活动，这可能是因为它们所居住的淡水环境水质污浊，无法依赖视力[7]。",
                    "src": "./static-2/含肺鱼.jpg"
                },
                {
                    "name": "鱼石螈出现",
                    "time": "3.6亿年前",
                    "description": "第一只真正意义上的两栖动物----鱼石螈（学名Ichthyostega）是一属早期的四足总纲，生存于3亿6千7百万至3亿6千2百5十万年前的上泥盆纪，是鱼类及两栖类的中间生物，从 尾部 等体型看类似现代的鲶鱼长了脚。 鱼石螈有脚，但却可能不是用作行走，而是用来穿越 沼泽。 有时它被认为是属于两栖类，但却并不正确。 最早的两栖类要到石炭纪才出现。 化石见于格陵兰东部的上泥盆统。 是已知最早的两生类之一，保留许多像鱼的特征徵。",
                    "src": "./static-2/鱼石螈出现.jpg"
                },
                {
                    "name": "Hangenberg灭绝事件",
                    "time": "3.59亿年前",
                    "children": [
                        {
                            "name": "盾皮鱼类灭绝",
                            "time": "3.59亿年前",
                            "description": "严重影响了陆地和淡水生态系统。",
                            "src": "./static-2/盾皮鱼类灭绝.jpg"
                        }
                    ],
                    "src": "./static-2/Hangenberg灭绝事件.jpg"
                },
                {
                    "name": "软骨鱼类黄金时期",
                    "time": "3.59-2.51亿年前",
                    "children": [
                        {
                            "name": "软骨鱼类",
                            "time": "3.59-2.51亿年前",
                            "description": "软骨鱼类在这一时期达到鼎盛。",
                            "src": "./static-2/软骨鱼类.jpg"
                        }
                    ],
                    "src": "./static-2/软骨鱼类黄金时期.jpg"
                },
                {
                    "name": "昆虫崛起",
                    "time": "3.55亿年前",
                    "description": "高浓度的氧气使昆虫体型一再变大。",
                    "src": "./static-2/昆虫崛起.jpg"
                },
                {
                    "name": "石炭纪",
                    "time": "3.55-2.95亿年前",
                    "description": "巨虫时代---石炭纪（Carboniferous period）是古生代的第5个纪，开始于距今3.5亿年，延续了约6500万年。它可以区分为两个时期:始石炭纪（又叫密西西比纪，3亿2000-3亿5000万年前）、和后石炭纪（又叫宾夕法尼亚纪，2亿8600-3亿2000万年前）。由于这一时期形成的地层中含有丰富的煤炭，因而得名“石炭纪”。 [3]石炭纪时陆地面积不断增加，陆生生物空前发展。当时气候温暖、湿润，沼泽遍布。大陆上出现了大规模的森林，给煤的形成创造了有利条件。",
                    "src": "./static-2/石炭纪.jpg"
                },
                {
                    "name": "卡罗冰河时期",
                    "time": "3.5-2.5亿年前",
                    "children": [
                        {
                            "name": "冰川作用",
                            "time": "3.5-2.5亿年前",
                            "description": "大规模的冰川作用，大冰盖分布于古南纬60°以内的今南非、阿根廷等地。",
                            "src": "./static-2/冰川作用.jpg"
                        },
                        {
                            "name": "希伯特鲎",
                            "time": "3.5-2.5亿年前",
                            "description": "板足鲎之末裔",
                            "src": "./static-2/希伯特鲎.jpg"
                        },
                        {
                            "name": "巨脉蜻蜓",
                            "time": "3.5-2.5亿年前",
                            "description": "生命第一次征服了天空, 最大的昆虫，翅膀展开长达75厘米",
                            "src": "./static-2/巨脉蜻蜓.jpg"
                        },
                    ],
                    "src": "./static-2/卡罗冰河时期.jpg"
                },
                {
                    "name": "离片锥目、爬行形类出现",
                    "time": "3.4-3.3亿年前",
                    "children": [
                        {
                            "name": "离片锥目和爬行形类",
                            "time": "3.4-3.3亿年前",
                            "description": "标志着陆地脊椎动物的进一步演化。",
                            "src": "./static-2/离片锥目和爬行形类.jpg"
                        }
                    ],
                    "src": "./static-2/离片锥目、爬行形类出现.jpg"
                },
                {
                    "name": "披铠节胸虫",
                    "time": "3.4-2.8亿年前",
                    "description": "可达2.7米左右的史前蜈蚣",
                    "src": "./static-2/披铠节胸虫.jpg"
                },
                {
                    "name": "昆虫能够飞行",
                    "time": "3.25亿年前",
                    "children": [
                        {
                            "name": "飞行昆虫",
                            "time": "3.25亿年前",
                            "description": "出现了多个目，如古网翅目、疏翅目、透翅目及原直翅目。",
                            "src": "./static-2/飞行昆虫.jpg"
                        }
                    ],
                    "src": "./static-2/昆虫能够飞行.jpg"
                },
                {
                    "name": "羊膜动物",
                    "time": "3.2亿年前",
                    "description": "爬行形类的一支演化出羊膜卵，产生了能在地上繁殖的羊膜动物。",
                    "src": "./static-2/羊膜动物.jpg"
                },
                {
                    "name": "羊膜卵出现",
                    "time": "3.1亿年前",
                    "src": "./static-2/羊膜卵出现.jpg"
                },
                {
                    "name": "石炭纪雨林崩溃事件",
                    "time": "3.06-3.00亿年前",
                    "children": [
                        {
                            "name": "雨林崩溃",
                            "time": "3.06-3.00亿年前",
                            "description": "石炭纪末小灭绝事件 - 地球气候开始动荡，干湿季节变得鲜明，冰川导致雨林迅速萎缩分隔成孤立的小块。",
                            "src": "./static-2/雨林崩溃.jpg"
                        }
                    ],
                    "src": "./static-2/石炭纪雨林崩溃事件.jpg"
                },

                {
                    "name": "盘古大陆形成",
                    "time": "3亿年前",
                    "children": [
                        {
                            "name": "盘古大陆",
                            "time": "3亿年前",
                            "description": "地球上的大洲最近的闭合，维持了1亿年左右。",
                            "src": "./static-2/盘古大陆.jpg"
                        }
                    ],
                    "src": "./static-2/盘古大陆形成.jpg"
                },
                {
                    "name": "合弓纲占据陆地生态系统",
                    "time": "3-2.51亿年前",
                    "children": [
                        {
                            "name": "合弓纲",
                            "time": "3-2.51亿年前",
                            "description": "羊膜动物的一支合弓纲占据了陆地生态系统的主导。",
                            "src": "./static-2/合弓纲.jpg"
                        }
                    ],
                    "src": "./static-2/合弓纲占据陆地生态系统.jpg"
                },
                {
                    "name": "石松类衰落，种子蕨和裸子植物兴起",
                    "time": "2.99亿年前",
                    "children": [
                        {
                            "name": "植物群落更替",
                            "time": "2.99亿年前",
                            "description": "石炭纪雨林崩溃事件导致石松类衰落，种子蕨和裸子植物兴起。",
                            "src": "./static-2/植物群落更替.jpg"
                        }
                    ],
                    "src": "./static-2/石松类衰落，种子蕨和裸子植物兴起.jpg"
                },
                {
                    "name": "笠头螈",
                    "time": "2.99-2.51亿年前",
                    "description": "回旋镖似的脑袋可能是为了增加防御力 - 笠头螈（Diplocaulus）是生活在二叠纪中一种形状古怪的两栖动物。它的身体细扁，长约60厘米。头部象三角箭头向左右枝出，比身体还要宽，因此形状十分奇怪。它双眼在身体上侧，口在下面。它有长尾便于游水。笠头螈比引螈或者双椎螈更善于游泳。它四肢软弱，各有五趾，经常在泥岸上瞌睡。",
                    "src": "./static-2/笠头螈.jpg"
                },
                {
                    "name": "二叠纪",
                    "time": "2.9-2.5亿年前",
                    "description": "最后的古生代 - 使合弓纲脱离了蜥蜴的样貌，标志着哺乳动物的早期演化。",
                    "src": "./static-2/二叠纪.jpg"
                },
                {
                    "name": "旋齿鲨",
                    "time": "2.9-2.5亿年前",
                    "description": "鲨鱼演化史上最著名的妖孽 - 旋齿鲨（Helicoprion），Helico源自希腊语“螺旋状”，Prion则源自“锯”，组合起来意即“螺旋锯”。这用来指它的牙齿，这些牙齿从大到小，内卷成环状螺旋形齿，犹如铣刀般，极富切削感，看上去令人不寒而栗。而问题也就出在这些牙齿上，打自发现那年起，旋齿到底于鲨鱼的哪个位置的争论便持续迄今。因为无论是现生的鲨鱼，还是其它脊椎动物，都没有任何一个种类发现长有这种旋齿。在形形色色的古生物世界里，有一种充满神秘色彩的动物，它的名字叫旋齿鲨。多年来，人们所能见到的只是它奇妙的、螺旋排列的牙齿（古生物学称之为“螺旋齿”），真正完整的骨架当前还没有发现，因此，它的“神秘”引起了很多古生物专家及古生物爱好者的关注",
                    "src": "./static-2/旋齿鲨.jpg"
                },
                {
                    "name": "异齿龙",
                    "time": "2.8-2.65亿年前",
                    "description": "盘龙类的昙花一现 - 异齿龙 [1]又名异齿兽、长棘龙，它是类似哺乳动物的盘龙类肉食动物，生活在二叠纪。异齿龙与哺乳动物关系较近，与恐龙、蜥蜴、鸟类等的关系较远，它的化石在北美与欧洲等。异齿龙是二叠纪时期的肉食性古生物，一般大众将异齿龙联想是恐龙的一份子，但异齿龙其实并不是恐龙。更确切地说，它们被归类为盘龙目。尽管它的外形像蜥蜴，但异齿龙与哺乳类的关系较接近，离真爬行动物（如恐龙、蜥蜴、鸟等）较远。",
                    "src": "./static-2/异齿龙.jpg"
                },
                {
                    "name": "兽孔目出现",
                    "time": "2.75亿年前",
                    "children": [
                        {
                            "name": "兽孔目",
                            "time": "2.75亿年前",
                            "description": "一部分异齿龙类演化出了犬齿等器官, 合弓纲脱离了蜥蜴的样貌，标志着哺乳动物的早期演化。",
                            "src": "./static-2/兽孔目.jpg"
                        }
                    ],
                    "src": "./static-2/兽孔目出现.jpg"
                },
                {
                    "name": "奥尔森灭绝事件",
                    "time": "2.75亿年前",
                    "description": "未知原因的小灭绝事件，盘龙类的统治戛然而止。",
                    "src": "./static-2/奥尔森灭绝事件.jpg"
                },
                {
                    "name": "主龙形下纲动物出现",
                    "time": "2.65亿年前",
                    "children": [
                        {
                            "name": "主龙形下纲",
                            "time": "2.65亿年前",
                            "description": "最初的主龙形下纲动物出现，是恐龙和鸟类的早期祖先。",
                            "src": "./static-2/主龙形下纲.jpg"
                        }
                    ],
                    "src": "./static-2/主龙形下纲动物出现.jpg"
                },
                {
                    "name": "峨嵋山暗色岩事件",
                    "time": "2.6亿年前",
                    "description": "今峨眉山一带的超级火山突然喷发, 整个四川地区变成一片火海",
                    "children": [
                        {
                            "name": "恐头兽亚目灭绝",
                            "time": "2.6亿年前",
                            "description": "导致繁盛一时的恐头兽亚目灭绝，其他兽孔目和副爬行动物占据了陆地生态位。",
                            "src": "./static-2/恐头兽亚目灭绝.jpg"
                        }
                    ],
                    "src": "./static-2/峨嵋山暗色岩事件.jpg"
                },
                {
                    "name": "丽齿兽",
                    "time": "2.55-2.51亿年前",
                    "description": "最早掌握剑齿的用法 - 丽齿兽，又名丽兽。拉丁文名为Gorgonopsid，起源于二叠纪，2.52亿年前。丽齿兽食肉，外形像狼，是首次长有犬齿的动物，这是生物进化史上的一大重要突破。之后许多哺乳动物也长有相似的獠牙，它们能够轻易的撕开皮肉， 就如同一把炙热的金属刀滑过黄油一般，它有一个称号：“二叠纪的野狼”",
                    "src": "./static-2/丽齿兽.jpg"
                },
                {
                    "name": "主龙类",
                    "time": "2.52亿年前",
                    "description": "主龙类开始演化出许多分支，包括恐龙和鸟类的直接祖先。",
                    "src": "./static-2/主龙类.jpg"
                },
                {
                    "name": "盾甲龙",
                    "time": "2.52-2.48亿年前",
                    "description": "龙族早期大型食草动物",
                    "src": "./static-2/盾甲龙.jpg"
                },
                {
                    "name": "西伯利亚暗色岩事件",
                    "time": "2.51亿年前",
                    "description": "今西伯利亚地区的超级火山突然喷发, 规模比峨眉山暗色岩时间更为庞大",
                    "src": "./static-2/西伯利亚暗色岩事件.jpg"
                },
                {
                    "name": "水龙兽",
                    "time": "2.5-2.4亿年前",
                    "description": "曾经最庞大的兽群 - 水龙兽，已绝灭的类哺乳爬行动物。头大、颈短、体桶状。体形有点类似今日的河马。其特征是面部显著向下折曲，因此头骨很高。鼻位置很靠上，一直到眼孔之下，身体结构已具有若干哺乳动物的进步性状，但头部尚原始，生活于湖泊池沼边缘，以植物为生存活在二叠纪晚期到三叠纪早期,约2亿5000万年前，是一种极其古老的生物。",
                    "src": "./static-2/水龙兽.jpg"
                },
                {
                    "name": "二叠纪-三叠纪灭绝事件",
                    "time": "2.51-2.48亿年前",
                    "description": "第三次物种大灭绝, 又叫P-T灭绝事件, 二叠纪末大灭绝, 大死亡事件, 是生命诞生以来最惨烈的大灭绝事件, 约有95%的物种在这场浩劫中绝迹, 包括寒武纪就诞生的三叶虫纲",
                    "src": "./static-2/二叠纪-三叠纪灭绝事件.jpg"
                }
            ],
            "src": "./static-2/显生宙.jpg"
        },
        {
            "name": "中生代",
            "time": "2.52-0.67亿年前",
            "children": [
                {
                    "name": "主龙类及裸子植物分化",
                    "time": "2.51-2亿年前",
                    "children": [
                        {
                            "name": "伪鳄类",
                            "time": "2.51-2亿年前",
                            "src": "./static-2/伪鳄类.jpg"
                        },
                        {
                            "name": "恐龙类",
                            "time": "2.51-2亿年前",
                            "src": "./static-2/恐龙类.jpg"
                        },
                        {
                            "name": "翼龙目",
                            "time": "2.51-2亿年前",
                            "src": "./static-2/翼龙目.jpg"
                        },
                        {
                            "name": "裸子植物",
                            "time": "2.51-2亿年前",
                            "children": [
                                {
                                    "name": "松柏门",
                                    "time": "2.51-2亿年前",
                                    "src": "./static-2/松柏门.jpg"
                                },
                                {
                                    "name": "苏铁门",
                                    "time": "2.51-2亿年前",
                                    "src": "./static-2/苏铁门.jpg"
                                }
                            ],
                            "src": "./static-2/裸子植物.jpg"
                        }
                    ],
                    "src": "./static-2/主龙类及裸子植物分化.jpg"
                },
                {
                    "name": "三叠纪",
                    "time": "2.5-2亿年前",
                    "description": "主龙王朝开幕 - 三叠纪 [7]（英语：Triassic），是公元前2.5亿至公元前2亿年的一个地质时代，它位于二叠纪和侏罗纪之间，是中生代的第一个纪。三叠纪的开始和结束各以一次灭绝事件为标志。虽然这段时间的岩石标志非常明显和清晰，其开始和结束的准确时间却如同其它古远的地质时代无法非常精确地被确定。其误差在正负数百万年。",
                    "src": "./static-2/三叠纪.jpg"
                },
                {
                    "name": "鱼龙下海",
                    "time": "2.5亿年前",
                    "description": "鱼龙（拉丁语学名：Ichthyosauria，来自希腊语ιχθυς，“鱼”和σαυρος“蜥蜴”）是一种类似鱼和海豚的大型海栖爬行动物。它们生活在中生代的大多数时期，最早出现于约2.5亿年前，比恐龙稍微早一点（2.3亿年前），约9000万年前它们消失，比恐龙灭绝早约2500万年。有些鱼龙身体十分渺小，但还有些鱼龙身体很大。在三叠纪中期今天还未能确定的陆栖爬行动物逐渐回到海洋中生活，演化为鱼龙，这个过程类似海豚和鲸的演化过程。在侏罗纪它们分布尤其广泛。在白垩纪它们作为最高的水生食肉动物被蛇颈龙取代。",
                    "src": "./static-2/鱼龙下海.jpg"
                },
                {
                    "name": "伪鳄类崛起",
                    "time": "2.47亿年前",
                    "description": "伪鳄类（学名：Pseudosuchia）是主龙形下纲中的两个主要演化支之一。它们的头骨通常是厚重的，尤其是与鸟颈类主龙相比；伪鳄类主龙的口鼻部通常是长而狭窄的，颈部短而强壮，四肢的结构介于典型爬行动物的往两侧延伸到恐龙或哺乳类的直立四肢之间（虽然恐龙与哺乳类的姿态不同）。身体通常由两排或更多排的甲板保护者。伪鳄类主龙的体形大多数相当大，可达3米甚至更长。",
                    "src": "./static-2/伪鳄类崛起.jpg"
                },
                {
                    "name": "派克鳄",
                    "time": "2.47-2.45亿年前",
                    "description": "派克鳄（Pachycormus）, 与主龙类血缘最近, 在距今约2.45亿到2.3亿年前的三叠纪中期，生活着一种小型的爬行动物——派克鳄。1913年，派克鳄的第一个化石在南非被发现，是以英国科学家派克的名字来命名的一种爬行动物，派克鳄体型较小，行动非常灵活，令人注目的是，派克鳄拥有相当长的后肢，能够只以后肢快速奔跑，这是一个非常进步的特征，有利于掠食者更加高效地捕猎。这种两足运动的趋势，一直体现在某些恐龙与早期镶嵌踝类主龙身上",
                    "src": "./static-2/派克鳄.jpg"
                },
                {
                    "name": "板龙",
                    "time": "2.4亿年前",
                    "description": "早期大型恐龙 - 板龙是三叠纪的古老恐龙，生存于2.22亿年 ~ 2亿年前，它是出现在地球上的第一种巨型恐龙。在板龙出现以前，最大的植食类动物的身材也就像一头猪那样大，而板龙要大得多，它的身体有一辆公共汽车那么大。板龙意为'平板的爬行动物'，是生存于2亿1000万年前，晚三叠纪的古老恐龙。体长6－8米，身高3.6米，体重5吨左右，据考古研究它是生活在地球上食植物第一种巨型恐龙。",
                    "src": "./static-2/板龙.jpg"
                },
                {
                    "name": "幻龙",
                    "time": "2.4亿年前",
                    "description": "幻龙是远古时期鳍龙类的一种，（其它鳍龙类包括蛇颈龙类和盾齿龙类），属三叠纪时期动物，据今达2.43亿年，它们体型大小不一，最小的只有36厘米，最大的长达6米，长有锐利的牙齿，捕食各种鱼类，另外幻龙的四肢相当发达，可以想象它们会爬上岸捕食或产卵。",
                    "src": "./static-2/幻龙.jpg"
                },
                {
                    "name": "卡尼期洪积事件",
                    "time": "2.34-2.32亿年前",
                    "description": "一场连绵200万年的大雨 - 卡尼期洪积事件，指2.33亿年前发生的一次生物大灭绝事件，期间200多万年气候处于湿润期。该事件除了导致一些物种灭绝外，也将恐龙送上地球之王的宝座。",
                    "src": "./static-2/卡尼期洪积事件.jpg"
                },
                {
                    "name": "哺乳形类出现",
                    "time": "2.3亿年前",
                    "description": "哺乳类是很古老的类群，出现于中生代三叠纪末期，其祖先可追溯到 大约在2.8 亿年前的二叠纪。 早在恐龙兴起之前，有一些类哺乳类就已在陆地生活，它们属合颞窝类（Synapsida），在其头骨两侧各有一个颞窝，以后眶骨和鳞状骨为上界、颧骨为下界。 最早的肉食性合颞窝类是盘龙类，是二叠纪早期最常见的羊膜类，外形与蜥蜴接近。 后被更进化的类群兽孔类所代替。",
                    "src": "./static-2/哺乳形类出现.jpg"
                },
                {
                    "name": "恐龙诞生",
                    "time": "2.25亿年前",
                    "description": "中生代的无冕之王",
                    "src": "./static-2/恐龙诞生.jpg"
                },
                {
                    "name": "菊石亚纲崛起",
                    "time": "2.25亿年前",
                    "description": "菊石亚纲动物是已绝灭的海生无脊椎动物，生存于中奥陶纪至晚白垩纪，因它的表面通常具有类似菊花的线纹而得名。有关菊石动物的知识主要来自保存为化石的菊石壳体和口盖以及通过对菊石在地层中的分布和保存状态的观察并基于与现代海洋中生活的鹦鹉螺属的对比而获得。",
                    "src": "./static-2/菊石亚纲崛起.jpg"
                },
                {
                    "name": "波斯特鳄",
                    "time": "2.21亿年前",
                    "description": "波斯特鳄（Postosuchus）是一种产自德克萨斯、亚利桑那和新墨西哥州的巨型初龙类，以得克萨斯州的小镇波斯特命名。从复原图上看，波斯特鳄有些像鳄鱼和霸王龙的杂交种。波斯特鳄体长最大为6米，具有较高的巨大头骨，似乎是能够抓住并杀死当时大多数大型动物的令人恐惧的捕食动物。",
                    "src": "./static-2/波斯特鳄.jpg"
                },
                {
                    "name": "翼龙诞生",
                    "time": "2.16亿年前",
                    "description": "脊椎动物第一次拥抱天空 - 翼龙，是蜥形纲翼龙目的爬行动物的统称，与恐龙和鳄类有着较近的亲缘关系，其名字的含义为有翼的蜥蜴。 [13]翼龙是一种已经灭绝的能够飞行的爬行动物和脊椎动物。 [14]翼龙前肢已变成膜状翼，由前肢第四指加长与腹侧延伸出的薄膜相连而成，第五指消失，其余三指很小，前端有爪。骨骼中空而轻，头骨低平，多具锥形齿，胸骨发育。翼龙仅具膜状翼，翼虽大，但因无骨骼支撑，故不能作远距离飞行。 [15]雄性的骨盆小，头骨有脊；而雌性骨盆大，头骨无脊。 [16]翼龙化石在中国的新疆、内蒙古、辽宁、河北、甘肃、四川、山东、浙江等地均有发现，而在世界范围内，目前已经在各大洲，包括南极洲都发现了翼龙化石。 [17]翼龙目的生存年代从三叠纪晚期开始一直延续到白垩纪晚期，几乎跨越了整个中生代。 [18]翼龙脑子大，具有良好的视觉神经系统，视觉发达，每日盘旋于海域上空， [19]生活在海、湖边，有的以鱼虾类为食， [20]还有的以昆虫或水果为食。 [21]翼龙以卵生的方式繁殖，类似今天的鸟类，它们会把卵产在水边的沙地上。 [22]翼龙灭绝的原因，有科学专家通过研究认为，火山频繁的爆发导致翼龙灭绝，也有专家认为翼龙有可能在进化到了温血动物阶段，由于进化速度不快、程度不同，最终还是被进化速度快、程度高的鸟类独霸了天空。 [23]新的观点认为翼龙在进化的过程中适应了依靠海洋的生活模式，所以，当白垩纪灭绝事件发生时，翼龙与海洋生物一同灭绝。",
                    "src": "./static-2/翼龙诞生.jpg"
                },
                {
                    "name": "秀尼鱼龙",
                    "time": "2.15亿年前",
                    "description": "鱼龙体型巅峰, 部分种类体长可达21m - 秀尼鱼龙属是鱼龙目萨斯特鱼龙科 [1]的一个属，学名Shonisaurus。秀尼鱼龙的化石是在1920年首次发现，发现于内华达州的大型沉积物里。30年后，它们的化石被挖掘出来，并且发现该沉积物有37个非常大型鱼龙类化石，它们后来被命名为秀尼鱼龙（Shonisaurus），意思为“来自休尼山脉的蜥蜴”，以该化石发现的地层组命名。秀尼鱼龙是发现的最大的鱼龙目动物，它的体长比得上一辆公共汽车。秀尼鱼龙处在鱼龙目进化历程中很早的阶段，有一些很特别的特征，使其有别于它的亲缘动物。它体型宽大笨重，鳍状肢很长且等尺寸，牙齿只长在口腔的前部。秀尼鱼龙的食物还不确定，但就其尺寸而言，它也是一种可怕的掠食者，能够捕捉很多其他海洋动物",
                    "src": "./static-2/秀尼鱼龙.jpg"
                },
                {
                    "name": "三叠纪末大灭绝",
                    "time": "2.14-1.99亿年前",
                    "description": "第四次物种大灭绝, 又叫T-J灭绝事件, 三叠纪-侏罗纪灭绝事件, 约有76%的物种灭绝 - 三叠纪-侏罗纪灭绝事件（Triassic–Jurassic extinction event）是五大生物集群灭绝事件之一，发生于三叠纪与侏罗纪之间，大约是1.996亿年前（一说是2.14亿年前）。这次灭绝事件的影响程度遍及陆地与海洋。在海洋生物中，有20%的科消失，包含著名的牙形石。大型鳄类（如角鳄、狂齿鳄、波斯特鳄、灵鳄、楔形鳄）遭遇三叠纪早期植物面貌多为一些耐旱的类型，随着气候由半干热、干热向温湿转变遭受重创；大部分兽孔目、以及许多大型两栖动物也灭亡。三叠纪是古生代生物群消亡后现代生物群开始形成的过渡时期，植物趋向繁茂，低丘缓坡则分布有和现代相似的常绿树，如松、苏铁等，而盛产于古生代的主要植物群（尤其是裸子植物）几乎全部灭绝。三叠纪-侏罗纪灭绝事件使当时至少50%的物种消失。这次灭绝事件造成许多空缺的生态位，使恐龙成为了侏罗纪的优势陆地动物。三叠纪-侏罗纪灭绝事件发生于盘古大陆分裂前，经历时间短于一万年。这次灭绝事件，也造成三叠纪恐龙、侏罗纪恐龙的明显差异。",
                    "src": "./static-2/三叠纪末大灭绝.jpg"
                },
                {
                    "name": "狂齿鳄",
                    "time": "2.03亿年前",
                    "description": "狂齿鳄，属于副鳄类。生活在2.03亿年前年前的中生代三叠纪和侏罗纪，体长可达12英尺，性情凶恶贪婪，是当时湖泊中的顶级猎食者。常常潜伏在溪流和湖泊中，仅将鼻孔露出水面，捕食鱼类或其他动物。该物种在第四次生物大灭绝中灭绝。",
                    "src": "./static-2/狂齿鳄.jpg"
                },
                {
                    "name": "哺乳动物的首个先躯兽孔目出现",
                    "time": "2亿年前",
                    "children": [
                        {
                            "name": "真犬齿兽下目",
                            "time": "2亿年前",
                            "src": "./static-2/真犬齿兽下目.jpg"
                        },
                        {
                            "name": "SRY基因演化",
                            "time": "2亿年前",
                            "src": "./static-2/SRY基因演化.jpg"
                        }
                    ],
                    "src": "./static-2/哺乳动物的首个先躯兽孔目出现.jpg"
                },
                {
                    "name": "侏罗纪",
                    "time": "2-1.45亿年前",
                    "description": "恐龙盛世 - 侏罗纪（Jurassic）是一个地质年代，界于三叠纪和白垩纪之间，约公元前1亿9960万年（误差值为60万年）到1亿4550万年（误差值为400万年）。侏罗纪是中生代的第二个纪，开始于三叠纪-侏罗纪灭绝事件。虽然这段时间的岩石标志非常明显和清晰，其开始和结束的准确时间却如同其它古远的地质时代，无法非常精确地被确定。",
                    "src": "./static-2/侏罗纪.jpg"
                },
                {
                    "name": "蛇颈龙崛起",
                    "time": "2亿年前",
                    "description": "蛇颈龙是已灭绝的蛇颈龙属海生爬行类的统称，属双孔亚纲鳍龙目，是一类适应浅水环境中生活的类群，个体较大，且长颈，因以得名。从三叠纪晚期开始出现，到侏罗纪已遍布世界各地，白垩纪末灭绝。蛇颈龙体型硕大无比，是海洋中的霸王，与鱼龙类一起统治着中生代的海洋。",
                    "src": "./static-2/蛇颈龙崛起.jpg"
                },
                {
                    "name": "恐龙存活并繁盛",
                    "time": "2亿年前",
                    "children": [
                        {
                            "name": "三叠纪-侏罗纪灭绝事件",
                            "time": "2亿年前",
                            "src": "./static-2/三叠纪-侏罗纪灭绝事件.jpg"
                        },
                        {
                            "name": "联体病毒科出现",
                            "time": "2亿年前",
                            "src": "./static-2/联体病毒科出现.jpg"
                        }
                    ],
                    "src": "./static-2/恐龙存活并繁盛.jpg"
                },
                {
                    "name": "链鳄",
                    "time": "1.93亿年前",
                    "description": "链鳄属（属名：Desmatosuchus）又名有角鳄、钉鳄龙，意为，是种已灭绝主龙类爬行动物，属于坚蜥目。链鳄是最大型的坚蜥目动物之一，身长5米，高度约1.5米。它们生存于晚三叠纪的北美洲德州。链鳄的外表类似它们的近亲，身体拥有鳞甲，头部类似猪。链鳄使用它们铲状口鼻部来拔起植物。不像其他坚蜥类，链鳄背部侧边有两排尖刺，肩膀两侧各有一只长达45公分的尖角。这提供链鳄额外的防护以抵抗掠食动物",
                    "src": "./static-2/链鳄.jpg"
                },
                {
                    "name": "现今两栖类开始出现",
                    "time": "1.9-1.5亿年前",
                    "children": [
                        {
                            "name": "滑体亚纲",
                            "time": "1.9-1.5亿年前",
                            "children": [
                                {
                                    "name": "无尾目",
                                    "time": "1.9-1.5亿年前",
                                    "src": "./static-2/无尾目.jpg"
                                },
                                {
                                    "name": "有尾目",
                                    "time": "1.9-1.5亿年前",
                                    "src": "./static-2/有尾目.jpg"
                                }
                            ],
                            "src": "./static-2/滑体亚纲.jpg"
                        }
                    ],
                    "src": "./static-2/现今两栖类开始出现.jpg"
                },
                {
                    "name": "盘古大陆分裂",
                    "time": "1.8亿年前",
                    "children": [
                        {
                            "name": "冈瓦那大陆",
                            "time": "1.8亿年前",
                            "children": [
                                {
                                    "name": "南极洲",
                                    "time": "1.8亿年前",
                                    "src": "./static-2/南极洲.jpg"
                                },
                                {
                                    "name": "澳洲",
                                    "time": "1.8亿年前",
                                    "src": "./static-2/澳洲.jpg"
                                },
                                {
                                    "name": "南美洲",
                                    "time": "1.8亿年前",
                                    "src": "./static-2/南美洲.jpg"
                                },
                                {
                                    "name": "非洲",
                                    "time": "1.8亿年前",
                                    "src": "./static-2/非洲.jpg"
                                },
                                {
                                    "name": "印度",
                                    "time": "1.8亿年前",
                                    "src": "./static-2/印度.jpg"
                                }
                            ],
                            "src": "./static-2/冈瓦那大陆.jpg"
                        },
                        {
                            "name": "劳亚大陆",
                            "time": "1.8亿年前",
                            "children": [
                                {
                                    "name": "北美洲",
                                    "time": "1.8亿年前",
                                    "src": "./static-2/北美洲.jpg"
                                },
                                {
                                    "name": "欧亚大陆",
                                    "time": "1.8亿年前",
                                    "src": "./static-2/欧亚大陆.jpg"
                                }
                            ],
                            "src": "./static-2/劳亚大陆.jpg"
                        }
                    ],
                    "src": "./static-2/盘古大陆分裂.jpg"
                },
                {
                    "name": "软骨鱼纲的第二次主要演化事件",
                    "time": "1.8-1.44亿年前",
                    "src": "./static-2/软骨鱼纲的第二次主要演化事件.jpg"
                },
                {
                    "name": "滑齿龙",
                    "time": "1.7亿年前",
                    "description": "滑齿龙是一种海洋爬行动物，在侏罗纪晚期，它们粗壮的身影在四片中等大小桨鳍的驱动下四处游荡。滑齿龙的长颚里满部尖锐的牙齿。滑齿龙的鼻腔结构使得它在水中也能嗅到气味，这样滑齿龙就可以在很远的地方发现猎物行踪。除了要上浮呼吸外，滑齿龙一生都在水中度过，因此它们也是卵胎生动物，喜欢在浅海域产仔。滑齿龙意思是“平滑侧边牙齿”，是种肉食性海生爬行动物，属于蛇颈龙目里短颈部的上龙亚目。滑齿龙生存于中侏罗纪的卡洛夫阶，约1亿7000万年前到1亿5500万年前。滑齿龙是生活在侏罗纪中晚期的动物，一些保存相当完好的滑齿龙骨骼化石，清楚显示牙齿的排列及其头部的形状。但这些头骨并不一定就属于片中威胁牛津夏（oxford shire）附近水域。",
                    "src": "./static-2/滑齿龙.jpg"
                },
                {
                    "name": "大眼鱼龙",
                    "time": "1.65亿年前",
                    "description": "大眼鱼龙（Ophthalmosaurus）是侏罗纪晚期中等体型的一种肉食性鱼龙。眼窝直径有10厘米，相对于3.5米的体长来说，这眼睛实在是很可观了。流线型的身体帮助它以2.5千米的时速在侏罗纪的海洋中游弋。 生活在广大的海洋，为胎生动物，并只有在生产时才会靠近岸边。它们的游泳速度可能相当快，并以没有牙齿的长嘴追捕乌贼和鱼类。",
                    "src": "./static-2/大眼鱼龙.jpg"
                },
                {
                    "name": "最早能游泳的哺乳动物近亲獭形狸尾兽出现",
                    "time": "1.64亿年前",
                    "src": "./static-2/最早能游泳的哺乳动物近亲獭形狸尾兽出现.jpg"
                },
                {
                    "name": "达尔文翼龙",
                    "time": "1.61亿年前",
                    "description": "达尔文翼龙Darwinopterus是既具有进步类型（翼手龙类）的头骨和颈椎特征，又有原始类群（喙嘴龙类）的特征，适逢达尔文翼龙的发表年为英国博物学家、进化论奠基者达尔文(1809-1882)诞辰200周年和他的《物种起源》发表150周年，达尔文翼龙的研究者中国地质科学院地质研究所的吕君昌博士特命名为模块达尔文翼龙以纪念这两大重要事件。达尔文翼龙是处于长尾的原始喙嘴龙类和进步的、短尾的翼手龙类之间的过渡类型。它的头部和颈椎构造（头骨上鼻孔和眶前孔愈合一起形成大的鼻眶前孔，颈椎具有不发育的颈肋等）体现进步类群-翼手龙类的特征，而身体的其它部分与喙嘴龙的一样：比如长的尾部和第5脚趾具有两个长的趾节等。达尔文翼龙发现于大约1.6亿年的中侏罗世地层中，尖锐而长的牙齿显示它是肉食性动物,而其骨骼结构又显示它几乎肯定地在空中掠食（它在陆地上动作很缓慢，笨拙，表现在长的尾部和脚上第5趾有两节长的趾节等）, 但是其牙齿不像其它翼龙那样吃鱼或者昆虫。它们同时代的会飞行动物，包括不同种类的翼龙，小的、滑翔的哺乳动物-翔兽以及鸽子大小食肉恐龙，它们与达尔文发现于同一层位，因而很可能成为达尔文翼龙的食物。达尔文翼龙可能用它的长有具有尖锐牙齿的上下颌，不是在空中，就是当它快速掠过树枝或树叶时抓住它的食物，非常类似于现在的蝙蝠从树和灌木丛间掠食昆虫。",
                    "src": "./static-2/达尔文翼龙.jpg"
                },
                {
                    "name": "冠龙-五彩冠龙在中国西北的新疆出现",
                    "time": "1.6亿年前",
                    "description": "暴龙科祖先",
                    "src": "./static-2/五彩冠龙在中国西北的新疆出现.jpg"
                },
                {
                    "name": "中华侏罗兽",
                    "time": "1.6亿年前",
                    "description": "最早的真兽类哺乳动物, 伟大的母亲 - 中华侏罗兽化石产自辽宁省建昌县玲珑塔地区距今1.6亿年的侏罗纪髫髻山组，由中国地质科学院地质研究所季强发现，正型标本收藏于北京自然博物馆。其名称含有“来自中国的侏罗纪母亲”之意，代表已知最古老的真兽类哺乳动物化石记录。中华侏罗兽的发现为哺乳动物演化历史建立了一个新的里程碑，将以前的白垩纪记录提前了3500万年。研究表明：中华侏罗兽体重约13克，具有攀爬能力，是一种树上生活的食虫哺乳动物。",
                    "src": "./static-2/中华侏罗兽.jpg"
                },
                {
                    "name": "恐龙多样性达到高峰",
                    "time": "1.5亿年前",
                    "children": [
                        {
                            "name": "异特龙",
                            "time": "1.55亿年前",
                            "src": "./static-2/异特龙.jpg"
                        },
                        {
                            "name": "腕龙",
                            "time": "1.5亿年前",
                            "src": "./static-2/腕龙.jpg"
                        },
                        {
                            "name": "迷惑龙",
                            "time": "1.5亿年前",
                            "src": "./static-2/迷惑龙.jpg"
                        },
                        {
                            "name": "剑龙",
                            "time": "1.5亿年前",
                            "src": "./static-2/剑龙.jpg"
                        },
                        {
                            "name": "嗜鸟龙",
                            "time": "1.5亿年前",
                            "src": "./static-2/嗜鸟龙.jpg"
                        },
                        {
                            "name": "奥斯尼尔龙",
                            "time": "1.5亿年前",
                            "src": "./static-2/奥斯尼尔龙.jpg"
                        },
                        {
                            "name": "梁龙",
                            "time": "1.5亿年前",
                            "description": "梁龙是蜥臀目梁龙科梁龙属恐龙。 [6]脖子很长，脑袋很小，鼻孔的位置比眼睛高； [7]嘴的前部长有扁平的牙齿，侧面和后部均无齿；四肢粗壮，前肢短，后肢长；臀部高于前肩；掌部都有5个指（趾）； [8]尾巴比脖子长，逐渐向末端变细，呈鞭子状， [9]中部有10多个人字骨。因人字骨顶端伸出两个突起似双梁而得名双梁龙，通常称梁龙。 [10]梁龙生活于侏罗纪末期的北美洲西部。 [7]群居生活，当本地食物不足时，集体迁徒到远方。 [11]植食性，以树叶和蕨类植物为食。 [9]一只雌性梁龙会在森林边缘产下上百枚梁龙蛋，产卵后离开森林边缘到开阔的平原地带生活，任恐龙蛋自行孵化。 [12]梁龙是目前发现的地球上曾出现过的最长的动物。其化石被大量发现，是人们最熟悉的恐龙之一。 [13]1877年，美国教育家塞缪尔·W·威利斯顿在科罗拉多州峡谷镇附近发现了第一块梁龙化石。化石所处地层的年代为距今1亿4700万年到1亿5600万年的晚侏罗世。",
                            "src": "./static-2/梁龙.jpg"
                        }
                    ],
                    "src": "./static-2/恐龙多样性达到高峰.jpg"
                },
                {
                    "name": "鸟类从兽脚亚目演化出来",
                    "time": "1.5亿年前",
                    "children": [
                        {
                            "name": "始祖鸟",
                            "time": "1.5亿年前",
                            "src": "./static-2/始祖鸟.jpg"
                        }
                    ],
                    "src": "./static-2/鸟类从兽脚亚目演化出来.jpg"
                },
                {
                    "name": "白垩纪",
                    "time": "1.45-0.66亿年前",
                    "description": "恐龙巅峰 - 白垩纪（英语：Cretaceous Period）是地质年代中中生代的最后一个纪，开始于1.45亿年前，结束于6600万年前，历经7900万年，是显生宙的最长一个阶段 [1] [12]。白垩纪是在1822年由比利时地质学家Jean d'Omalius d'Halloy研究巴黎盆地时所提出。白垩纪因欧洲西部该年代的地层主要为白垩沉积而得名。白垩纪位于侏罗纪和古近纪之间，BC1亿4500万年（误差值为400万年）前至6500万年前（误差值为30万年）。白垩纪–第三纪灭绝事件是地质年代中最严重的大规模灭绝事件之一，包含恐龙在内的大部分物种灭亡。发生在白垩纪末的灭绝事件，则成为中生代与新生代的分界。白垩纪时期，大陆被海洋分开，地球变得温暖、干旱。白垩纪，是最大的恐龙出现时期，许多新的恐龙种类开始出现，恐龙仍然统治着陆地，翼龙在天空中滑翔，巨大的海生爬行动物统治着浅海。最早的蛇类、蛾、蜜蜂以及许多新的小型哺乳动物也出现了。被子植物也出现于此时期。",
                    "src": "./static-2/白垩纪.jpg"
                },
                {
                    "name": "中华龙鸟",
                    "time": "1.40亿年前",
                    "description": "第一只鸟起飞的地方 - 中华龙鸟是一种发现于中国的美颌龙类。和大多数美颌龙类一样，中华龙鸟的体型十分娇小。依据正型标本估计，它的体长约为1米左右。中华龙鸟在发现之初由于身披丝状羽毛，一度被认为与鸟类有着非常近的亲缘关系，被认为是解决鸟类起源的关键物种。不过以现在的相关研究来看，中华龙鸟所属的美颌龙类是手盗龙形类中最为原始的一支，与鸟类的亲缘关系较远。即便如此，中华龙鸟的发现也是具有里程碑式的意义的，它是第一件被报道的长羽毛的恐龙化石，它使古生物学家逐渐意识到非鸟类兽脚类恐龙也可以拥有鸟类的特征。",
                    "src": "./static-2/中华龙鸟.jpg"
                },
                {
                    "name": "被子植物演化出花朵",
                    "time": "1.30亿年前",
                    "src": "./static-2/被子植物演化出花朵.jpg"
                },
                {
                    "name": "辽宁古果",
                    "time": "1.25亿年前",
                    "description": "第一朵花盛开的地方 - 辽宁古果Archaefructus liaoningensis Sun et al.属于古果科Archaefructaceae（该科包括辽宁古果和中华古果两种化石植物）。它们的生存年代为距今 1亿2500万年的中生代，比以往发现的被子植物早1500万年，被国际古生物学界认为是迄今最早的被子植物，就此为全世界的有花植物起源于辽宁西部提供了有力的证据。从辽宁古果化石表面上看，化石保存完好，形态特征清晰可见。",
                    "src": "./static-2/辽宁古果.jpg"
                },
                {
                    "name": "现今有胎盘哺乳动物的祖先攀援始祖兽出现",
                    "time": "1.25亿年前",
                    "src": "./static-2/现今有胎盘哺乳动物的祖先攀援始祖兽出现.jpg"
                },
                {
                    "name": "鲨齿龙",
                    "time": "1.25亿年前",
                    "description": "鲨齿龙属下目前包含两个物种，分别为撒哈拉鲨齿龙和伊吉迪鲨齿龙。鲨齿龙生活于晚白垩世塞诺曼期的北非。鲨齿龙与同属于异特龙类的魁纣龙，马普龙，南方巨兽龙有着非常近的亲缘关系。鲨齿龙的体型非常巨大，与霸王龙相似，甚至可能更大。鲨齿龙生活在一个巨兽横行的时代，同时代的巨兽还包括15米长的棘龙，9米的皱褶龙，以及身长30米以上的蜥脚类潮汐龙，水中也潜伏着12米的帝鳄。鲨齿龙很可能以同时代的巨型蜥脚类为食。",
                    "src": "./static-2/鲨齿龙.jpg"
                },
                {
                    "name": "小盗龙",
                    "time": "1.25亿年前",
                    "description": "小盗龙是一种发现于中国辽宁的小型兽脚类恐龙，属于廓羽盗龙类中的驰龙类，与鸟类有着非常近的亲缘关系。目前，该属下有三种，包括模式种赵氏小盗龙，归入种顾氏小盗龙和汉卿小盗龙。其中，赵氏小盗龙可能是目前最小的兽脚类恐龙之一。小盗龙的化石收藏量也非常巨大，除了正式发表的标本以外还包括约300件未发表的标本。小盗龙全身都披有羽毛，四肢上还具有不对称的正羽。小盗龙的发现证实了非鸟类恐龙与鸟类具有非常近的亲缘关系，且在这一演化过程中可能经过一段四翼飞行的状态。",
                    "src": "./static-2/小盗龙.jpg"
                },
                {
                    "name": "千禧中国鸟龙出现",
                    "time": "1.23亿年前",
                    "src": "./static-2/千禧中国鸟龙出现.jpg"
                },
                {
                    "name": "森林翼龙在中国辽宁出现",
                    "time": "1.20亿年前",
                    "src": "./static-2/森林翼龙在中国辽宁出现.jpg"
                },
                {
                    "name": "帝龙",
                    "time": "1.20亿年前",
                    "description": "早期暴龙",
                    "src": "./static-2/帝龙.jpg"
                },
                {
                    "name": "阿普第阶灭绝事件",
                    "time": "1.17-1.16亿年前",
                    "src": "./static-2/阿普第阶灭绝事件.jpg"
                },
                {
                    "name": "棘龙",
                    "time": "1.14亿年前",
                    "description": "棘龙是一种大型兽脚类恐龙，拥有着比肩霸王龙和南方巨兽龙的体长。棘龙属下目前仅有一有效种，即埃及棘龙，由德国古生物学家斯特罗默于1915年命名 [1]。由于长相奇特，加上体型巨大，棘龙受到的关注不少于霸王龙。可惜的是，棘龙的正型标本在二战时期被炸毁。长期以来，古生物学家对于棘龙的认知都只停留在正型标本的照片和少数的化石碎片上。随着近几年化石证据的逐渐增多，棘龙真实的形象才浮出水面。近几年的新化石标本以及定量研究显示，棘龙的身体结构高度特化，是一种水性很好的恐龙。这些研究不仅使科学家弄清了棘龙的身世，同时使人们认识到，在中生代时期，恐龙不止是陆地上的霸主，在水中也有它们的一席之地。",
                    "src": "./static-2/棘龙.jpg"
                },
                {
                    "name": "波塞冬龙",
                    "time": "1.1亿年前",
                    "description": "波塞东龙生存于墨西哥湾的海岸，墨西哥湾的海岸在当时侵入到奥克拉荷马州一带，形成巨大的三角洲，类似今日的密西西比河三角洲。这个地区在当时可能没有掠食动物可以攻击完全成长的波塞东龙个体，但肉食龙下目的高棘龙（体型较小于暴龙）与以群体行动的恐爪龙可能以幼年波塞东龙个体为猎物。在2004年，德恩·奈许（Darren Naish）与他的同事叙述了一只巨大腕龙科恐龙，该恐龙发现于早白垩纪的英格兰，并类似于波塞东龙。该腕龙科恐龙仅发现两个颈椎，在某些细节明显地类似波塞东龙，而它们可能在体型上相似。该腕龙科恐龙的发现突显了早白垩纪时期北美洲与欧洲恐龙的相似。",
                    "src": "./static-2/波塞冬龙.jpg"
                },
                {
                    "name": "帝鳄出现",
                    "time": "1.1亿年前",
                    "src": "./static-2/帝鳄出现.jpg"
                },
                {
                    "name": "鲨齿龙及南方巨兽龙出现",
                    "time": "1.00亿年前",
                    "src": "./static-2/鲨齿龙及南方巨兽龙出现.jpg"
                },
                {
                    "name": "阿根廷龙",
                    "time": "1.00亿年前",
                    "description": "阿根廷龙属于蜥脚类恐龙的泰坦龙类， 命名十分简单， 意思是在阿根廷发现的恐龙。生存年代： 1亿年前白垩纪中期阿尔布阶-9300万年前白垩纪晚期森诺曼阶。是发现的最大的陆地恐龙之一。",
                    "src": "./static-2/阿根廷龙.jpg"
                },
                {
                    "name": "南方巨兽龙",
                    "time": "9800万年前",
                    "description": "南方巨兽龙属下仅有一种，为卡氏南方巨兽龙，是一种发现于阿根廷的大型兽脚类恐龙，生存年代为晚白垩世塞诺曼期，约距今9700万年前。南方巨兽龙属于异特龙超科中的鲨齿龙类，并且很有可能是地球历史中体型最大的陆地掠食动物。与霸王龙相比，南方巨兽的样本量很小，且大个体标本的完整度很差，因此对其体型的准确估计有相当的难度。它与霸王龙相比谁的体型更大也是学术界一直在争论的话题。",
                    "src": "./static-2/南方巨兽龙.jpg"
                },
                {
                    "name": "马普龙",
                    "time": "9700万年前",
                    "description": "马普龙无疑是非常巨大的，其体型与它的近亲南方巨兽龙相仿。在对正型标本描述的过程中，研究人员发现马普龙较大的骨骼标本接近南方巨兽龙对应部位的标本大小，于是粗略的估计了马普龙的体长大约在12米左右 [1]。古生物学家托马斯.霍兹在他的研究中估计马普龙的体型大约在12.6米 [2]。而另外一项研究则认为马普龙的体型略小于南方巨兽龙，体长约11.5米，重5吨. 发现马普龙化石的乌因库尔组整体环境偏干燥，但是会有季节性的溪流出现。与马普龙生存在同一地区的恐龙还包括属于泰坦巨龙类的阿根廷龙和乔冈龙，驰龙类的鹫龙，以及属于阿贝力龙类的蝎猎龙和肌肉龙 [4]。马普龙的多件标本在一个骨床里被发现，里面至少包括了7件处于不同个体发育阶段的标本 [5]。这种不同年龄段的个体在同一地区被一同发现的情况也见于其它大型兽脚类恐龙，这其中包括马普龙的远亲异特龙，以及更晚出现的大型暴龙类惧龙和艾伯塔龙。古生物学家认为多个处于不同年龄段的个体在同一地区被发现显示马普龙可能存在群体狩猎的行为。群体狩猎可以增加狩猎的成功率，尤其是在对付诸如阿根廷龙这样的大型猎物的时候。成年阿根廷龙体长约40米，犹如一座移动的肉山，即使是成年的马普龙单独狩猎这种巨型猎物也是十分危险的。",
                    "src": "./static-2/马普龙.jpg"
                },
                {
                    "name": "崖蜥下海",
                    "time": "9500万年前",
                    "description": "中生代最后一支大型海爬掠食者",
                    "src": "./static-2/崖蜥下海.jpg"
                },
                {
                    "name": "森诺曼期 - 土仑期灭绝事件",
                    "time": "9400万年前",
                    "description": "又称森-土灭绝事件, OAE2等 - 森诺曼期土伦期灭绝事件，就是通常所称的土伦阶灭绝事件。该灭绝事件发生在9300~9400万年前，由于发生了意外事件，导致整个海洋处于缺氧状态，以致于海洋当中的所有生物都灭绝了。生物学家们经过广泛的调查，仍然没有调查清楚导致灭绝的原因。但科学家们发现了处于那个时代的岩层标本，标本中发现了许多本不属于那里的沉积物。",
                    "src": "./static-2/森诺曼期 - 土仑期灭绝事件.jpg"
                },
                {
                    "name": "鱼龙灭绝",
                    "time": "9400万年前",
                    "description": "鱼龙的灭绝受到不稳定气候和演化速度减缓的驱使。此前曾有研究提出，是其他海洋爬行动物的增加或食物资源的减少导致鱼龙提早灭绝。但近来的研究显示，鱼龙在灭绝前几百万年依然有丰富的物种多样性，而致使其消失的原因却不清楚。英国牛津大学Valentin Fischer团队采用基于系统发生学的方法，估计了鱼龙随时间推移多样性的变化，并对诸如海洋化学和海平面高度等环境数据进行了比对。研究人员发现，鱼龙在白垩纪早期的种类一直高度多样化，但其演化速率逐渐减缓。研究数据支持气候变化是海洋生态系统变化主要驱动力的观点，不支持鱼龙是被其他海洋爬行动物和鱼类打败的假说",
                    "src": "./static-2/鱼龙灭绝.jpg"
                },
                {
                    "name": "剑射鱼",
                    "time": "9000万年前",
                    "description": "剑射鱼是乞丐鱼目乞丐鱼科剑射鱼属鱼类。体长4.3-5.1米，呈流线形；尾鳍强劲有力；齿呈利刃状； [4]颌部向上翘起。背部深蓝黑色，腹部银亮色。因为它的胸鳍有像剑一样的鳍条而得名。 [5]剑射鱼分布于北美洲、大洋洲、欧洲。 [4]栖息于大洋中。游泳速度可以达到或超过当时海洋里的任何生物，能够凭借高速游泳的巨大动能跃出水面。 [6]主要以大型鱼类为食，也捕食海鸟。 [4]剑射鱼生活于约8700万-6500万年前的白垩纪， [4]是一种非常凶猛的海洋动物， [7]高效率的掠食者。它很可能会用分叉的尾巴猛地一下把猎物击晕，还可能会跃出水面来驱除身上的寄生物。 [5]然而它并不是无敌的，一旦受伤，它那巨大的尺寸就意味着很容易被发现，并成为鲨鱼的牺牲品。",
                    "src": "./static-2/剑射鱼.jpg"
                },
                {
                    "name": "恐蛇",
                    "time": "8980万年前",
                    "description": "恐蛇属（学名：Dinilysia）是一属已经灭绝的泛蛇类，生存于白垩纪晚期（科尼亚克阶），分布于南美洲，其化石于阿根廷被发现。特征:与真足蛇相对，恐蛇身体已经完全没有足部，而且颚骨宽松，能吞下大型的食物。其形态与现代蛇类已颇为接近。 恐蛇（Dinilysia）是脊索动物门、蜥形纲、恐蛇科、恐蛇属的动物，已灭绝，生存于白垩纪晚期（科尼亚克阶），分布于南美洲，其化石于阿根廷被发现。恐蛇具有矮扁的脑壳、骨板、颚结构和方骨及活动性很强的颞颥部。其颚肌肉提供很大的附着部，典型体长为3米。",
                    "src": "./static-2/恐蛇.jpg"
                },
                {
                    "name": "印度及马达加斯加大陆分裂",
                    "time": "8800万年前",
                    "src": "./static-2/印度及马达加斯加大陆分裂.jpg"
                },
                {
                    "name": "无齿翼龙",
                    "time": "8800万年前",
                    "description": "无齿翼龙是种会飞的爬行动物，它们不是恐龙。它们几乎没有尾巴，躯干很小。无齿翼龙也许会有皮毛，但是不会有羽毛。它们有个大脑袋，它们的视力非常好。无齿翼龙没有牙齿。无齿翼龙能够扇动它们的翅膀飞翔，而且还能飞很长的距离。无齿翼龙是是白垩纪晚期的翼龙类，一种飞行的爬行动物，而恐龙则是陆上的动物。无齿翼龙大约如火鸡一样，体重大约15千克，但是它的身长大约有1.8米，两翼开展约8.2米。它或许较常滑翔而非飞行，而且有可能滑降水面觅食鱼类。某些证据显示无齿翼龙体覆轻毛，有可能为温血动物。有些小型的无齿翼龙比麻雀还要小；而最大型的两翼开展可达12米。它们或许须要利用热气流上升以顺势抬举离地飞翔。无齿翼龙因为头上的冠饰而著名。冠饰可能用于求偶时的炫耀，或作为方向舵用，或者两者都有。也有科学家认为头冠可以在飞行时保持身体的稳定。有论点认为雄性的冠饰较大，但只靠化石是很难分辨出冠饰形状代表什么性别或是哪些物种。翼手龙类的一种。翼展7~9米，头部巨大，喙很长，喉颈部有皮囊，嘴里完全无牙齿，可能像现在的鹈鹕一样用大嘴吞食鱼类。也许是为了取得头部的平衡，头顶上有一个大大的向后伸出的骨冠。这种翼龙不能长时间的振翅飞行，要借助高空气流滑行飞越海洋。休息时，可能像蝙蝠那样用后肢倒挂在树枝上，也能收拢翅肢用四肢在地面作短距离爬行。生活习性:无齿翼龙已知以鱼类为食；曾在一个无齿翼龙化石的胃部位置发现鱼骨头化石，而在另一个无齿翼龙化石的嘴部，发现了已化石化的鱼类食糜。无齿翼龙的翼形状显示它们可能以类似现代信天翁的方式飞行，借由上升热气流来滑翔。这个论点是根据无齿翼龙有高长宽比（9:1），类似信天翁的比例（8:1）。信天翁将大部分活动时间利用在海洋上捕食鱼类，凭借气流和涡流的动力在空中动力滑翔，而不需要拍打翅膀，而不必借助海面上缺乏的上升气流。然而，其他科学家认为无齿翼龙可以拍打它们的翼，用它们的力量飞行。它们使用大而轻的翼，进行长距离飞行。无齿翼龙等翼龙类可能可采动力滑翔飞行，也可利用上升气流来拍打飞行。近年的翼龙类风洞测试，将翅骨（Pteroid bone）保持在朝向前外下侧的姿势，以支撑者大型的前膜，测试证明前翼能产生相当高的升力，即使在高攻角的姿势也一样。与现代鸟类相比，翼龙类的胸骨脊较小，胸骨脊是胸肌的附着处。但翼龙类独有的翅骨，使翼龙类可采动力飞行。无齿翼龙在地面移动时，是采四足方式还是二足方式，曾经是过去争论的主题之一。因为发现了数个翼龙类的足迹，大多数翼龙类研究人员认为无齿翼龙是采四足方式；某些近年的研究则认为无齿翼龙是采二足方式。在Bennett在2001的研究，以及Bramwell与Whitfield的研究里，曾短暂讨论过无齿翼龙游泳的可能性，在密歇根州立大学正进行一项借由形态度量学量化的研究无齿翼龙游泳的可能性。",
                    "src": "./static-2/无齿翼龙.jpg"
                },
                {
                    "name": "玛君龙",
                    "time": "8800万年前",
                    "src": "./static-2/玛君龙.jpg"
                },
                {
                    "name": "蜥脚下目、鸭嘴龙科、角龙科及兽脚亚目很多恐龙种类出现",
                    "time": "8000万年前",
                    "src": "./static-2/蜥脚下目、鸭嘴龙科、角龙科及兽脚亚目很多恐龙种类出现.jpg"
                },
                {
                    "name": "伶盗龙",
                    "time": "7500万年前",
                    "description": "伶盗龙（学名：Velociraptor）是蜥臀目驰龙科伶盗龙属恐龙， 又名伶盗龙、速龙。 全身上下覆盖着羽毛； 身形不大，大小与火鸡类似；头部很长，脑袋占身体比重很大； 嘴狭长扁平； 牙齿锋利，边缘呈锯齿状；前肢较大，且灵活；后肢结实； 后足上有四根脚趾，内侧第二根脚趾上的利爪粗而弯曲， 呈镰刀状；尾长，长度占体长的一半以上，尾骨呈“S”状水平弯曲。迅猛龙生活在白垩纪晚期的亚洲的中国、蒙古。 [1] [7-8]喜群居。 [9]肉食性动物， [1]以猎食小型恐龙、恐龙蛋、恐龙幼仔和小型哺乳动物为主。 [10]迅猛龙因行动敏捷，被称为“快速的强盗”。 [11]1924年，著名古生物学家奥斯本在蒙古国发现了其化石，是第一种在亚洲发现的驰龙类恐龙。 [12]此外，1971年，化石标本“搏斗中的恐龙”被波兰探险队发现，此化石标本因此被蒙古视为国家级宝藏。",
                    "src": "./static-2/伶盗龙.jpg"
                },
                {
                    "name": "伤齿龙",
                    "time": "7500万年前",
                    "description": "大脑比例最大的恐龙 - 特征:伤齿龙是种小型恐龙，身长约2米，高度为1米，重达60公斤。伤齿龙拥有非常修长的四肢，显示它们可以快速奔跑。伤齿龙拥有长手臂，可以像鸟类一样往后折起，而手部拥有可作出相对动作的拇指。它们的第二脚趾上拥有大型、可缩回的镰刀状趾爪，这些趾爪在奔跑时可能会抬起。因为这些特征，科学家们认为伤齿龙属于手盗龙类。伤齿龙拥有大型眼睛，显示可能有夜间行动，可能以夜间行动的哺乳动物为食；而且眼睛的方向稍微往前，使伤齿龙拥有深度知觉。事实上伤齿龙的眼睛比其他大部分恐龙还要朝向前方，显示伤齿龙有比其他恐龙更好的深度知觉。它们轻型头颅骨的脑囊类似某些外表类似鸵鸟的恐龙的脑囊。与身体相比，伤齿龙的脑袋是恐龙中最大之一。因此伤齿龙被认为是最有智能的恐龙之一。曾经在蛋巢中发现过伤齿龙的恐龙蛋。 [3]-----分布:伤齿龙的化石被发现于蒙大拿州的朱迪斯河组与地狱溪组及双麦迪逊组、亚伯达省的马蹄峡谷组、以及阿拉斯加州的北坡（North Slope）地区。还有一些证据显示伤齿龙较常生活在寒冷的地区，它们似乎在北部地区特别繁盛，以及较寒冷的时期，例如早马斯特里赫特阶。 [4]这些化石来自于相隔数千公里远的地点，而且是在各大陆分隔数百万年之后出现，似乎不可能代表伤齿龙属的同一个种。然而，需要进一步的研究与更多化石才能理解伤齿龙到底有几个种。-----巢穴:1978至1984年间，约翰·霍纳(John Horner)和同事鲍勃·马凯拉(Bob Makela)在蒙大拿山区进行挖掘，发现了三处恐龙巢穴遗迹，包括一窝排列整齐的伤齿龙(Troodon)蛋。伤齿龙把卵产在刚干涸的湖底或沼泽地的湿润泥土里，靠输卵管向下蠕动的力量能轻松地把它们深深插入泥土中。而生活在中国的白垩纪伤齿龙则是选择水边的沙土地作为产卵地点，它们先用爪子在地上刨出一个坑，然后蹲坐下来使身子成直立或半直立状态，并把蛋产入蛋坑里松软的沙土中。之后再用沙土小心的把这些蛋埋起来。它们还会孵蛋。 [5]-----智慧:伤齿龙——最有智慧和最强壮的恐龙之一，是能将哺乳动物进化减慢百万年的食肉动物！在脑容量与体型相比较下，具有恐龙中最大的脑袋。这可能指示他们是白垩纪最晚期是最聪明的一群。有些科学家甚至认为它可能和鸵鸟智商相近，那将比现生的任何爬行动物都要聪明。袋鼠的IQ大约在0.7。而伤齿龙的IQ高达5.3！好家伙，真是高智力啊。伤齿龙可能和今天鸟类的智力相似。今天的鸟类极为聪明：最聪明的鸟能训练开一些玩笑甚至模仿人类的语言。加拿大古动物学家戴尔罗素就设想，如果6500万年前没有那场大灾难，迅猛龙的近亲奔龙，就完全可能进化成为代替人类的一种动物——“恐龙人”，成为地球的主宰。这就是曾经风行一时的“恐人学说”。 [6]-----关系:伤齿龙科恐龙在寻找鸟类起源上有重要的位置，因为他们于早期鸟类拥有许多共同生理特征。最近在晚侏罗纪的莫里逊组发现的WDCDML001完整标本，属于伤齿龙科，时间也接近始祖鸟的年代。这个重要的侏罗纪伤齿龙科化石，证实了较衍化的恐爪恐龙的出现时间非常接近鸟类的出现时间，而更基础的近鸟类应该在更早的时期演化出来。这项发现使得恐龙与鸟类演化上的时间矛盾无效，但少数人仍抱持者这个演化上的时间矛盾。",
                    "src": "./static-2/伤齿龙.jpg"
                },
                {
                    "name": "霍夫曼苍龙",
                    "time": "7500万年前",
                    "description": "沧龙属(Mosasaurus)主模式种是霍夫曼沧龙(Mosasaurus hoffmanni) , 于1780年被发现于荷兰 ，霍夫曼沧龙(Mosasaurus hoffmanni)根据俄罗斯出土的一块下颌CCMGE 10/2469可以得出最大体长可达15.2米 ,最大体重13.3吨。另有两块巨大的方骨（NHMM 003892和YPM 773）和一块巨大的肱骨的主人的大小超过CCMGE 10/2469，但小于那块巨大的方骨。NHMM009002、IRScNB R24和昵称“甜心”的霍夫曼沧龙也是10吨级别的巨大个体。它的牙齿长有切边，根据Lingham-Soliar (1995)的见解 , 沧龙属(Mosasaurus)有较大的眶部但是双眼视觉却相对较低 , 它们的嗅觉器官也不发达 , 他认为像霍夫曼沧龙(Mosasaurus hoffmanni)是生活于水表面掠食者 , 生活的环境还是沿岸水域。",
                    "src": "./static-2/霍夫曼苍龙.jpg"
                },
                {
                    "name": "人类及老鼠的最后共同祖先出现",
                    "time": "7500万年前",
                    "src": "./static-2/人类及老鼠的最后共同祖先出现.jpg"
                },
                {
                    "name": "甲龙",
                    "time": "6800万年前",
                    "description": "甲龙，是脊索动物门 [2]爬行纲 [3]鸟臀目 [4]甲龙科 [5]装甲恐龙。体长为5-6.5米，体重约4吨；腿短、脖短、头颅宽阔；身体由几百片骨板覆盖，骨板表面光滑，呈横向排列；眼睛上方也具骨板，只有腹部无保护结构；体型较宽，尾巴较短且粗，尾巴末端有尾锤。 [6]甲龙是最早被发现的恐龙之一，最初被描述和命名为“森林蜥蜴”。 [7]因其身体笨重，只能用四肢在地上缓慢爬行，形似坦克车，又称“坦克龙”。 [5]甲龙曾分布于北美洲， [8]在美国、墨西哥、玻利维亚等国也有化石分布。 [4]甲龙栖息于树林， [9]在其生活的地区，气候温暖湿润，植物种类多样。 [10]在遇到危险时，甲龙会收拢四肢蜷在地上，或用尾锤攻击对方。 [11]甲龙是草食性恐龙， [5]以嫩枝叶或多汁的根茎为食。 [9]甲龙生活在距今约6800万-6550万年前的白垩纪晚期。 [12]1906年在北美蒙大拿州的地狱溪地层发现甲龙的化石，由美国古生物学家巴纳姆·布朗于1908年命名；化石包括头颅骨的顶部、脊骨、肋骨、部分肩胛骨及装甲， [13]虽然甲龙的骨骼没有完整地被发现，但它常被认为是甲龙的原型。 [8]甲龙家族有两个群体，一个是甲龙科，最早出现在距今大约1.7亿年前的侏罗纪中期；另一个是结节龙科，是最早出现在侏罗纪的甲龙群体。",
                    "src": "./static-2/甲龙.jpg"
                },
                {
                    "name": "风神翼龙",
                    "time": "6800万年前",
                    "description": "风神翼龙翼展可达11米长，重达500斤。它是人类已知最大的飞行动物。风神翼龙新陈代谢很快，需要定期进食。风神翼龙身躯为流线型，需要大量蛋白质作为能量。一只不到三百斤重的小霸王龙，便可被它当成一顿美食。风神翼龙拥有巨大的双翼，这使它非常适合长途滑翔。风神翼龙未成年的个体头骨长1米，翼展达5.5米；成年个体的头骨未曾发现，根据翅骨碎片来看，翼展至少有10~11米，这可是地球生命史来最大型飞翔的动物！风神翼龙的嘴巴又长又细，口中没有牙齿；喙前端不是尖锐的，而是钝的；它的眶前孔(位于眼眶前方的)巨大，差不多占了头骨全长的二分之一，这无疑对其大头减轻了相当多的重量；风神翼龙头上有脊冠，位于眼眶前上方，这区别于该属其他翼龙如至浙江翼龙,它们头上没有脊冠；风神翼龙的脖子非常长，达2米多，由肩与头之间有长型的肌腱和肌肉支撑；它的腿很长，有平衡大头的作用。远观之，风神翼龙呈现了类似鹤或鹳的外表。",
                    "src": "./static-2/风神翼龙.jpg"
                },
                {
                    "name": "角龙",
                    "time": "6800万年前",
                    "description": "角龙是白垩世晚期出现的鸟臀类恐龙。 [1]角龙的脖子两侧和后边长着一块厚厚的骨板，称做”颈盾”，颈盾上还有2只或3只形状不同的角。这些角是防敌害的有力武器。角龙的嘴形奇特，似鹦鹉嘴，有利于挖掘植物的根茎。角龙的种类很多，根据角和颈盾的形态，有原角龙、秀角龙、独角龙、三角龙、戟龙等。最原始的角龙起源于亚洲，以后迁徙到北美大陆。角龙在距今1亿年前~7千万年前都非常繁盛，它们也是恐龙中最后走向灭绝的一类-6550万年前的白垩纪晚期。",
                    "src": "./static-2/角龙.jpg"
                },
                {
                    "name": "霸王龙",
                    "time": "6700万年前",
                    "description": "地狱溪之王 - 霸王龙属于暴龙超科的暴龙属，为该属下的唯一种，于1905年由美国古生物学家，美国艺术与科学院院士亨利·奥斯本描述命名。如果参考其它恐龙种名的翻译格式，它的种名翻译为“君王暴龙”会更合适。成年霸王龙体长约12米，体重7吨左右，是地球上有史以来最大的陆地捕食者之一。霸王龙是久负盛名的恐龙，拥有海量的标本收藏，其中几十件标本都达到了非常高的完整度，使得古生物学家对于霸王龙的研究不仅仅局限于经典的形态描述，还可以对它的个体发育，生物力学，种群生物学等做出更详细的分析。如对于霸王龙头骨生物力学的研究表明它具有粉碎骨骼的咬合力，对它的脑颅三维重建表明霸王龙具有极佳的视觉和嗅觉，而对霸王龙个体发育序列的研究表明，霸王龙具有非常快的生长速度。很多在其它恐龙物种或是其它古生物身上无法落实的研究手段都可以用霸王龙尝试。在科学研究方面，霸王龙在国际顶级学术期刊《Science》上拥有属于自己的综述论文 [1]，并且与它相关的各种研究也会频繁登上《Nature》和《Science》这样的顶级学术期刊。虽然目前霸王龙的体型受到了大型异特龙类以及棘龙的挑战，但是综合研究深度以及文化影响力来看，它依然是名副其实的恐龙之王。",
                    "src": "./static-2/霸王龙.jpg"
                },
                {
                    "name": "白垩纪末大灭绝",
                    "time": "6600万年前",
                    "description": "第五次物种大灭绝, 又叫K-T灭绝事件, 白垩纪-古近纪灭绝事件, 约有75%的物种灭绝, 在这场末日中, 飞鸟恐龙, 翼龙, 苍龙, 蛇颈龙, 菊石亚纲全灭",
                    "children": [
                        {
                            "name": "希克苏鲁伯陨石坑",
                            "time": "6600万年前",
                            "src": "./static-2/希克苏鲁伯陨石坑.jpg"
                        },
                        {
                            "name": "非鸟恐龙灭绝",
                            "time": "6600万年前",
                            "src": "./static-2/非鸟恐龙灭绝.jpg"
                        },
                        {
                            "name": "哺乳动物多样性增长",
                            "time": "6600万年前",
                            "src": "./static-2/哺乳动物多样性增长.jpg"
                        }
                    ],
                    "src": "./static-2/白垩纪末大灭绝.jpg"
                }
            ],
            "src": "./static-2/中生代.jpg"
        },
        {
            "name": "新生代",
            "time": "6600万年前-今天",
            "children": [
                {
                    "name": "古新世",
                    "time": "6600-5600万年前",
                    "description": "复苏 - 古新世（距今6500万年～距今5300万年）Paleocene Epoch第三纪5个世中的第一个世，约开始于6500万年前，结束于5300万年前。古新世形成的地层称古新统，位于中生界之上、始新统之下。1874年，W.P.夏姆珀根据巴黎盆地发现的植物化石，认为含这些化石的层位早于始新世，提出古新世。这一时期持续了约1200万年，最大特点是动物群中古老种类或土著类型占很大优势，与其后的动物群有着明显的区别。",
                    "src": "./static-2/古新世.jpg"
                },
                {
                    "name": "今鸟类幸存",
                    "time": "6600万年前",
                    "src": "./static-2/今鸟类幸存.jpg"
                },
                {
                    "name": "冠恐鸟",
                    "time": "6200万年前",
                    "description": "冠恐鸟的平均身长有1.75m。冠恐鸟的喙特别大及呈钩状，腿大而强壮，脚掌大且有爪/它们生存的环境有大量的密赫，气候潮湿至半干旱。生活习性:因为身躯庞大需要大量的食物，所以冠恐鸟会划分各自的领地。聪明的它们会各霸一方，如果它们真是食肉动物，那么为了保护幼鸟当然不欢迎其他同类。根据它们的怖形，要填饱幼鸟的肚子也需要许多食物，因此估计它们每次产很少量的卵，可能是一敝巨卵。在浓密的森市市中，这般庞大的身躯要去追捕猎物肯定是事倍功半，因为它们多半会选择伏击。至于冠恐鸟的颜色，或许可以想一想食火鸡——生活在丛赫中一种庞大的不会飞的鸟类。它们有着令人惊艳的红蓝相间的皮肤，外面衬着光滑的黑色羽毛。食火鸡是吃素的，而且没有天敌。也就是说。它们完全有理由拥有光鲜的外表而不怕引人注目。恐冠鸟则不同，它们很可能靠伏击获取猎物，所以它们的颜色应该更加灰暗些。",
                    "src": "./static-2/冠恐鸟.jpg"
                },
                {
                    "name": "古食肉目出现",
                    "time": "6000万年前",
                    "children": [
                        {
                            "name": "细齿兽类祖先",
                            "time": "6000万年前",
                            "src": "./static-2/细齿兽类祖先.jpg"
                        },
                        {
                            "name": "泰坦巨蟒",
                            "time": "6000万年前",
                            "description": "蛇类体型巅峰",
                            "src": "./static-2/泰坦巨蟒.jpg"
                        }
                    ],
                    "src": "./static-2/古食肉目出现.jpg"
                },
                {
                    "name": "始新世",
                    "time": "5600-3390万年前",
                    "description": "始新世（Eocene、Epoch）Eocene之名，字源来自希腊文εω（eo，黎明）和καινος（caenos，新），指的是现代哺乳动物群开始出现。始新世常被划分成早期（距今5780万～5200万年）、中期（距今5200万～4360万年）和晚期（距今4360万～3660万年）。始新世早期最令人受到注意的是，原始的现代哺乳动物开始出现。始新世结束于一个被称作Grande Coupure（the 'Great Break' in continuity）的生物大灭绝事件（extinction event），此一事件可能与一或数颗的大火流星（bolide）撞击西伯利亚及当今的契沙比克湾（Chesapeake Bay）相关。气候:由于地球地质历史现有记录中出现的一次最快、强度最大的全球变暖事件，被称为古新世-始新世极热事件（PETM或IETM）的发生，地球温度迅速升高，始新世就此开始。这次迅速而剧烈的升温（在高纬度地区温度上升了7°C之多）持续的时间少于10万年，但是导致了大量物种急剧灭绝，从而形成了古新世和始新世生态系统的分野。始新世的全球气候可能是新生代中变化幅度最小的；从赤道到极地的气温变化幅度只有今天的一半，而深海洋流则异常温暖。极地地区比当今温暖得多，接近于现今西北太平洋的温度；温带森林已经扩展到了极地地区，同时多雨的热带气候区则延伸至北纬45°地区。温带地区的气候与当今相比大有不同，而热带地区的气候则可能接近于当今。不过在哥伦比亚发现的一种可能生活于始新世的巨蛇残骸（约有校车大小）表明，可能相反的，当时的热带比现今温暖的多 [1-2]，这也与计算机模拟出的始新世气候相符 [3]。尽管始新世的全球气候仍然比较温暖，但也正是在始新世后期，开始了全球变冷的缓慢趋势，这可能是由发生于北冰洋的绿萍事件以及在冈瓦纳古陆最终破碎之后形成的南极洲环流共同造成的。这种变冷趋势最终导致了更新世冰期的出现。",
                    "src": "./static-2/始新世.jpg"
                },
                {
                    "name": "古新世-始新世极热事件",
                    "time": "5550万年前",
                    "description": "又称第一次始新世极热事件, PETM, 全球平均温度上升了5度到8度 - 古新世-始新世极热事件发生在距今约5600万年前，由于巨量的碳排放，地球上发生了一次变暖事件，全球平均温度快速升高了约5℃。这次事件标志着地球气候系统从暖室状态向热室状态的根本性转变，导致大气圈、水圈和生物圈发生了重大变化，如大洋酸化、海洋脱氧、底栖有孔虫灭绝、陆地上哺乳动物快速演化和普遍侏儒化。",
                    "src": "./static-2/古新世-始新世极热事件.jpg"
                },
                {
                    "name": "被子植物演化",
                    "time": "5500万年前",
                    "children": [
                        {
                            "name": "多肉水果",
                            "time": "5500万年前",
                            "src": "./static-2/多肉水果.jpg"
                        },
                        {
                            "name": "营养丰富的坚果和种子",
                            "time": "5500万年前",
                            "src": "./static-2/营养丰富的坚果和种子.jpg"
                        }
                    ],
                    "src": "./static-2/被子植物演化.jpg"
                },
                {
                    "name": "哺乳动物重回海洋",
                    "time": "5500万年前",
                    "children": [
                        {
                            "name": "鲸鱼及海豚的祖先",
                            "time": "5500万年前",
                            "src": "./static-2/鲸鱼及海豚的祖先.jpg"
                        }
                    ],
                    "src": "./static-2/哺乳动物重回海洋.jpg"
                },
                {
                    "name": "灵长总目分化",
                    "time": "5500万年前",
                    "children": [
                        {
                            "name": "灵长目",
                            "time": "5500万年前",
                            "src": "./static-2/灵长目.jpg"
                        },
                        {
                            "name": "树鼩",
                            "time": "5500万年前",
                            "src": "./static-2/树鼩.jpg"
                        }
                    ],
                    "src": "./static-2/灵长总目分化.jpg"
                },
                {
                    "name": "澳洲与南极洲分裂",
                    "time": "5500万年前",
                    "src": "./static-2/澳洲与南极洲分裂.jpg"
                },
                {
                    "name": "真灵长类出现",
                    "time": "5500-5250万年前",
                    "children": [
                        {
                            "name": "辛普森氏果猴",
                            "time": "5250万年前",
                            "src": "./static-2/辛普森氏果猴.jpg"
                        },
                        {
                            "name": "亚洲德氏猴",
                            "time": "5250万年前",
                            "src": "./static-2/亚洲德氏猴.jpg"
                        }
                    ],
                    "src": "./static-2/最早的真灵长类出现.jpg"
                },
                {
                    "name": "奇蹄类与偶蹄类出现",
                    "time": "5400万年前",
                    "description": "偶蹄目动物蹄子成对，适应于草地和森林环境，生态角色多样；奇蹄目动物蹄子单独，适应于奔跑和硬地移动，生态角色显著。 两者均起源于古近纪，但演化路径不同，偶蹄目多样化，奇蹄目较保守。",
                    "src": "./static-2/奇蹄类与偶蹄类分化.jpg"
                },
                {
                    "name": "翼手目出现",
                    "time": "5250万年前",
                    "children": [
                        {
                            "name": "芬尼氏爪蝠",
                            "time": "5250万年前",
                            "src": "./static-2/芬尼氏爪蝠.jpg"
                        }
                    ],
                    "src": "./static-2/翼手目出现.jpg"
                },
                {
                    "name": "马由始祖马开始演化",
                    "time": "5000万年前",
                    "children": [
                        {
                            "name": "始祖马",
                            "time": "5000万年前",
                            "src": "./static-2/始祖马.jpg"
                        },
                        {
                            "name": "游走鲸",
                            "time": "5000万年前",
                            "description": "鲸类开始下海",
                            "src": "./static-2/游走鲸.jpg"
                        }
                    ],
                    "src": "./static-2/马由始祖马开始演化.jpg"
                },
                {
                    "name": "细齿兽类演化",
                    "time": "5000万年前",
                    "children": [
                        {
                            "name": "小古猫属",
                            "time": "5000万年前",
                            "src": "./static-2/小古猫属.jpg"
                        }
                    ],
                    "src": "./static-2/细齿兽类演化.jpg"
                },
                {
                    "name": "现代银杏出现",
                    "time": "5000万年前",
                    "src": "./static-2/现代银杏出现.jpg"
                },
                {
                    "name": "安氏兽",
                    "time": "4800万年前",
                    "src": "./static-2/安氏兽.jpg"
                },
                {
                    "name": "罗德侯鲸演化",
                    "time": "4650万年前",
                    "src": "./static-2/罗德侯鲸演化.jpg"
                },
                {
                    "name": "始祖象出现",
                    "time": "4300万年前",
                    "src": "./static-2/始祖象出现.jpg"
                },
                {
                    "name": "大角雷兽",
                    "time": "4300万年前",
                    "description": "大角雷兽（学名Embolotherium），又名锤鼻雷兽或雷犀，哺乳纲、真兽亚纲、奇蹄目的一属。是雷兽科下一属已灭绝的哺乳动物，生存於始新世晚期的蒙古。它的特征是那在头颅骨前端上的突出物。这个骨突就像是一个破城锤。大角雷兽的化石包括有12个头颅骨、几个颚骨及其他骨骼部份，都是在内蒙古的古脑木根地区及外蒙古发现。",
                    "src": "./static-2/大角雷兽.jpg"
                },
                {
                    "name": "鬣(liè)齿兽",
                    "time": "4100万年前",
                    "description": "鬣齿兽（Hyaenodon），又名肉齿兽，是鬣齿兽科已灭绝的一类。其下的巨鬣齿兽是大型陆上肉食性哺乳动物的一员。鬣齿兽是高度专化的掠食者，于4100万年前的始新世晚期出现，已知最早的种类为我国山西发现的垣曲鬣齿兽（Hyaenodon yuanchuensis）直至1600万年前的中新世仍然存在。[1]它们窄长的颚部强而有力，很适合咬紧及咬碎东西。它们的头颅骨很巨型，但脑部却很细小。它的长头颅骨上有很窄的吻，比较犬科的吻算是较大。它的颈部较头颅骨短，身体则长及粗壮，有很长的尾巴。前脚及后脚上都有五趾，第一趾比其他的脚趾较短。鬣齿兽属中最大的是巨鬣齿兽（Hyaenodon gigas），肩高达1-1.4米及长3米以上，重250-400公斤（在我国内蒙二连浩特地区发现过更大的未定种化石）。小型的种如北美的鼬鬣齿兽（Hyaenodon mustelinus）肩高只有30厘米。-----生活习性:从鬣齿兽的头颅骨可知它们有敏锐的嗅觉。一些物种可能专门是吃腐肉的，但其他的明显是主动的掠食者。鬣齿兽外观有些像现今的鬣狗，但有更长而有力的颌骨，尖锐的牙齿及良好发长的裂齿，故可见它们有不同的食性。鬣齿兽是否具备群居习性，目前还不能确定，它们更可能多数为独居动物或成对居住，没有固定的群体组织。相比于其他肉齿目动物，鬣齿兽四肢较为修长，更适应在开阔地区活动-----发展历史:在三千万年的发展历程中，鬣齿兽家族兴旺，种类繁多。就在肉齿目于晚古新不断发展的同时，从古新世的一种古食肉类--古猫兽类当中，分化出了一支进步的类型，它们的裂齿由第四上前臼齿和第一下臼齿组成。从此，一种新型的食肉动物--食肉目哺乳动物出现了。这种前移的裂齿构造使撕裂肉食的工作更有效率，再加上其它一系列进步的体制结构，食肉目哺乳动物开始发展起来，当大多数肉齿目在始新世末灭绝以后，它们从渐新世晚期开始完全取代了肉齿目的地位。直到中新世中期，鬣齿兽属宣告灭绝，肉齿目也在中新世末最终灭绝。鬣齿兽属出现在始新世，体型差距较大，小型种类如狐狸般大小，也有大型的麦氏鬣齿兽，巨鬣齿兽，游荡鬣齿兽，蒙古鬣齿兽，兰州鬣齿兽等几个种类。鬣齿兽是非常成功及多样化的动物，但随着环境和猎物的改变和食肉目的兴起。它们约于早新近纪灭绝。",
                    "src": "./static-2/鬣齿兽.jpg"
                },
                {
                    "name": "灵长目分支",
                    "time": "4000万年前",
                    "children": [
                        {
                            "name": "原猴亚目",
                            "time": "4000万年前",
                            "src": "./static-2/原猴亚目.jpg"
                        },
                        {
                            "name": "简鼻亚目",
                            "time": "4000万年前",
                            "src": "./static-2/简鼻亚目.jpg"
                        }
                    ],
                    "src": "./static-2/灵长目分支.jpg"
                },
                {
                    "name": "龙王鲸演化",
                    "time": "4000-3700万年前",
                    "src": "./static-2/龙王鲸演化.jpg"
                },
                {
                    "name": "矛齿鲸",
                    "time": "4000万年前",
                    "description": "矛齿鲸(Dorudon atrox)矛齿鲸(Dorudon atrox)学名意为拥有矛状牙齿的鲸鱼，是龙王鲸科中的一个属，泛指矛齿鲸亚科的所有生物。体长5米左右，重约600公斤，生活在约3800万年前的始新世。肉食性，以鱼类、乌贼为主食。矛齿鲸生活于温暖的海域，北美洲与埃及都有发现它们的化石。由于矛齿鲸的外观与龙王鲸极为相似，所以矛齿鲸原先被认为是未成年的龙王鲸，但是后来矛齿鲸的幼鲸化石被发现，古生物学家才发现它们是不同种。虽然矛齿鲸看起来相当类似现代鲸类，不过它们没有办法像现代鲸类那样有效率的使用超音波。它们的鼻孔位在嘴与头顶的中间，就跟其他的龙王鲸类一样。",
                    "src": "./static-2/矛齿鲸.jpg"
                },
                {
                    "name": "爪兽",
                    "time": "4000万年前",
                    "description": "爪兽是一种很奇怪的动物，它身高有3米，常用指关节行走以保护长长的爪子。它那强有力的四肢是非常有效的防卫武器。但是更多时候，爪兽用它们的爪子钩下树枝，以便吃到最鲜嫩树叶。爪兽像大猩猩一样行走，像熊猫一样吃东西，但是现代动物中和它们亲缘关系最近的种类却是马。几千万年前，爪兽曾在北美、欧亚和非洲等大陆地区广泛生活过，并在大约一百万年前从地球上消失。爪兽是一种比较“边缘”的物种，从来没有真正繁盛过，保留下来的化石非常稀少、零散。爪兽是最令人费解的史前怪兽之一:在它生活的时代,它的足迹遍布亚洲、欧洲、北非和北美洲;爪兽有长的前肢、短的后肢和奇怪的长头—现代动物中和它亲缘关系最近的种类竟然是马。爪兽的体型介于山羊和猩猩之间,最大的爪兽站立时大约3米高。又大又长的头骨是爪兽和马最像的特征。爪兽的嘴里只长着用于咀嚼的后牙,而没有前牙。长的前肢能为爪兽提供一个好的攻击距离,但是这种爪子的构造是用来挖掘树根及扳掉树枝的,所以它的前肢在战斗时不能起到太大的作用",
                    "src": "./static-2/爪兽.jpg"
                },
                {
                    "name": "禾本科演化",
                    "time": "3500万年前",
                    "src": "./static-2/禾本科演化.jpg"
                },
                {
                    "name": "始新世-渐新世灭绝事件",
                    "time": "3400万年前",
                    "src": "./static-2/始新世-渐新世灭绝事件.jpg"
                },
                {
                    "name": "渐新世",
                    "time": "3400-2300万年前",
                    "description": "生物发展史上称从六千五百万年前到现代时间段为新生代，这包括地史上的第三纪和第四纪，第三纪又分为古新世、始新世、渐新世、中新世和上新世五个时期。渐新世是第三纪的第三个世，约开始于3650万年前，结束于2330万年前。渐新世时形成的地层称渐新统，位于始新统之上、中新统之下。1833年，英国C.莱伊尔把第三纪分成始新世、中新世和上新世。1854年，E.von贝利希在德国发现早于中新世、晚于始新世的沉积物，从而提出渐新世。当时特提斯海周围热带植物繁茂，德国的大部分地区温暖潮湿，因此 ，形成大规模的褐煤。在渐新世时海生动物有孔虫和货币虫占优势，陆生无脊椎动物丰富多样。在波罗的海区有许多昆虫，如蝴蝶、蜜蜂、蚂蚁和蜘蛛。陆生脊椎动物也丰富多样，分布于北美、欧洲、非洲和亚洲。渐新世被认为是一个重要的过渡时期，是一条连接“炎热的始新世时期的古老世界和生态系统更具有现代特征的中新世”的纽带。渐新世时期生态系统发生的一个重要改变是草原在全球的扩张，而热带阔叶林则萎缩至赤道一带。标志渐新世开始的事件是一起被称为大置换的大规模物种灭绝事件，当时欧洲的动物群，除了区域性的啮齿类动物和有袋类动物之外，都被来自亚洲的动物群所取代。渐新世和中新世则没有显著的全球性事件为其分野，而是各个地区相继从较温暖的渐新世晚期（2,600-2,300万年前）进入较寒冷的中新世。",
                    "src": "./static-2/渐新世.jpg"
                },
                {
                    "name": "简鼻亚目分支",
                    "time": "3000万年前",
                    "children": [
                        {
                            "name": "阔鼻小目",
                            "time": "3000万年前",
                            "src": "./static-2/阔鼻小目.jpg"
                        },
                        {
                            "name": "狭鼻小目",
                            "time": "3000万年前",
                            "src": "./static-2/狭鼻小目.jpg"
                        }
                    ],
                    "src": "./static-2/简鼻亚目分支.jpg"
                },
                {
                    "name": "巨犀",
                    "time": "2700万年前",
                    "description": "外形特征巨犀类的特征除了身材向巨大方向发展外, 它的颈部和四肢伸长更加后缩[ 从第三上前臼齿( P3)上方进一步后缩到第四上前臼齿( P4)之上] , 前颌骨前部逐渐往下弯, 第一上、下门齿变得越来越粗大, 第二、三对门齿、犬齿和第一对前臼齿逐渐退化, 进而消失。因此, 巨犀家族的后期种属演变得如此巨大是有一个过程的, 是逐渐的。 [1]头上无角，头、颈和四肢都很长，站起来肩部高可达5—6米，体全长12—13米，体长9米，体重15.吨，为已知最大的陆生哺乳动物。头骨长而低，长1米左右，但与其庞大的身躯相比，显得细小。额部隆起但无角；鼻骨光滑，向下弯曲。颈很长，肢长柱状。头上无角。牙齿结构简单，牙沟距椒子沟很近， [2]有一对钝门齿；颊齿低冠，前臼近长方形，第一前臼齿原尖特殊，具有很大的第四尖及发育不好的后尖；第二前臼原尖形成一长钩状脊与第四尖相连，后尖细而不与第四尖相连；第三前臼齿的后尖细而突出，弯曲于第四尖之内；臼齿简单；上第一臼齿具不发育的反前刺；上第三臼齿梯形，构造原始。估计主要以高层树枝上的嫩叶为食。-----生活环境:生存于亚欧大陆的第三纪中期（始新世——中新世），中国是这类动物的起源区和进化发展的中心。最早和比较原始类型的化石发现于我国始新世地层中 [3]。现生犀牛仅生活在南亚、东南亚、撒哈拉沙漠以南的非洲大部分地区和北非的部分地区。它们生活在热带和亚热带的稀疏草原和灌木丛生的地区。 它们吃各种植物, 并以多汁的植物为主。 现生的犀牛中仅非洲白犀( Ceratotherium simum)居住在草原上, 以食草为主。 亚洲犀牛主要吃与它的身高差不多的, 或 [1]较低处的植物, 如果子、树叶、嫩树枝、树皮、草和芦苇等。它们是喜欢潮湿温暖的动物。 根据现生的犀牛的生态来推断, 很可能巨犀也是喜欢潮湿温暖的动物。-----分布范围:产于亚洲、欧洲。蒙古、中国、土耳其、哈萨克斯坦、巴基斯坦都有发现。中国在内蒙、宁夏、云南始新世地层中发现较原始的化石，是最早的化石,被取名为小巨犀.巨犀家族是亚洲土生土长的土著居民, 也就是说, 它们起源于亚洲, 主要分布在亚洲, 后期可能稍往西扩展到东欧的高加索、罗马尼亚和南斯拉夫等地, 从未到过北美、西欧和非洲。 在亚洲的中国、蒙古、哈萨克斯坦、格鲁吉亚、巴基斯坦等地都发现过它们的踪迹。 其中以我国发现的化石最为丰富, 种类最多。巨犀家族最早、最原始的成员为在我国内蒙古二连盆地中始新统沙拉木仑组中发现的沙拉木仑小巨犀(Juxia sharamurunensis),最晚的代表为在我国新疆准噶尔盆地上渐新统中发现的霍尔果斯准噶尔巨犀(Dzungariotherium orgosensis)和巴基斯坦布格提( Bugti)地区的 布格提副巨 犀(Paraceratherium bugtiense)。 这样巨犀家族的地质历史的分布为从中始新世到晚渐新世",
                    "src": "./static-2/巨犀.jpg"
                },
                {
                    "name": "须鲸逐渐分化",
                    "time": "2500万年前",
                    "src": "./static-2/须鲸逐渐分化.jpg"
                },
                {
                    "name": "剑齿虎亚科",
                    "time": "2500万年前",
                    "description": "形态特征:巨大的上犬齿长达20厘米，可能是用来刺击乳齿象之类的大型草食动物。斯剑虎属的下述几种身体适应性变化使人推想到可能存在这样的狩猎技能：颅骨能以附着强健的颈目肌调节以利低头动作；下犬齿退化；腭能张开到约90°角，使上犬齿能不受限制地活动。臼齿形成剪刀状，而无磨研表面的痕迹。这一属许多成员的骨头曾在加利福尼亚、洛杉矶拉布雷亚（La Brea）大牧场的沥青坑里找到，显然是剑齿动物捕食大型草食动物时两者同时陷入沥青。刃齿虎属的祖先巨颏虎属，是上新世到中更新世时的中等大小剑齿猫科动物。狭义科学上真正的剑齿虎指的是短剑剑齿虎属（Machairodus），可以直接被称作剑齿虎。是一类剑齿较短的剑齿虎亚科成员，体型较刃齿虎小，不是很有名气。-----简介:剑齿虎亚科Machairodontinae，哺乳纲、真兽亚纲、食肉目的一亚科，与虎近似。上、下颁骨张开可达90°，上犬齿特别发达，扁平而尖锐，有的边缘呈锯齿状，齿冠高，可达5-6厘米。中新世至更新世，广泛分布于亚洲、欧洲、非洲及北美。我国河北、河南、山西、云南等地上新统及下更新统中化石很多 [1]。-----栖息地:普遍认为剑齿虎亚科都是生活在因冰河时期造成的寒冷地区。当中一些更确定它们生活在下雪的地方，而剑齿虎亚科的历史可追溯至温暖气候的渐新世，它们的多样化一同与生物体系成长。它们最终于1万年前才灭绝。-----猎食技巧:剑齿虎亚科怎样猎食一直备受争议。原先认为它们是以其犬齿直接咬死猎物，但是其牙齿却很易碎，对于大型的猎物会很易破坏牙齿，并影响猎食。一些科学家认为它们是以其牙齿割开大型动物的腹部，待猎物失血而死亡。当剑齿虎亚科猎食大型的有蹄动物时，它们的牙齿可以同时咬破动脉及静脉。它们的猎食方法却仍然会伤害牙齿，但却比前者有较低的风险。若剑齿虎亚科会表现自己，它们可能会征服该猎物才施以致命的一击。-----植物:在植物界中，高等植物区系与现代的几乎没有什么差别，低等植物中淡水硅藻较为常见。植物地理区已与现代近似。在古地理方面，在大陆边缘地区发生了小规模的海侵。在地壳运动方面，到了上新世，许多古近纪时形成的新山系继续隆起，山势基本与现代相近，如欧洲的阿尔卑斯山、亚洲的喜马拉雅山、南美的安底斯山等等。-----动物:哺乳动物又有新的发展，以形体增大为其特征。在海生无脊椎动物中，有孔虫类中的大型货币虫已经消失，为小型的有孔虫类所代替；六射珊瑚大量发展，形成大型珊瑚礁。淡水介形虫等大量繁育。在植物界中，高等植物区系与现代的几乎没有什么差别，低等植物中淡水硅藻较为常见，植物地理区已与现代近似。在古地理方面，新近纪只在大陆边缘地区发生小规模海侵，最后一次海退导致了第四纪的开始。在地壳运动方面，到了新近纪上新世，许多古近纪形成的新山系继续隆起，山势基本上与现代相近，如欧洲的阿尔卑斯山、亚洲的喜马拉雅山、南美洲的安第斯山等等。中国西部隆起成为山地，东部继续下降成为范围很广的凹陷平原，在隆起区沿断裂带发生连续的玄武岩喷发。",
                    "src": "./static-2/剑齿虎亚科.jpg"
                },
                {
                    "name": "雕齿兽",
                    "time": "2500万年前",
                    "description": "雕齿兽(Glyptodon) 是一种从化石中发现的犰狳状食草哺乳动物，生活在上新世、更新世期间的南美洲包括从阿根廷的彭巴斯草原、乌拉圭到巴西一带。存活直到更新世晚期（距今约30,000-8,500年前）。并在2千5百万年前北美洲及南美洲因巴拿马地峡的出现而连结时首次出现在美国西南部。它们在约于一万年前灭绝。相信住在它们附近的原住人类猎杀它们及以它们的壳来作为遮蔽。属于贫齿类动物，雕齿兽属，除下部外整个躯体包在由骨片形成的甲壳内。这个目下包括有食蚁兽、树懒、已灭绝的地懒及犰狳。",
                    "src": "./static-2/雕齿兽.jpg"
                },
                {
                    "name": "新近纪",
                    "time": "2300-260万年前",
                    "description": "海洋和大陆的植物群和动物群与现代相当。哺乳动物和鸟类仍然是占主导地位的陆生脊椎动物，并发展出多种形式来适应不同环境。第一个原始人，人类的祖先，出现在非洲并扩散到欧亚大陆。因为较冷的气候，许多热带植物物种被落叶森林和草地的取代。草因此多样化，大大地促进食草哺乳动物的进化，创造了许多食草动物如马，羚羊，和野牛。-----植物:在植物界中，高等植物区系与现代的几乎没有什么差别，低等植物中淡水硅藻较为常见。植物地理区已与现代近似。在古地理方面，在大陆边缘地区发生了小规模的海侵。在地壳运动方面，到了上新世，许多古近纪时形成的新山系继续隆起，山势基本与现代相近，如欧洲的阿尔卑斯山、亚洲的喜马拉雅山、南美的安底斯山等等。-----动物:哺乳动物又有新的发展，以形体增大为其特征。在海生无脊椎动物中，有孔虫类中的大型货币虫已经消失，为小型的有孔虫类所代替；六射珊瑚大量发展，形成大型珊瑚礁。淡水介形虫等大量繁育。在植物界中，高等植物区系与现代的几乎没有什么差别，低等植物中淡水硅藻较为常见，植物地理区已与现代近似。在古地理方面，新近纪只在大陆边缘地区发生小规模海侵，最后一次海退导致了第四纪的开始。在地壳运动方面，到了新近纪上新世，许多古近纪形成的新山系继续隆起，山势基本上与现代相近，如欧洲的阿尔卑斯山、亚洲的喜马拉雅山、南美洲的安第斯山等等。中国西部隆起成为山地，东部继续下降成为范围很广的凹陷平原，在隆起区沿断裂带发生连续的玄武岩喷发。",
                    "src": "./static-2/新近纪.jpg"
                },
                {
                    "name": "印度与亚洲碰撞",
                    "time": "2200万年前",
                    "children": [
                        {
                            "name": "喜马拉雅山及青藏高原形成",
                            "time": "2200万年前",
                            "src": "./static-2/喜马拉雅山及青藏高原形成.jpg"
                        }
                    ],
                    "src": "./static-2/印度与亚洲碰撞.jpg"
                },
                {
                    "name": "非洲板块与亚洲碰撞",
                    "time": "2000万年前",
                    "src": "./static-2/非洲板块与亚洲碰撞.jpg"
                },
                {
                    "name": "大地懒",
                    "time": "1700万年前",
                    "description": "大地懒（学名：Megatherium）是大地懒属哺乳动物的统称，又名大懒兽，是一种奇特的贫齿类动物， [6]大地懒可以长到五、六米长，三、四吨重，完全可以和亚洲象媲美。它们的头部比现存的树懒更显狭长，身躯则有些像熊，浑身长着又粗又长的毛，前后肢都长着三个巨大的爪子，后面还拖着条一米多长的粗壮有力的尾巴，脚上还长有长长的爪子，这些爪子意味它们无法把脚平放在地面上，所以跟食蚁兽一样，它必须用脚侧行走。 [1]大地懒是生活在南美洲大陆的最大型哺乳动物之一。 [6]根据它的化石研究，大地懒居住在数万年前更新世的阿根廷彭巴斯大草原，也可见于北美洲、中美洲和南美洲的其他地方。 [6]大地懒栖息在南美洲的林地、草地和荒野地带，主要在地面上活动，行动比较迟钝、笨重，能像大食蚁兽一样能用后肢脚侧直立行走，以足外缘着地，脚印呈逗号的形状。它们主要以树的枝叶为食，偶尔它们也会捕捉动物性食物，用巨爪将猎物抓伤，然后用强有力的前臂使猎物就范，而更多的情况可能是吃腐肉或从其他食肉动物的口中夺食。 [2]大地懒灭绝的时间相对较近，这意味着科学家能找到几种地懒的毛样本，因为毛是DNA非常好的来源。科学家们可能使用二趾树懒的卵合成大地懒的胚晶，但是，胎儿将很快大得大过它的“代孕妈妈”，当然，这些动物并非一科，成功复原的可能性极低",
                    "src": "./static-2/大地懒.jpg"
                },
                {
                    "name": "巨齿鲨",
                    "time": "1600万年前",
                    "description": "巨齿鲨（学名：Carcharocles megalodon），又名巨齿耳齿鲨， [20] [31]是耳齿鲨科拟噬人鲨属已灭绝的史前鲨鱼，也是已知体积最大、咬合力最大的顶级海洋掠食者。 [10-11] [17]成熟的成年巨齿鲨平均长度为10.2米，最长或可达25米；体重在30'000~65'000千克之间。其身体呈鱼雷形，有圆锥形的鼻子，巨大的胸鳍和背鳍，以及强有力的新月形尾巴。 [17]该物种拥有强大的咬合力，其下颌力量足以压碎一辆小型汽车。 [25]巨齿鲨分布极广，在欧洲、非洲、北美和南美洲的大部分地区均能发现其化石； [2]该物种主要栖息在温带和亚热带的近岸温暖海水中，同时也能够适应较高纬度的冷水环境， [2]这主要是因为它们拥有温血动物的一种特征，即能通过游泳肌肉的收缩来产生热量，从而实现体温调节功能。 [17]巨齿鲨为肉食性动物， [17]主要捕食鱼类和海洋哺乳动物； [17]猎食方式随猎物而异。 [30]巨齿鲨起源于渐新世晚期（约2800万年前）， [21-22]到中新世晚期，其分布范围已扩展到最大覆盖范围， [6] [18]但随着上新世全球气温转寒， [30]该物种种群数量逐渐减少， [17]最终灭绝于上新世末期（约260万年前）",
                    "src": "./static-2/巨齿鲨.jpg"
                },
                {
                    "name": "猿类迁徙",
                    "time": "1600万年前",
                    "src": "./static-2/猿类迁徙.jpg"
                },
                {
                    "name": "人类祖先形成",
                    "time": "1300万年前",
                    "src": "./static-2/人类祖先形成.jpg"
                },
                {
                    "name": "气候变冷",
                    "time": "1000万年前",
                    "src": "./static-2/气候变冷.jpg"
                },
                {
                    "name": "梅尔维尔利维坦鲸",
                    "time": "990万年前",
                    "description": "梅尔维尔利维坦鲸（学名：Livyatan 梅尔维尔鲸是新近纪最强大的海洋哺乳动物。梅尔维尔鲸体长18米，重65吨，体型与现在的雌性抹香鲸相当；牙齿长达35厘米，比巨齿鲨的牙齿长。 [6]梅尔维尔鲸因符合经典小说 《白鲸》（Moby Dick） [11]的描述，被研究者以小说作者梅尔维尔（Herman Melville）命名。 [7]梅尔维尔鲸的化石发现于距今1300万-1200万年的中新世岩层中。 [8]梅尔维尔鲸因受其巨大的头部和庞大体型的影响，游泳速度并不快， [9]咬合力惊人，它的脑油器可以对猎物进行声音定位；头部可以用作攻击猎物的武器。 [10]有研究表明梅尔维尔鲸的灭绝和气候变冷有一定的关系，气候变冷导致梅尔维尔鲸的食物减少，捕食越来越困难，同时，和巨齿鲨的竞争关系也加快了其灭亡的进程",
                    "src": "./static-2/梅尔维尔利维坦鲸.jpg"
                },
                {
                    "name": "巨猿出现",
                    "time": "700万年前",
                    "src": "./static-2/巨猿出现.jpg"
                },
                {
                    "name": "地中海干涸",
                    "time": "560万年前",
                    "src": "./static-2/地中海干涸.jpg"
                },
                {
                    "name": "人类祖先的出现",
                    "time": "500万年前",
                    "children": [
                        {
                            "name": "乍得人猿",
                            "time": "500万年前",
                            "src": "./static-2/乍得人猿.jpg"
                        },
                        {
                            "name": "千年人",
                            "time": "500万年前",
                            "src": "./static-2/千年人.jpg"
                        }
                    ],
                    "src": "./static-2/人类祖先的出现.jpg"
                },
                {
                    "name": "地猿出现",
                    "time": "480万年前",
                    "src": "./static-2/地猿出现.jpg"
                },
                {
                    "name": "南方古猿出现与演化",
                    "time": "390-370万年前",
                    "src": "./static-2/南方古猿演化.jpg"
                },
                {
                    "name": "南北美洲生物大迁徙",
                    "time": "300万年前",
                    "src": "./static-2/南北美洲生物大迁徙.jpg"
                }
            ],
            "src": "./static-2/新生代.jpg"
        },
        {
            "name": "第四纪",
            "time": "258万年前",
            "children": [
                {
                    "name": "能人尝试使用石器",
                    "time": "240万年前",
                    "description": "世界上第一个人 - 能人，是灵长目人科人属， [1]能人（Homo habilis），拉丁文的意思是“能干的人”，他们是工具制造者。与南方古猿之间的区别很小，有相似的身高和体重，大约高1.3米、重40公斤，双足直立。能人的头骨和面部看起来已不大像猿了，头比较高和圆一些，面部也不太突出。最明显的解剖上的区别是牙齿，臼齿更窄、前齿更小，同时门齿变大而更像铲形。 [2]能人出现于200多万年前的东非地区，生活在如今的肯尼亚、埃塞俄比亚和坦桑尼亚。他们出现的时期正是非洲大草原变得干涸和草木稀疏的时期。早期的能人过着小群体式的聚居生活，会到不同的地方寻找食物，常常住在湖边或河边，用石头把兽皮或树枝固定在地面上，搭建简陋的类似窝棚的住所。能人最初出现的时候，只以采集的水果为食。当他们学会了打制石器后，就可以狩猎并共同享用。 [3]能人是最早的真人，一般认为是南方古猿的后代，比南方古猿进步。能人的脸比南方古猿的脸更加扁平，额头更高，脑容量更大，大约有700毫升，也比南方古猿聪明。 [3]能人是匠人的祖先，而匠人则是更后期的直立人的祖先。 [4]能人已经会用石头或骨头打制工具，用于狩猎或切割猎物的皮肉，但他们还不会制作木头工具，只会使用比较简单的石器",
                    "src": "./static-2/能人尝试使用石器.jpg"
                },
                {
                    "name": "直立人出现",
                    "time": "180万年前",
                    "description": "直立人，是人科 [2]人属直立人种，是猿人到智人的中间环节 [3]。直立人因直立行走，其腿骨与现代人基本相似。脑容量逐渐增加，早期直立人脑容量为700-900毫升，后期直立人的脑容量为900-1200毫升。早期直立人身高为1.10-1.30米，后期直立人为1.30-1.50米。早期直立人牙齿较大，后期直立人牙齿变小，主要是后部牙齿。此外，面部也发生一些变化，如下颌更加突出等 [4]。直立人起源于东非，经非洲进入中东地区，然后到亚洲，再到欧洲。生活年代在大约190万年前至2.7万年前，正好是更新世，是冰川活动高峰期，共发生过5次较大规模的冰川，气温降低，海平面下降，有利于迁移活动。直立人在人类发展史上属于旧石器时代，以使用打制石器为标志的人类物质文化发展阶段。主要靠摔击、锤击、砸击打制石器，还不会磨制。所以生产力低下，很难猎取大型动物。杂食性，以采集为主，或吃食肉动物剩下的猎物，群聚、巢居、穴居或在树上建屋。有猎食同类的习惯。从早期开始即会使用火 [4]。直立人化石最初是1891年在印度尼西亚的爪哇发现的，当时引起了所发现的这批化石是人还是猿的争论，直到20世纪20年代在中国北京周口店陆续发现了北京猿人的化石和石器，才确立了直立人在人类演化史上的地位",
                    "children": [
                        {
                            "name": "格鲁及亚人",
                            "time": "175万年前",
                            "description": "格鲁及亚人有直立人及能人的特征。",
                            "src": "./static-2/格鲁及亚人.jpg"
                        },
                    ],
                    "src": "./static-2/直立人出现.jpg"
                },
                {
                    "name": "人类学会用火",
                    "time": "170万年前",
                    "src": "./static-2/人类学会用火.jpg"
                },
                {
                    "name": "人类走出非洲",
                    "time": "80万年前",
                    "src": "./static-2/人类走出非洲.jpg"
                },
                {
                    "name": "尼安德特人进入欧洲",
                    "time": "40万年前",
                    "description": "尼安德特人（拉丁文学名homo neanderthalens，又译尼安德塔人）是一种在大约12万到3万年前居住在欧洲及西亚的古人类，属于早期智人的一种 [14]。尼安德特人头骨化石最初在1829年发现于比利时，但是直到1856年在德国的尼安德Neander山谷中的一个山洞发现了头盖骨和其他骨骼，并被命名为尼安德特人（Homo neanderthalensis）后才广为人知（Wolpoff，1996）。化石证据显示，其比早期现代人稍矮但身体和四肢粗壮，平均脑量稍大，晚更新世广布于欧洲，在西亚和中亚也有分布；至少在23万年前就已经出现，由于冰期的兴盛，约在3万年前灭绝（Hublin，2009）。发现尼安德特人化石的那个山洞里没有发现动物化石和石器，当时不能判断人骨的年代，世人对于这个研究结论也是疑信参半。时间过了二十几年后，1886年在比利时的斯彼地方又发现了两个头骨，形态与30年前在尼安德山谷出土的很接近，与现代人显然不同。与尼安德的发现不同的是，这次还出土了大量动物化石与人骨相伴。动物化石中有属于洞熊、驯鹿、披毛犀和古象等的骨骼和牙齿。由于当时古生物学已经认识到其中有许多动物早已绝灭，斯彼这些人骨代表古老的与现代人显然不同的人类的看法得到大家的认同。而尼安德特人的形态特征与之相同，尼安德特人在人类进化史中的位置也就站住了。1908年在法国的圣沙拜尔村附近一个山洞里发现了一副基本完整的男人骨架化石。其头骨与已经发现的那些尼安德特人头骨大同小异，所以科学家把这副骨架当作尼安德特人的典型代表，开始对尼安德特人身体各部分骨骼的构造和形态有了比较全面的了解。尼安德特人与现代人在同一时空内共存了很长一段时间。对于尼安德特人是否是单独物种还是智人的一个亚种，在20世纪和21世纪初长期存在争议。虽然基于化石的形态学研究早已表明尼安德特人与智人进行过杂交（Duarte et al.，1999；Trinkaus et al.，2003），但直至Green等（2010）利用古DNA信息证实尼安德特人与智人存在基因交流后，科学家们才达成尼安德特人是智人的一个亚种的共识。-----起源进化:尼安德特人的祖先可以推溯至约40~60万年以前的海德堡人。在德国、法国、比利时和意大利的许多地方都发现了确定是尼安德特人的下腭、牙齿和头盖骨部分。尼安德特人的进化问题仍在争论之中。一些人主张尼安德特人中的一些种群在玉木冰期时被隔离于西欧，发展成为适应于寒冷气候的、特化了的所谓典型尼安德特人（Typical neanderthals），例如圣沙拜尔人、费拉西人和尼安德特人等。而另有一些种群被称为进步尼安德特人（Progressive neanderthals）或一般化尼安德特人（Generalized neanderthals），如塔邦人、施泰因汉人和斯旺斯柯姆人等发展了现代人的特征，成为现代智人类型的祖先，此即所谓“前尼安德特人说”（Preneanderthal hypothesis）。但提倡“前智人说”（Presapiens hypothesis）的法国学者H.瓦卢瓦则主张，现代智人和欧洲尼安德特人的祖先可以早到民德-利斯（Mindel-Riss）间冰期。这两种学说虽然在追溯玉木时期的尼安德特人和现代智人类型的共同祖先的时间上有早晚之异，但都认为欧洲尼安德特人没有后代。与之对立的学说是“单系说”（Unilinear hypothesis），它主张直立人之后只有一个系统，它是连续进化的，经过尼安德特人“尼安德特人阶段”进化到现代人，换言之，尼安德特人是现代人的直接祖先。单系说的传统观点为G.施瓦尔贝、H.赫尔德利奇卡、F.魏敦瑞等人所持，为C.布雷斯和M.H.沃尔波夫等人所极力推崇。至于典型尼安德特人的消失问题有两种意见：一种说法认为尼安德特人受到气候恶化的因素和进入其居住地区的现代人拥有人口数量、社会整体性、文明程度的优势，使现代人在族群纷争中取胜，代替了此前更加原始的文明。另外一种说法认为，尼安德特人被毁灭于快速的气候变化。",
                    "src": "./static-2/尼安德特人进入欧洲.jpg"
                },
                {
                    "name": "智人出现和演化",
                    "time": "25-4万年前",
                    "description": "智人（学名：Homo sapiens），是人属下的唯一现存物种。形态特征比直立人更为进步。分为早期智人和晚期智人。早期智人过去曾叫古人，生活在距今25万～4万年前，主要特征是脑容量大，在1300毫升以上；眉嵴发达，前额较倾斜，枕部突出，鼻部宽扁，颌部前突。一般认为是由直立人进化来的，但有争议 [1]，认为直立人在后来崛起的智人（现代人）走出非洲后灭绝或在此之前就灭绝了。晚期智人（新人）是解剖结构上的现代人。大约从距今四五万年前开始出现。两者形态上的主要差别在于前部牙齿和面部减小，眉嵴减弱，颅高增大，到现代人则更加明显。晚期智人臂不过膝，体毛退化，有语言和劳动，有社会性和阶级性。",
                    "children": [
                        {
                            "name": "奥莫化石遗存",
                            "time": "19.5万年前",
                            "description": "埃塞俄比亚奥莫河的奥莫化石遗存是最早的人类。",
                            "src": "./static-2/奥莫化石遗存.jpg"
                        },
                        {
                            "name": "长者智人",
                            "time": "16万年前",
                            "description": "长者智人练习礼仪及宰杀河马。",
                            "src": "./static-2/长者智人.jpg"
                        },
                        {
                            "name": "线粒体夏娃",
                            "time": "15万年前",
                            "description": "线粒体夏娃在非洲生活，她是所有现今人类的最后女性祖先。",
                            "src": "./static-2/线粒体夏娃.jpg"
                        },
                        {
                            "name": "人类演化",
                            "time": "公元前10万年前",
                            "description": "第一个人类从海德堡人演化及在非洲出现。人类生活在南非及以色列。",
                            "src": "./static-2/人类演化.jpg"
                        },
                        {
                            "name": "人类文化发展",
                            "time": "公元前8.25万年前",
                            "description": "人类在萨伊使用锋利的动物骨头捕鱼。",
                            "src": "./static-2/人类文化发展.jpg"
                        },
                        {
                            "name": "人类技术进步",
                            "time": "公元前8万年前",
                            "description": "人类在刚果制造鱼叉。",
                            "src": "./static-2/人类技术进步.jpg"
                        },
                        {
                            "name": "多峇巨灾理论",
                            "time": "公元前7.4万年前",
                            "description": "多峇湖的超级火山爆发，人类人口只剩2000。",
                            "src": "./static-2/多峇巨灾理论.jpg"
                        },
                        {
                            "name": "末次冰期",
                            "time": "7-1.15万年前",
                            "description": "最后的冰河时期-",
                            "children": [
                                {
                                    "name": "威斯康辛冰期",
                                    "time": "7万年前",
                                    "description": "最近的冰河时期，威斯康辛冰期开始。",
                                    "src": "./static-2/威斯康辛冰期.jpg"
                                },
                                {
                                    "name": "人类文化发展",
                                    "time": "公元前7万年前",
                                    "description": "人类在南非布隆伯斯洞穴以骨头制造工具，及画壁画。",
                                    "src": "./static-2/人类文化发展.jpg"
                                }
                            ],
                            "src": "./static-2/最后的冰河时期.jpg"
                        },
                        {
                            "name": "Y染色体亚当",
                            "time": "公元前6万年前",
                            "description": "Y染色体亚当在非洲生活，是人类男性Y染色体的最后祖先。",
                            "src": "./static-2/Y染色体亚当.jpg"
                        },
                        {
                            "name": "人类扩散",
                            "time": "公元前5万年前",
                            "description": "人类由亚洲延伸至澳洲及欧洲。",
                            "src": "./static-2/人类扩散.jpg"
                        },
                        {
                            "name": "克罗马侬人",
                            "time": "公元前4万年前",
                            "description": "克罗马侬人在法国绘画及捕猎猛犸象。",
                            "src": "./static-2/克罗马侬人.jpg"
                        }
                    ],
                    "src": "./static-2/智人出现.jpg"
                },
                {
                    "name": "人类艺术",
                    "time": "公元前3.2万年前",
                    "description": "德国福格海德有第一个雕塑史前狮子人雕像。",
                    "src": "./static-2/人类艺术.jpg"
                },
                {
                    "name": "人类迁徙",
                    "time": "公元前3万年前",
                    "description": "人类从西伯利亚分几波进入北美洲。",
                    "src": "./static-2/人类迁徙.jpg"
                },
                {
                    "name": "尼安德特人消失",
                    "time": "公元前2.2万年前",
                    "description": "尼安德特人消失，人属只余下人类及佛罗勒斯人。",
                    "src": "./static-2/尼安德特人消失.jpg"
                },
                {
                    "name": "人类文明发展",
                    "time": "公元前2万年前",
                    "description": "人类在青藏高原留下脚印及手印。",
                    "src": "./static-2/人类文明发展.jpg"
                },
                {
                    "name": "农业起源",
                    "time": "公元前1.5万年前",
                    "description": "最后的冰河时期完结，海水漫过全球，造成多个近岸地区水浸。",
                    "src": "./static-2/农业起源.jpg"
                },
                {
                    "name": "全新世灭绝事件",
                    "time": "公元前1.4万年前",
                    "description": "超过100种大型哺乳动物消失。",
                    "src": "./static-2/全新世灭绝事件.jpg"
                },
                {
                    "name": "新仙女木事件",
                    "time": "公元前1.28万年前",
                    "description": "“新仙女木”事件是末次冰消期持续升温过程中的一次突然降温的典型非轨道事件，对于研究古气候、古环境的快速突变事件和短周期现象，合理评估现今气候一环境条件并做出气候变化的预测有着重要的意义。它是一个全球性的事件，中国东部陆架海也普遍发现了“新仙女木”事件的沉积记录。由于中国东部陆架位于欧亚大陆和太平洋之间，受季风的强烈影响，因此有着独特的响应。科学家认为，爆炸产生的热量和压力可能融化了格陵兰冰层，改变了气流并对气候产生影响，并引起灰尘的出现，而这些灰尘遮蔽了太阳，降低了气温，最后危及到植物和动物。该发现对近几十年来争议最大的3个问题做出了解释。这3个问题是：克劳维斯人的突然消失、巨兽的灭绝以及地球温度的骤降之谜。以前，人们一致认为是气温骤降导致了克劳维斯人的灭绝。凯内特说：“这些发现提供了强有力的证据，表明大约1.29万年前发生的彗星撞地球事件影响了北美的植物、动物和人类。”公元前8200年也有一次降温事件，在温暖的冰后期气候背景下，气温忽然下降。它发生在公元前8490年-公元前8200年之间，持续不过两百多年，且气温下降的幅度、涉及的范围远远不及新仙女木事件。仙女木事件发生非常突然，但是至今仍未有足够的证据证明其发生的原因。比较流行的假说是彗星撞击地球导致温度下降。-----证据:美国科学家称，他们对北美纳米钻石的研究表明，大约1.29万年前，一大团彗星袭击了地球，造成地球的气温骤降，导致了长毛猛犸象和其他生物的灭绝，也让美国印第安克劳维斯人从此消失。该研究成果发表在1月2日出版的《科学》杂志上。美国俄勒冈州立大学考古学家东·凯内特领导的团队在1.29万年前的沉积物中发现了这些肉眼几乎看不见的钻石，并进行了研究，这些钻石散落于北美很多地方的泥土中，其中一处更是位于亚利桑那州梅利泉的克劳维斯遗址之上。-----疑问:新仙女木撞击假说认为，1.28万年前的新仙女木变冷期是由于一颗小行星撞击形成的，这是建立在多个地点发现的一场撞击的证据的基础之上的，但是对其中29个这类地点的撞击证据的一项研究发现，只有3个地点显示出了类似于新仙女木事件起始的年龄，而且由于这些地点的撞击指示物的残骸的年龄跨度很大，这些发现提示，或者有比此前认为的更多的小行星撞击在历史上发生，或者新仙女木时期不是一次地外撞击的结果。",
                    "src": "./static-2/新仙女木事件.jpg"
                },
                {
                    "name": "人类的农业发展",
                    "time": "公元前1万年前",
                    "children": [
                        {
                            "name": "农业起源",
                            "time": "公元前1.04万年前",
                            "description": "开始种植植物，在近东耕种。",
                            "src": "./static-2/农业起源.jpg"
                        },
                        {
                            "name": "农业扩展",
                            "time": "公元前6千年前",
                            "description": "亚洲西南部、叙利亚、约旦、土耳其及伊拉克种植麦。",
                            "src": "./static-2/农业扩展.jpg"
                        },
                        {
                            "name": "稻作农业",
                            "time": "公元前4500年前",
                            "description": "种植亚洲型稻及非洲型稻。",
                            "src": "./static-2/稻作农业.jpg"
                        }
                    ],
                    "src": "./static-2/人类的农业发展.jpg"
                },
                {
                    "name": "人类文明发展",
                    "time": "公元前7000年前-现在",
                    "src": "./static-2/人类文明发展.jpg"
                }
            ],
            "src": "./static-2/第四纪.jpg"
        }
    ]
}

